frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  struct {
    word PB0         :1;                                       /* Port B Bit 0 */
    word PB1         :1;                                       /* Port B Bit 1 */
    word PB2         :1;                                       /* Port B Bit 2 */
    word PB3         :1;                                       /* Port B Bit 3 */
    word PB4         :1;                                       /* Port B Bit 4 */
    word PB5         :1;                                       /* Port B Bit 5 */
    word PB6         :1;                                       /* Port B Bit 6 */
    word PB7         :1;                                       /* Port B Bit 7 */
    word PA0         :1;                                       /* Port A Bit 0 */
    word PA1         :1;                                       /* Port A Bit 1 */
    word PA2         :1;                                       /* Port A Bit 2 */
    word PA3         :1;                                       /* Port A Bit 3 */
    word PA4         :1;                                       /* Port A Bit 4 */
    word PA5         :1;                                       /* Port A Bit 5 */
    word PA6         :1;                                       /* Port A Bit 6 */
    word PA7         :1;                                       /* Port A Bit 7 */
  } Bits;
  struct {
    word grpPB   :8;
    word grpPA   :8;
  } MergedBits;
} PORTABSTR;
extern volatile PORTABSTR _PORTAB @(REG_BASE + 0x00000000);
#define PORTAB _PORTAB.Word
#define PORTAB_PB0 _PORTAB.Bits.PB0
#define PORTAB_PB1 _PORTAB.Bits.PB1
#define PORTAB_PB2 _PORTAB.Bits.PB2
#define PORTAB_PB3 _PORTAB.Bits.PB3
#define PORTAB_PB4 _PORTAB.Bits.PB4
#define PORTAB_PB5 _PORTAB.Bits.PB5
#define PORTAB_PB6 _PORTAB.Bits.PB6
#define PORTAB_PB7 _PORTAB.Bits.PB7
#define PORTAB_PA0 _PORTAB.Bits.PA0
#define PORTAB_PA1 _PORTAB.Bits.PA1
#define PORTAB_PA2 _PORTAB.Bits.PA2
#define PORTAB_PA3 _PORTAB.Bits.PA3
#define PORTAB_PA4 _PORTAB.Bits.PA4
#define PORTAB_PA5 _PORTAB.Bits.PA5
#define PORTAB_PA6 _PORTAB.Bits.PA6
#define PORTAB_PA7 _PORTAB.Bits.PA7
#define PORTAB_PB _PORTAB.MergedBits.grpPB
#define PORTAB_PA _PORTAB.MergedBits.grpPA

#define PORTAB_PB0_MASK   1
#define PORTAB_PB1_MASK   2
#define PORTAB_PB2_MASK   4
#define PORTAB_PB3_MASK   8
#define PORTAB_PB4_MASK   16
#define PORTAB_PB5_MASK   32
#define PORTAB_PB6_MASK   64
#define PORTAB_PB7_MASK   128
#define PORTAB_PA0_MASK   256
#define PORTAB_PA1_MASK   512
#define PORTAB_PA2_MASK   1024
#define PORTAB_PA3_MASK   2048
#define PORTAB_PA4_MASK   4096
#define PORTAB_PA5_MASK   8192
#define PORTAB_PA6_MASK   16384
#define PORTAB_PA7_MASK   32768
#define PORTAB_PB_MASK  255
#define PORTAB_PB_BITNUM  0
#define PORTAB_PA_MASK  65280
#define PORTAB_PA_BITNUM  8


/*** DDRAB - Port AB Data Direction; 0x00000002 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDRA - Port A Data Direction Register; 0x00000002 ***/
    union {
      byte Byte;
      struct {
        byte DDRA0       :1;                                       /* Data Direction Port A Bit 0 */
        byte DDRA1       :1;                                       /* Data Direction Port A Bit 1 */
        byte DDRA2       :1;                                       /* Data Direction Port A Bit 2 */
        byte DDRA3       :1;                                       /* Data Direction Port A Bit 3 */
        byte DDRA4       :1;                                       /* Data Direction Port A Bit 4 */
        byte DDRA5       :1;                                       /* Data Direction Port A Bit 5 */
        byte DDRA6       :1;                                       /* Data Direction Port A Bit 6 */
        byte DDRA7       :1;                                       /* Data Direction Port A Bit 7 */
      } Bits;
      struct {
        byte grpDDRA :8;
      } MergedBits;
    } DDRASTR;
    #define DDRA _DDRAB.Overlap_STR.DDRASTR.Byte
    #define DDRA_DDRA0 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA0
    #define DDRA_DDRA1 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA1
    #define DDRA_DDRA2 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA2
    #define DDRA_DDRA3 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA3
    #define DDRA_DDRA4 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA4
    #define DDRA_DDRA5 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA5
    #define DDRA_DDRA6 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA6
    #define DDRA_DDRA7 _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA7
    
    #define DDRA_DDRA _DDRAB.Overlap_STR.DDRASTR.MergedBits.grpDDRA
    
    #define DDRA_DDRA0_MASK   1
    #define DDRA_DDRA1_MASK   2
    #define DDRA_DDRA2_MASK   4
    #define DDRA_DDRA3_MASK   8
    #define DDRA_DDRA4_MASK   16
    #define DDRA_DDRA5_MASK   32
    #define DDRA_DDRA6_MASK   64
    #define DDRA_DDRA7_MASK   128
    #define DDRA_DDRA_MASK  255
    #define DDRA_DDRA_BITNUM  0


    /*** DDRB - Port B Data Direction Register; 0x00000003 ***/
    union {
      byte Byte;
      struct {
        byte DDRB0       :1;                                       /* Data Direction Port B Bit 0 */
        byte DDRB1       :1;                                       /* Data Direction Port B Bit 1 */
        byte DDRB2       :1;                                       /* Data Direction Port B Bit 2 */
        byte DDRB3       :1;                                       /* Data Direction Port B Bit 3 */
        byte DDRB4       :1;                                       /* Data Direction Port B Bit 4 */
        byte DDRB5       :1;                                       /* Data Direction Port B Bit 5 */
        byte DDRB6       :1;                                       /* Data Direction Port B Bit 6 */
        byte DDRB7       :1;                                       /* Data Direction Port B Bit 7 */
      } Bits;
      struct {
        byte grpDDRB :8;
      } MergedBits;
    } DDRBSTR;
    #define DDRB _DDRAB.Overlap_STR.DDRBSTR.Byte
    #define DDRB_DDRB0 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB0
    #define DDRB_DDRB1 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB1
    #define DDRB_DDRB2 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB2
    #define DDRB_DDRB3 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB3
    #define DDRB_DDRB4 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB4
    #define DDRB_DDRB5 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB5
    #define DDRB_DDRB6 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB6
    #define DDRB_DDRB7 _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB7
    
