frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile GPAGESTR _GPAGE @(REG_BASE + 0x00000010);
#define GPAGE _GPAGE.Byte
#define GPAGE_GP0 _GPAGE.Bits.GP0
#define GPAGE_GP1 _GPAGE.Bits.GP1
#define GPAGE_GP2 _GPAGE.Bits.GP2
#define GPAGE_GP3 _GPAGE.Bits.GP3
#define GPAGE_GP4 _GPAGE.Bits.GP4
#define GPAGE_GP5 _GPAGE.Bits.GP5
#define GPAGE_GP6 _GPAGE.Bits.GP6
#define GPAGE_GP _GPAGE.MergedBits.grpGP

#define GPAGE_GP0_MASK   1
#define GPAGE_GP1_MASK   2
#define GPAGE_GP2_MASK   4
#define GPAGE_GP3_MASK   8
#define GPAGE_GP4_MASK   16
#define GPAGE_GP5_MASK   32
#define GPAGE_GP6_MASK   64
#define GPAGE_GP_MASK  127
#define GPAGE_GP_BITNUM  0


/*** DIRECT - Direct Page Register; 0x00000012 ***/
typedef union {
  byte Byte;
  struct {
    byte DP8         :1;                                       /* Direct Page Bit 8 */
    byte DP9         :1;                                       /* Direct Page Bit 9 */
    byte DP10        :1;                                       /* Direct Page Bit 10 */
    byte DP11        :1;                                       /* Direct Page Bit 11 */
    byte DP12        :1;                                       /* Direct Page Bit 12 */
    byte DP13        :1;                                       /* Direct Page Bit 13 */
    byte DP14        :1;                                       /* Direct Page Bit 14 */
    byte DP15        :1;                                       /* Direct Page Bit 15 */
  } Bits;
  struct {
    byte grpDP_8 :8;
  } MergedBits;
} DIRECTSTR;
extern volatile DIRECTSTR _DIRECT @(REG_BASE + 0x00000012);
#define DIRECT _DIRECT.Byte
#define DIRECT_DP8 _DIRECT.Bits.DP8
#define DIRECT_DP9 _DIRECT.Bits.DP9
#define DIRECT_DP10 _DIRECT.Bits.DP10
#define DIRECT_DP11 _DIRECT.Bits.DP11
#define DIRECT_DP12 _DIRECT.Bits.DP12
#define DIRECT_DP13 _DIRECT.Bits.DP13
#define DIRECT_DP14 _DIRECT.Bits.DP14
#define DIRECT_DP15 _DIRECT.Bits.DP15
#define DIRECT_DP_8 _DIRECT.MergedBits.grpDP_8
#define DIRECT_DP DIRECT_DP_8

#define DIRECT_DP8_MASK   1
#define DIRECT_DP9_MASK   2
#define DIRECT_DP10_MASK   4
#define DIRECT_DP11_MASK   8
#define DIRECT_DP12_MASK   16
#define DIRECT_DP13_MASK   32
#define DIRECT_DP14_MASK   64
#define DIRECT_DP15_MASK   128
#define DIRECT_DP_8_MASK  255
#define DIRECT_DP_8_BITNUM  0


/*** MISC - Miscellaneous System Control Register; 0x00000013 ***/
typedef union {
  byte Byte;
  struct {
    byte ROMON       :1;                                       /* Enable Flash EEPROM */
    byte ROMHM       :1;                                       /* Flash EEPROM only in second half of memory map */
    byte EXSTR0      :1;                                       /* External Access Stretch Bit 0 */
    byte EXSTR1      :1;                                       /* External Access Stretch Bit 1 */
    byte EROMON      :1;                                       /* Emulation Mode Enable FLASH EEPROM or ROM */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpEXSTR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MISCSTR;
extern volatile MISCSTR _MISC @(REG_BASE + 0x00000013);
#define MISC _MISC.Byte
#define MISC_ROMON _MISC.Bits.ROMON
#define MISC_ROMHM _MISC.Bits.ROMHM
#define MISC_EXSTR0 _MISC.Bits.EXSTR0
#define MISC_EXSTR1 _MISC.Bits.EXSTR1
#define MISC_EROMON _MISC.Bits.EROMON
#define MISC_EXSTR _MISC.MergedBits.grpEXSTR

#define MISC_ROMON_MASK   1
#define MISC_ROMHM_MASK   2
#define MISC_EXSTR0_MASK   4
#define MISC_EXSTR1_MASK   8
#define MISC_EROMON_MASK   16
#define MISC_EXSTR_MASK  12
#define MISC_EXSTR_BITNUM  2


/*** RPAGE - RAM Page Index Register; 0x00000016 ***/
typedef union {
  byte Byte;
  struct {
    byte RP0         :1;                                       /* RAM Page Index Bit 0 */
    byte RP1         :1;                                       /* RAM Page Index Bit 1 */
    byte RP2         :1;                                       /* RAM Page Index Bit 2 */
    byte RP3         :1;                                       /* RAM Page Index Bit 3 */
    byte RP4         :1;                                       /* RAM Page Index Bit 4 */
    byte RP5         :1;                                       /* RAM Page Index Bit 5 */
    byte RP6         :1;                                       /* RAM Page Index Bit 6 */
    byte RP7         :1;                                       /* RAM Page Index Bit 7 */
  } Bits;
  struct {
    byte grpRP   :8;
  } MergedBits;
} RPAGESTR;
extern volatile RPAGESTR _RPAGE @(REG_BASE + 0x00000016);
#define RPAGE _RPAGE.Byte
#define RPAGE_RP0 _RPAGE.Bits.RP0
#define RPAGE_RP1 _RPAGE.Bits.RP1
#define RPAGE_RP2 _RPAGE.Bits.RP2
#define RPAGE_RP3 _RPAGE.Bits.RP3
#define RPAGE_RP4 _RPAGE.Bits.RP4
#define RPAGE_RP5 _RPAGE.Bits.RP5
#define RPAGE_RP6 _RPAGE.Bits.RP6
#define RPAGE_RP7 _RPAGE.Bits.RP7
#define RPAGE_RP _RPAGE.MergedBits.grpRP

#define RPAGE_RP0_MASK   1
#define RPAGE_RP1_MASK   2
#define RPAGE_RP2_MASK   4
#define RPAGE_RP3_MASK   8
#define RPAGE_RP4_MASK   16
#define RPAGE_RP5_MASK   32
#define RPAGE_RP6_MASK   64
#define RPAGE_RP7_MASK   128
#define RPAGE_RP_MASK  255
#define RPAGE_RP_BITNUM  0


/*** EPAGE - EEPROM Page Index Register; 0x00000017 ***/
typedef union {
  byte Byte;
  struct {
    byte EP0         :1;                                       /* EEPROM Page Index Bit 0 */
    byte EP1         :1;                                       /* EEPROM Page Index Bit 1 */
    byte EP2         :1;                                       /* EEPROM Page Index Bit 2 */
    byte EP3         :1;                                       /* EEPROM Page Index Bit 3 */
    byte EP4         :1;                                       /* EEPROM Page Index Bit 4 */
    byte EP5         :1;                                       /* EEPROM Page Index Bit 5 */
    byte EP6         :1;                                       /* EEPROM Page Index Bit 6 */
    byte EP7         :1;                                       /* EEPROM Page Index Bit 7 */
  } Bits;
  struct {
    byte grpEP   :8;
  } MergedBits;
} EPAGESTR;
