frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile EPAGESTR _EPAGE @(REG_BASE + 0x00000017);
#define EPAGE _EPAGE.Byte
#define EPAGE_EP0 _EPAGE.Bits.EP0
#define EPAGE_EP1 _EPAGE.Bits.EP1
#define EPAGE_EP2 _EPAGE.Bits.EP2
#define EPAGE_EP3 _EPAGE.Bits.EP3
#define EPAGE_EP4 _EPAGE.Bits.EP4
#define EPAGE_EP5 _EPAGE.Bits.EP5
#define EPAGE_EP6 _EPAGE.Bits.EP6
#define EPAGE_EP7 _EPAGE.Bits.EP7
#define EPAGE_EP _EPAGE.MergedBits.grpEP

#define EPAGE_EP0_MASK   1
#define EPAGE_EP1_MASK   2
#define EPAGE_EP2_MASK   4
#define EPAGE_EP3_MASK   8
#define EPAGE_EP4_MASK   16
#define EPAGE_EP5_MASK   32
#define EPAGE_EP6_MASK   64
#define EPAGE_EP7_MASK   128
#define EPAGE_EP_MASK  255
#define EPAGE_EP_BITNUM  0


/*** PARTIDH - Part ID Register High; 0x0000001A ***/
typedef union {
  byte Byte;
  struct {
    byte ID8         :1;                                       /* Part ID Register Bit 8 */
    byte ID9         :1;                                       /* Part ID Register Bit 9 */
    byte ID10        :1;                                       /* Part ID Register Bit 10 */
    byte ID11        :1;                                       /* Part ID Register Bit 11 */
    byte ID12        :1;                                       /* Part ID Register Bit 12 */
    byte ID13        :1;                                       /* Part ID Register Bit 13 */
    byte ID14        :1;                                       /* Part ID Register Bit 14 */
    byte ID15        :1;                                       /* Part ID Register Bit 15 */
  } Bits;
  struct {
    byte grpID_8 :8;
  } MergedBits;
} PARTIDHSTR;
extern volatile PARTIDHSTR _PARTIDH @(REG_BASE + 0x0000001A);
#define PARTIDH _PARTIDH.Byte
#define PARTIDH_ID8 _PARTIDH.Bits.ID8
#define PARTIDH_ID9 _PARTIDH.Bits.ID9
#define PARTIDH_ID10 _PARTIDH.Bits.ID10
#define PARTIDH_ID11 _PARTIDH.Bits.ID11
#define PARTIDH_ID12 _PARTIDH.Bits.ID12
#define PARTIDH_ID13 _PARTIDH.Bits.ID13
#define PARTIDH_ID14 _PARTIDH.Bits.ID14
#define PARTIDH_ID15 _PARTIDH.Bits.ID15
#define PARTIDH_ID_8 _PARTIDH.MergedBits.grpID_8
#define PARTIDH_ID PARTIDH_ID_8

#define PARTIDH_ID8_MASK   1
#define PARTIDH_ID9_MASK   2
#define PARTIDH_ID10_MASK   4
#define PARTIDH_ID11_MASK   8
#define PARTIDH_ID12_MASK   16
#define PARTIDH_ID13_MASK   32
#define PARTIDH_ID14_MASK   64
#define PARTIDH_ID15_MASK   128
#define PARTIDH_ID_8_MASK  255
#define PARTIDH_ID_8_BITNUM  0


/*** PARTIDL - Part ID Register Low; 0x0000001B ***/
typedef union {
  byte Byte;
  struct {
    byte ID0         :1;                                       /* Part ID Register Bit 0 */
    byte ID1         :1;                                       /* Part ID Register Bit 1 */
    byte ID2         :1;                                       /* Part ID Register Bit 2 */
    byte ID3         :1;                                       /* Part ID Register Bit 3 */
    byte ID4         :1;                                       /* Part ID Register Bit 4 */
    byte ID5         :1;                                       /* Part ID Register Bit 5 */
    byte ID6         :1;                                       /* Part ID Register Bit 6 */
    byte ID7         :1;                                       /* Part ID Register Bit 7 */
  } Bits;
  struct {
    byte grpID   :8;
  } MergedBits;
} PARTIDLSTR;
extern volatile PARTIDLSTR _PARTIDL @(REG_BASE + 0x0000001B);
#define PARTIDL _PARTIDL.Byte
#define PARTIDL_ID0 _PARTIDL.Bits.ID0
#define PARTIDL_ID1 _PARTIDL.Bits.ID1
#define PARTIDL_ID2 _PARTIDL.Bits.ID2
#define PARTIDL_ID3 _PARTIDL.Bits.ID3
#define PARTIDL_ID4 _PARTIDL.Bits.ID4
#define PARTIDL_ID5 _PARTIDL.Bits.ID5
#define PARTIDL_ID6 _PARTIDL.Bits.ID6
#define PARTIDL_ID7 _PARTIDL.Bits.ID7
#define PARTIDL_ID _PARTIDL.MergedBits.grpID

#define PARTIDL_ID0_MASK   1
#define PARTIDL_ID1_MASK   2
#define PARTIDL_ID2_MASK   4
#define PARTIDL_ID3_MASK   8
#define PARTIDL_ID4_MASK   16
#define PARTIDL_ID5_MASK   32
#define PARTIDL_ID6_MASK   64
#define PARTIDL_ID7_MASK   128
#define PARTIDL_ID_MASK  255
#define PARTIDL_ID_BITNUM  0


/*** IRQCR - Interrupt Control Register; 0x0000001E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte IRQEN       :1;                                       /* External IRQ Enable */
    byte IRQE        :1;                                       /* IRQ Select Edge Sensitive Only */
  } Bits;
} IRQCRSTR;
extern volatile IRQCRSTR _IRQCR @(REG_BASE + 0x0000001E);
#define IRQCR _IRQCR.Byte
#define IRQCR_IRQEN _IRQCR.Bits.IRQEN
#define IRQCR_IRQE _IRQCR.Bits.IRQE

#define IRQCR_IRQEN_MASK   64
#define IRQCR_IRQE_MASK   128


/*** DBGC1 - Debug Control Register 1; 0x00000020 ***/
typedef union {
  byte Byte;
  struct {
    byte COMRV       :2;                                       /* Comparator Register Visibility Bits */
    byte DBGBRK      :2;                                       /* S12X_DBG Breakpoint Enable Bits */
    byte BDM         :1;                                       /* Background Debug Mode Enable */
    byte XGSBPE      :1;                                       /* XGATE S/W Breakpoint Enable */
    byte TRACE       :1;                                       /* Immediate Trace Request Bit */
    byte ARM         :1;                                       /* Arm Bit */
  } Bits;
} DBGC1STR;
extern volatile DBGC1STR _DBGC1 @(REG_BASE + 0x00000020);
#define DBGC1 _DBGC1.Byte
#define DBGC1_COMRV _DBGC1.Bits.COMRV
#define DBGC1_DBGBRK _DBGC1.Bits.DBGBRK
#define DBGC1_BDM _DBGC1.Bits.BDM
#define DBGC1_XGSBPE _DBGC1.Bits.XGSBPE
#define DBGC1_TRACE _DBGC1.Bits.TRACE
#define DBGC1_ARM _DBGC1.Bits.ARM

#define DBGC1_COMRV_MASK   3
#define DBGC1_COMRV_BITNUM 0
#define DBGC1_DBGBRK_MASK   12
#define DBGC1_DBGBRK_BITNUM 2
#define DBGC1_BDM_MASK   16
#define DBGC1_XGSBPE_MASK   32
#define DBGC1_TRACE_MASK   64
#define DBGC1_ARM_MASK   128


/*** DBGSR - Debug Status Register; 0x00000021 ***/
typedef union {
  byte Byte;
  struct {
    byte SSF0        :1;                                       /* State Sequencer Flag Bit 0 */
    byte SSF1        :1;                                       /* State Sequencer Flag Bit 1 */
    byte SSF2        :1;                                       /* State Sequencer Flag Bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte EXTF        :1;                                       /* External Tag Hit Flag */
    byte TBF         :1;                                       /* Trace Buffer Full */
  } Bits;
  struct {
    byte grpSSF  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} DBGSRSTR;
extern volatile DBGSRSTR _DBGSR @(REG_BASE + 0x00000021);
#define DBGSR _DBGSR.Byte
#define DBGSR_SSF0 _DBGSR.Bits.SSF0
#define DBGSR_SSF1 _DBGSR.Bits.SSF1
#define DBGSR_SSF2 _DBGSR.Bits.SSF2
#define DBGSR_EXTF _DBGSR.Bits.EXTF
#define DBGSR_TBF _DBGSR.Bits.TBF
#define DBGSR_SSF _DBGSR.MergedBits.grpSSF

#define DBGSR_SSF0_MASK   1
#define DBGSR_SSF1_MASK   2
#define DBGSR_SSF2_MASK   4
#define DBGSR_EXTF_MASK   64
#define DBGSR_TBF_MASK   128
#define DBGSR_SSF_MASK  7
#define DBGSR_SSF_BITNUM  0


/*** DBGTCR - Debug Trace Control Register; 0x00000022 ***/
typedef union {
  byte Byte;
  struct {
    byte TALIGN      :2;                                       /* Trigger Align Bits */
    byte TRCMOD      :2;                                       /* Trace Mode Bits */
    byte TRANGE      :2;                                       /* Trace Range Bits */
    byte TSOURCE     :2;                                       /* Trace Source Control Bits */
  } Bits;
} DBGTCRSTR;
extern volatile DBGTCRSTR _DBGTCR @(REG_BASE + 0x00000022);
#define DBGTCR _DBGTCR.Byte
#define DBGTCR_TALIGN _DBGTCR.Bits.TALIGN
#define DBGTCR_TRCMOD _DBGTCR.Bits.TRCMOD
#define DBGTCR_TRANGE _DBGTCR.Bits.TRANGE
#define DBGTCR_TSOURCE _DBGTCR.Bits.TSOURCE

#define DBGTCR_TALIGN_MASK   3
#define DBGTCR_TALIGN_BITNUM 0
#define DBGTCR_TRCMOD_MASK   12
#define DBGTCR_TRCMOD_BITNUM 2
#define DBGTCR_TRANGE_MASK   48
#define DBGTCR_TRANGE_BITNUM 4
#define DBGTCR_TSOURCE_MASK   192
#define DBGTCR_TSOURCE_BITNUM 6


