frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile PPAGESTR _PPAGE @(REG_BASE + 0x00000030);
#define PPAGE _PPAGE.Byte
#define PPAGE_PIX0 _PPAGE.Bits.PIX0
#define PPAGE_PIX1 _PPAGE.Bits.PIX1
#define PPAGE_PIX2 _PPAGE.Bits.PIX2
#define PPAGE_PIX3 _PPAGE.Bits.PIX3
#define PPAGE_PIX4 _PPAGE.Bits.PIX4
#define PPAGE_PIX5 _PPAGE.Bits.PIX5
#define PPAGE_PIX6 _PPAGE.Bits.PIX6
#define PPAGE_PIX7 _PPAGE.Bits.PIX7
#define PPAGE_PIX _PPAGE.MergedBits.grpPIX

#define PPAGE_PIX0_MASK   1
#define PPAGE_PIX1_MASK   2
#define PPAGE_PIX2_MASK   4
#define PPAGE_PIX3_MASK   8
#define PPAGE_PIX4_MASK   16
#define PPAGE_PIX5_MASK   32
#define PPAGE_PIX6_MASK   64
#define PPAGE_PIX7_MASK   128
#define PPAGE_PIX_MASK  255
#define PPAGE_PIX_BITNUM  0


/*** PORTK - Port K Data Register; 0x00000032 ***/
typedef union {
  byte Byte;
  struct {
    byte PK0         :1;                                       /* Port K Bit 0 */
    byte PK1         :1;                                       /* Port K Bit 1 */
    byte PK2         :1;                                       /* Port K Bit 2 */
    byte PK3         :1;                                       /* Port K Bit 3 */
    byte PK4         :1;                                       /* Port K Bit 4 */
    byte PK5         :1;                                       /* Port K Bit 5 */
    byte PK6         :1;                                       /* Port K Bit 6 */
    byte PK7         :1;                                       /* Port K Bit 7 */
  } Bits;
  struct {
    byte grpPK   :8;
  } MergedBits;
} PORTKSTR;
extern volatile PORTKSTR _PORTK @(REG_BASE + 0x00000032);
#define PORTK _PORTK.Byte
#define PORTK_PK0 _PORTK.Bits.PK0
#define PORTK_PK1 _PORTK.Bits.PK1
#define PORTK_PK2 _PORTK.Bits.PK2
#define PORTK_PK3 _PORTK.Bits.PK3
#define PORTK_PK4 _PORTK.Bits.PK4
#define PORTK_PK5 _PORTK.Bits.PK5
#define PORTK_PK6 _PORTK.Bits.PK6
#define PORTK_PK7 _PORTK.Bits.PK7
#define PORTK_PK _PORTK.MergedBits.grpPK

#define PORTK_PK0_MASK   1
#define PORTK_PK1_MASK   2
#define PORTK_PK2_MASK   4
#define PORTK_PK3_MASK   8
#define PORTK_PK4_MASK   16
#define PORTK_PK5_MASK   32
#define PORTK_PK6_MASK   64
#define PORTK_PK7_MASK   128
#define PORTK_PK_MASK  255
#define PORTK_PK_BITNUM  0


/*** DDRK - Port K Data Direction Register; 0x00000033 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRK0       :1;                                       /* Port K Data Direction Bit 0 */
    byte DDRK1       :1;                                       /* Port K Data Direction Bit 1 */
    byte DDRK2       :1;                                       /* Port K Data Direction Bit 2 */
    byte DDRK3       :1;                                       /* Port K Data Direction Bit 3 */
    byte DDRK4       :1;                                       /* Port K Data Direction Bit 4 */
    byte DDRK5       :1;                                       /* Port K Data Direction Bit 5 */
    byte DDRK6       :1;                                       /* Port K Data Direction Bit 6 */
    byte DDRK7       :1;                                       /* Port K Data Direction Bit 7 */
  } Bits;
  struct {
    byte grpDDRK :8;
  } MergedBits;
} DDRKSTR;
extern volatile DDRKSTR _DDRK @(REG_BASE + 0x00000033);
#define DDRK _DDRK.Byte
#define DDRK_DDRK0 _DDRK.Bits.DDRK0
#define DDRK_DDRK1 _DDRK.Bits.DDRK1
#define DDRK_DDRK2 _DDRK.Bits.DDRK2
#define DDRK_DDRK3 _DDRK.Bits.DDRK3
#define DDRK_DDRK4 _DDRK.Bits.DDRK4
#define DDRK_DDRK5 _DDRK.Bits.DDRK5
#define DDRK_DDRK6 _DDRK.Bits.DDRK6
#define DDRK_DDRK7 _DDRK.Bits.DDRK7
#define DDRK_DDRK _DDRK.MergedBits.grpDDRK

#define DDRK_DDRK0_MASK   1
#define DDRK_DDRK1_MASK   2
#define DDRK_DDRK2_MASK   4
#define DDRK_DDRK3_MASK   8
#define DDRK_DDRK4_MASK   16
#define DDRK_DDRK5_MASK   32
#define DDRK_DDRK6_MASK   64
#define DDRK_DDRK7_MASK   128
#define DDRK_DDRK_MASK  255
#define DDRK_DDRK_BITNUM  0


/*** SYNR - CRG Synthesizer Register; 0x00000034 ***/
typedef union {
  byte Byte;
  struct {
    byte SYN0        :1;                                       /* CRG Synthesizer Bit 0 */
    byte SYN1        :1;                                       /* CRG Synthesizer Bit 1 */
    byte SYN2        :1;                                       /* CRG Synthesizer Bit 2 */
    byte SYN3        :1;                                       /* CRG Synthesizer Bit 3 */
    byte SYN4        :1;                                       /* CRG Synthesizer Bit 4 */
    byte SYN5        :1;                                       /* CRG Synthesizer Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpSYN  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} SYNRSTR;
extern volatile SYNRSTR _SYNR @(REG_BASE + 0x00000034);
#define SYNR _SYNR.Byte
#define SYNR_SYN0 _SYNR.Bits.SYN0
#define SYNR_SYN1 _SYNR.Bits.SYN1
#define SYNR_SYN2 _SYNR.Bits.SYN2
#define SYNR_SYN3 _SYNR.Bits.SYN3
#define SYNR_SYN4 _SYNR.Bits.SYN4
#define SYNR_SYN5 _SYNR.Bits.SYN5
#define SYNR_SYN _SYNR.MergedBits.grpSYN

#define SYNR_SYN0_MASK   1
#define SYNR_SYN1_MASK   2
#define SYNR_SYN2_MASK   4
#define SYNR_SYN3_MASK   8
#define SYNR_SYN4_MASK   16
#define SYNR_SYN5_MASK   32
#define SYNR_SYN_MASK  63
#define SYNR_SYN_BITNUM  0


/*** REFDV - CRG Reference Divider Register; 0x00000035 ***/
typedef union {
  byte Byte;
  struct {
    byte REFDV0      :1;                                       /* CRG Reference Divider Bit 0 */
    byte REFDV1      :1;                                       /* CRG Reference Divider Bit 1 */
    byte REFDV2      :1;                                       /* CRG Reference Divider Bit 2 */
    byte REFDV3      :1;                                       /* CRG Reference Divider Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpREFDV :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} REFDVSTR;
extern volatile REFDVSTR _REFDV @(REG_BASE + 0x00000035);
#define REFDV _REFDV.Byte
#define REFDV_REFDV0 _REFDV.Bits.REFDV0
#define REFDV_REFDV1 _REFDV.Bits.REFDV1
#define REFDV_REFDV2 _REFDV.Bits.REFDV2
#define REFDV_REFDV3 _REFDV.Bits.REFDV3
#define REFDV_REFDV _REFDV.MergedBits.grpREFDV

#define REFDV_REFDV0_MASK   1
#define REFDV_REFDV1_MASK   2
#define REFDV_REFDV2_MASK   4
#define REFDV_REFDV3_MASK   8
#define REFDV_REFDV_MASK  15
#define REFDV_REFDV_BITNUM  0


/*** CRGFLG - CRG Flags Register; 0x00000037 ***/
typedef union {
  byte Byte;
  struct {
    byte SCM         :1;                                       /* Self-clock mode Status */
    byte SCMIF       :1;                                       /* Self-clock mode Interrupt Flag */
    byte TRACK       :1;                                       /* Track Status */
    byte LOCK        :1;                                       /* Lock Status */
    byte LOCKIF      :1;                                       /* PLL Lock Interrupt Flag */
    byte             :1; 
    byte PORF        :1;                                       /* Power on Reset Flag */
    byte RTIF        :1;                                       /* Real Time Interrupt Flag */
  } Bits;
} CRGFLGSTR;
extern volatile CRGFLGSTR _CRGFLG @(REG_BASE + 0x00000037);
#define CRGFLG _CRGFLG.Byte
#define CRGFLG_SCM _CRGFLG.Bits.SCM
#define CRGFLG_SCMIF _CRGFLG.Bits.SCMIF
#define CRGFLG_TRACK _CRGFLG.Bits.TRACK
#define CRGFLG_LOCK _CRGFLG.Bits.LOCK
#define CRGFLG_LOCKIF _CRGFLG.Bits.LOCKIF
#define CRGFLG_PORF _CRGFLG.Bits.PORF
#define CRGFLG_RTIF _CRGFLG.Bits.RTIF

