frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  struct {
    word grpBIT  :16;
  } MergedBits;
} TC7STR;
extern volatile TC7STR _TC7 @(REG_BASE + 0x0000005E);
#define TC7 _TC7.Word
#define TC7_BIT _TC7.MergedBits.grpBIT

#define TC7_BIT_MASK  65535
#define TC7_BIT_BITNUM  0


/*** PACTL - 16-Bit Pulse Accumulator A Control Register; 0x00000060 ***/
typedef union {
  byte Byte;
  struct {
    byte PAI         :1;                                       /* Pulse Accumulator Input Interrupt enable */
    byte PAOVI       :1;                                       /* Pulse Accumulator A Overflow Interrupt enable */
    byte CLK0        :1;                                       /* Clock Select Bit 0 */
    byte CLK1        :1;                                       /* Clock Select Bit 1 */
    byte PEDGE       :1;                                       /* Pulse Accumulator Edge Control */
    byte PAMOD       :1;                                       /* Pulse Accumulator Mode */
    byte PAEN        :1;                                       /* Pulse Accumulator A System Enable */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpCLK  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PACTLSTR;
extern volatile PACTLSTR _PACTL @(REG_BASE + 0x00000060);
#define PACTL _PACTL.Byte
#define PACTL_PAI _PACTL.Bits.PAI
#define PACTL_PAOVI _PACTL.Bits.PAOVI
#define PACTL_CLK0 _PACTL.Bits.CLK0
#define PACTL_CLK1 _PACTL.Bits.CLK1
#define PACTL_PEDGE _PACTL.Bits.PEDGE
#define PACTL_PAMOD _PACTL.Bits.PAMOD
#define PACTL_PAEN _PACTL.Bits.PAEN
#define PACTL_CLK _PACTL.MergedBits.grpCLK

#define PACTL_PAI_MASK   1
#define PACTL_PAOVI_MASK   2
#define PACTL_CLK0_MASK   4
#define PACTL_CLK1_MASK   8
#define PACTL_PEDGE_MASK   16
#define PACTL_PAMOD_MASK   32
#define PACTL_PAEN_MASK   64
#define PACTL_CLK_MASK  12
#define PACTL_CLK_BITNUM  2


/*** PAFLG - Pulse Accumulator A Flag Register; 0x00000061 ***/
typedef union {
  byte Byte;
  struct {
    byte PAIF        :1;                                       /* Pulse Accumulator Input edge Flag */
    byte PAOVF       :1;                                       /* Pulse Accumulator A Overflow Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PAFLGSTR;
extern volatile PAFLGSTR _PAFLG @(REG_BASE + 0x00000061);
#define PAFLG _PAFLG.Byte
#define PAFLG_PAIF _PAFLG.Bits.PAIF
#define PAFLG_PAOVF _PAFLG.Bits.PAOVF

#define PAFLG_PAIF_MASK   1
#define PAFLG_PAOVF_MASK   2


/*** PACN32 - Pulse Accumulators Count 32 Register; 0x00000062 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PACN3 - Pulse Accumulators Count 3 Register; 0x00000062 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PACN3STR;
    #define PACN3 _PACN32.Overlap_STR.PACN3STR.Byte
    
    #define PACN3_BIT _PACN32.Overlap_STR.PACN3STR.MergedBits.grpBIT
    
    #define PACN3_BIT_MASK  255
    #define PACN3_BIT_BITNUM  0


    /*** PACN2 - Pulse Accumulators Count 2 Register; 0x00000063 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PACN2STR;
    #define PACN2 _PACN32.Overlap_STR.PACN2STR.Byte
    
    #define PACN2_BIT _PACN32.Overlap_STR.PACN2STR.MergedBits.grpBIT
    
    #define PACN2_BIT_MASK  255
    #define PACN2_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PACN32STR;
extern volatile PACN32STR _PACN32 @(REG_BASE + 0x00000062);
#define PACN32 _PACN32.Word
#define PACN32_BIT _PACN32.MergedBits.grpBIT

#define PACN32_BIT_MASK  65535
#define PACN32_BIT_BITNUM  0


/*** PACN10 - Pulse Accumulators Count 10 Register; 0x00000064 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PACN1 - Pulse Accumulators Count 1 Register; 0x00000064 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PACN1STR;
    #define PACN1 _PACN10.Overlap_STR.PACN1STR.Byte
    
    #define PACN1_BIT _PACN10.Overlap_STR.PACN1STR.MergedBits.grpBIT
    
    #define PACN1_BIT_MASK  255
    #define PACN1_BIT_BITNUM  0


    /*** PACN0 - Pulse Accumulators Count 0 Register; 0x00000065 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PACN0STR;
    #define PACN0 _PACN10.Overlap_STR.PACN0STR.Byte
    
    #define PACN0_BIT _PACN10.Overlap_STR.PACN0STR.MergedBits.grpBIT
    
    #define PACN0_BIT_MASK  255
    #define PACN0_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PACN10STR;
extern volatile PACN10STR _PACN10 @(REG_BASE + 0x00000064);
#define PACN10 _PACN10.Word
#define PACN10_BIT _PACN10.MergedBits.grpBIT

#define PACN10_BIT_MASK  65535
#define PACN10_BIT_BITNUM  0


/*** MCCTL - Modulus Down Counter underflow; 0x00000066 ***/
typedef union {
  byte Byte;
  struct {
    byte MCPR0       :1;                                       /* Modulus Counter Prescaler select 0 */
    byte MCPR1       :1;                                       /* Modulus Counter Prescaler select 1 */
    byte MCEN        :1;                                       /* Modulus Down-Counter Enable */
    byte FLMC        :1;                                       /* Force Load Register into the Modulus Counter Count Register */
    byte ICLAT       :1;                                       /* Input Capture Force Latch Action */
    byte RDMCL       :1;                                       /* Read Modulus Down-Counter Load */
    byte MODMC       :1;                                       /* Modulus Mode Enable */
    byte MCZI        :1;                                       /* Modulus Counter Underflow Interrupt Enable */
  } Bits;
  struct {
    byte grpMCPR :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MCCTLSTR;
extern volatile MCCTLSTR _MCCTL @(REG_BASE + 0x00000066);
#define MCCTL _MCCTL.Byte
#define MCCTL_MCPR0 _MCCTL.Bits.MCPR0
#define MCCTL_MCPR1 _MCCTL.Bits.MCPR1
#define MCCTL_MCEN _MCCTL.Bits.MCEN
#define MCCTL_FLMC _MCCTL.Bits.FLMC
#define MCCTL_ICLAT _MCCTL.Bits.ICLAT
#define MCCTL_RDMCL _MCCTL.Bits.RDMCL
#define MCCTL_MODMC _MCCTL.Bits.MODMC
#define MCCTL_MCZI _MCCTL.Bits.MCZI
#define MCCTL_MCPR _MCCTL.MergedBits.grpMCPR

#define MCCTL_MCPR0_MASK   1
#define MCCTL_MCPR1_MASK   2
#define MCCTL_MCEN_MASK   4
#define MCCTL_FLMC_MASK   8
#define MCCTL_ICLAT_MASK   16
#define MCCTL_RDMCL_MASK   32
#define MCCTL_MODMC_MASK   64
#define MCCTL_MCZI_MASK   128
#define MCCTL_MCPR_MASK  3
#define MCCTL_MCPR_BITNUM  0


/*** MCFLG - 16-Bit Modulus Down Counter Flag Register; 0x00000067 ***/
typedef union {
  byte Byte;
  struct {
    byte POLF0       :1;                                       /* First Input Capture Polarity Status 0 */
    byte POLF1       :1;                                       /* First Input Capture Polarity Status 1 */
    byte POLF2       :1;                                       /* First Input Capture Polarity Status 2 */
    byte POLF3       :1;                                       /* First Input Capture Polarity Status 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MCZF        :1;                                       /* Modulus Counter Underflow Flag */
  } Bits;
  struct {
    byte grpPOLF :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MCFLGSTR;
extern volatile MCFLGSTR _MCFLG @(REG_BASE + 0x00000067);
#define MCFLG _MCFLG.Byte
#define MCFLG_POLF0 _MCFLG.Bits.POLF0
#define MCFLG_POLF1 _MCFLG.Bits.POLF1
#define MCFLG_POLF2 _MCFLG.Bits.POLF2
#define MCFLG_POLF3 _MCFLG.Bits.POLF3
#define MCFLG_MCZF _MCFLG.Bits.MCZF
#define MCFLG_POLF _MCFLG.MergedBits.grpPOLF

#define MCFLG_POLF0_MASK   1
#define MCFLG_POLF1_MASK   2
#define MCFLG_POLF2_MASK   4
#define MCFLG_POLF3_MASK   8
#define MCFLG_MCZF_MASK   128
#define MCFLG_POLF_MASK  15
#define MCFLG_POLF_BITNUM  0


