frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  struct {
    word ETRIGCH0    :1;                                       /* External Trigger Channel Select Bit 0 */
    word ETRIGCH1    :1;                                       /* External Trigger Channel Select Bit 1 */
    word ETRIGCH2    :1;                                       /* External Trigger Channel Select Bit 2 */
    word ETRIGCH3    :1;                                       /* External Trigger Channel Select Bit 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word ETRIGSEL    :1;                                       /* External Trigger Source Select */
    word WRAP0       :1;                                       /* Wrap Around Channel Select Bit 0 */
    word WRAP1       :1;                                       /* Wrap Around Channel Select Bit 1 */
    word WRAP2       :1;                                       /* Wrap Around Channel Select Bit 2 */
    word WRAP3       :1;                                       /* Wrap Around Channel Select Bit 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpETRIGCH :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpWRAP :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} ATD1CTL01STR;
extern volatile ATD1CTL01STR _ATD1CTL01 @(REG_BASE + 0x00000080);
#define ATD1CTL01 _ATD1CTL01.Word
#define ATD1CTL01_ETRIGCH0 _ATD1CTL01.Bits.ETRIGCH0
#define ATD1CTL01_ETRIGCH1 _ATD1CTL01.Bits.ETRIGCH1
#define ATD1CTL01_ETRIGCH2 _ATD1CTL01.Bits.ETRIGCH2
#define ATD1CTL01_ETRIGCH3 _ATD1CTL01.Bits.ETRIGCH3
#define ATD1CTL01_ETRIGSEL _ATD1CTL01.Bits.ETRIGSEL
#define ATD1CTL01_WRAP0 _ATD1CTL01.Bits.WRAP0
#define ATD1CTL01_WRAP1 _ATD1CTL01.Bits.WRAP1
#define ATD1CTL01_WRAP2 _ATD1CTL01.Bits.WRAP2
#define ATD1CTL01_WRAP3 _ATD1CTL01.Bits.WRAP3
#define ATD1CTL01_ETRIGCH _ATD1CTL01.MergedBits.grpETRIGCH
#define ATD1CTL01_WRAP _ATD1CTL01.MergedBits.grpWRAP

#define ATD1CTL01_ETRIGCH0_MASK   1
#define ATD1CTL01_ETRIGCH1_MASK   2
#define ATD1CTL01_ETRIGCH2_MASK   4
#define ATD1CTL01_ETRIGCH3_MASK   8
#define ATD1CTL01_ETRIGSEL_MASK   128
#define ATD1CTL01_WRAP0_MASK   256
#define ATD1CTL01_WRAP1_MASK   512
#define ATD1CTL01_WRAP2_MASK   1024
#define ATD1CTL01_WRAP3_MASK   2048
#define ATD1CTL01_ETRIGCH_MASK  15
#define ATD1CTL01_ETRIGCH_BITNUM  0
#define ATD1CTL01_WRAP_MASK  3840
#define ATD1CTL01_WRAP_BITNUM  8


/*** ATD1CTL23 - ATD 1 Control Register 23; 0x00000082 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1CTL2 - ATD 1 Control Register 2; 0x00000082 ***/
    union {
      byte Byte;
      struct {
        byte ASCIF       :1;                                       /* ATD 1 Sequence Complete Interrupt Flag */
        byte ASCIE       :1;                                       /* ATD 1 Sequence Complete Interrupt Enable */
        byte ETRIGE      :1;                                       /* External Trigger Mode enable */
        byte ETRIGP      :1;                                       /* External Trigger Polarity */
        byte ETRIGLE     :1;                                       /* External Trigger Level/Edge control */
        byte AWAI        :1;                                       /* ATD Power Down in Wait Mode */
        byte AFFC        :1;                                       /* ATD Fast Conversion Complete Flag Clear */
        byte ADPU        :1;                                       /* ATD Disable / Power Down */
      } Bits;
    } ATD1CTL2STR;
    #define ATD1CTL2 _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Byte
    #define ATD1CTL2_ASCIF _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ASCIF
    #define ATD1CTL2_ASCIE _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ASCIE
    #define ATD1CTL2_ETRIGE _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ETRIGE
    #define ATD1CTL2_ETRIGP _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ETRIGP
    #define ATD1CTL2_ETRIGLE _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ETRIGLE
    #define ATD1CTL2_AWAI _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.AWAI
    #define ATD1CTL2_AFFC _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.AFFC
    #define ATD1CTL2_ADPU _ATD1CTL23.Overlap_STR.ATD1CTL2STR.Bits.ADPU
    
    
    #define ATD1CTL2_ASCIF_MASK   1
    #define ATD1CTL2_ASCIE_MASK   2
    #define ATD1CTL2_ETRIGE_MASK   4
    #define ATD1CTL2_ETRIGP_MASK   8
    #define ATD1CTL2_ETRIGLE_MASK   16
    #define ATD1CTL2_AWAI_MASK   32
    #define ATD1CTL2_AFFC_MASK   64
    #define ATD1CTL2_ADPU_MASK   128


    /*** ATD1CTL3 - ATD 1 Control Register 3; 0x00000083 ***/
    union {
      byte Byte;
      struct {
        byte FRZ0        :1;                                       /* Background Debug Freeze Enable Bit 0 */
        byte FRZ1        :1;                                       /* Background Debug Freeze Enable Bit 1 */
        byte FIFO        :1;                                       /* Result Register FIFO Mode */
        byte S1C         :1;                                       /* Conversion Sequence Length 1 */
        byte S2C         :1;                                       /* Conversion Sequence Length 2 */
        byte S4C         :1;                                       /* Conversion Sequence Length 4 */
        byte S8C         :1;                                       /* Conversion Sequence Length 8 */
        byte             :1; 
      } Bits;
      struct {
        byte grpFRZ :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD1CTL3STR;
    #define ATD1CTL3 _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Byte
    #define ATD1CTL3_FRZ0 _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.FRZ0
    #define ATD1CTL3_FRZ1 _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.FRZ1
    #define ATD1CTL3_FIFO _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.FIFO
    #define ATD1CTL3_S1C _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S1C
    #define ATD1CTL3_S2C _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S2C
    #define ATD1CTL3_S4C _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S4C
    #define ATD1CTL3_S8C _ATD1CTL23.Overlap_STR.ATD1CTL3STR.Bits.S8C
    
    #define ATD1CTL3_FRZ _ATD1CTL23.Overlap_STR.ATD1CTL3STR.MergedBits.grpFRZ
    
    #define ATD1CTL3_FRZ0_MASK   1
    #define ATD1CTL3_FRZ1_MASK   2
    #define ATD1CTL3_FIFO_MASK   4
    #define ATD1CTL3_S1C_MASK   8
    #define ATD1CTL3_S2C_MASK   16
    #define ATD1CTL3_S4C_MASK   32
    #define ATD1CTL3_S8C_MASK   64
    #define ATD1CTL3_FRZ_MASK  3
    #define ATD1CTL3_FRZ_BITNUM  0

  } Overlap_STR;

