frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  struct {
    word CA          :1;                                       /* Analog Input Channel Select Code A */
    word CB          :1;                                       /* Analog Input Channel Select Code B */
    word CC          :1;                                       /* Analog Input Channel Select Code C */
    word CD          :1;                                       /* Analog Input Channel Select Code D */
    word MULT        :1;                                       /* Multi-Channel Sample Mode */
    word SCAN        :1;                                       /* Continuous Conversion Sequence Mode */
    word DSGN        :1;                                       /* Signed/Unsigned Result Data Mode */
    word DJM         :1;                                       /* Result Register Data Justification Mode */
    word PRS0        :1;                                       /* ATD Clock Prescaler 0 */
    word PRS1        :1;                                       /* ATD Clock Prescaler 1 */
    word PRS2        :1;                                       /* ATD Clock Prescaler 2 */
    word PRS3        :1;                                       /* ATD Clock Prescaler 3 */
    word PRS4        :1;                                       /* ATD Clock Prescaler 4 */
    word SMP0        :1;                                       /* Sample Time Select 0 */
    word SMP1        :1;                                       /* Sample Time Select 1 */
    word SRES8       :1;                                       /* ATD Resolution Select */
  } Bits;
  struct {
    word grpCx   :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpPRS  :5;
    word grpSMP  :2;
    word grpSRES_8 :1;
  } MergedBits;
} ATD1CTL45STR;
extern volatile ATD1CTL45STR _ATD1CTL45 @(REG_BASE + 0x00000084);
#define ATD1CTL45 _ATD1CTL45.Word
#define ATD1CTL45_CA _ATD1CTL45.Bits.CA
#define ATD1CTL45_CB _ATD1CTL45.Bits.CB
#define ATD1CTL45_CC _ATD1CTL45.Bits.CC
#define ATD1CTL45_CD _ATD1CTL45.Bits.CD
#define ATD1CTL45_MULT _ATD1CTL45.Bits.MULT
#define ATD1CTL45_SCAN _ATD1CTL45.Bits.SCAN
#define ATD1CTL45_DSGN _ATD1CTL45.Bits.DSGN
#define ATD1CTL45_DJM _ATD1CTL45.Bits.DJM
#define ATD1CTL45_PRS0 _ATD1CTL45.Bits.PRS0
#define ATD1CTL45_PRS1 _ATD1CTL45.Bits.PRS1
#define ATD1CTL45_PRS2 _ATD1CTL45.Bits.PRS2
#define ATD1CTL45_PRS3 _ATD1CTL45.Bits.PRS3
#define ATD1CTL45_PRS4 _ATD1CTL45.Bits.PRS4
#define ATD1CTL45_SMP0 _ATD1CTL45.Bits.SMP0
#define ATD1CTL45_SMP1 _ATD1CTL45.Bits.SMP1
#define ATD1CTL45_SRES8 _ATD1CTL45.Bits.SRES8
#define ATD1CTL45_Cx _ATD1CTL45.MergedBits.grpCx
#define ATD1CTL45_PRS _ATD1CTL45.MergedBits.grpPRS
#define ATD1CTL45_SMP _ATD1CTL45.MergedBits.grpSMP

#define ATD1CTL45_CA_MASK   1
#define ATD1CTL45_CB_MASK   2
#define ATD1CTL45_CC_MASK   4
#define ATD1CTL45_CD_MASK   8
#define ATD1CTL45_MULT_MASK   16
#define ATD1CTL45_SCAN_MASK   32
#define ATD1CTL45_DSGN_MASK   64
#define ATD1CTL45_DJM_MASK   128
#define ATD1CTL45_PRS0_MASK   256
#define ATD1CTL45_PRS1_MASK   512
#define ATD1CTL45_PRS2_MASK   1024
#define ATD1CTL45_PRS3_MASK   2048
#define ATD1CTL45_PRS4_MASK   4096
#define ATD1CTL45_SMP0_MASK   8192
#define ATD1CTL45_SMP1_MASK   16384
#define ATD1CTL45_SRES8_MASK   32768
#define ATD1CTL45_Cx_MASK  15
#define ATD1CTL45_Cx_BITNUM  0
#define ATD1CTL45_PRS_MASK  7936
#define ATD1CTL45_PRS_BITNUM  8
#define ATD1CTL45_SMP_MASK  24576
#define ATD1CTL45_SMP_BITNUM  13


/*** ATD1STAT0 - ATD 1 Status Register 0; 0x00000086 ***/
typedef union {
  byte Byte;
  struct {
    byte CC0         :1;                                       /* Conversion Counter 0 */
    byte CC1         :1;                                       /* Conversion Counter 1 */
    byte CC2         :1;                                       /* Conversion Counter 2 */
    byte CC3         :1;                                       /* Conversion Counter 3 */
    byte FIFOR       :1;                                       /* FIFO Over Run Flag */
    byte ETORF       :1;                                       /* External Trigger Overrun Flag */
    byte             :1; 
    byte SCF         :1;                                       /* Sequence Complete Flag */
  } Bits;
  struct {
    byte grpCC   :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ATD1STAT0STR;
extern volatile ATD1STAT0STR _ATD1STAT0 @(REG_BASE + 0x00000086);
#define ATD1STAT0 _ATD1STAT0.Byte
#define ATD1STAT0_CC0 _ATD1STAT0.Bits.CC0
#define ATD1STAT0_CC1 _ATD1STAT0.Bits.CC1
#define ATD1STAT0_CC2 _ATD1STAT0.Bits.CC2
#define ATD1STAT0_CC3 _ATD1STAT0.Bits.CC3
#define ATD1STAT0_FIFOR _ATD1STAT0.Bits.FIFOR
#define ATD1STAT0_ETORF _ATD1STAT0.Bits.ETORF
#define ATD1STAT0_SCF _ATD1STAT0.Bits.SCF
#define ATD1STAT0_CC _ATD1STAT0.MergedBits.grpCC

#define ATD1STAT0_CC0_MASK   1
#define ATD1STAT0_CC1_MASK   2
#define ATD1STAT0_CC2_MASK   4
#define ATD1STAT0_CC3_MASK   8
#define ATD1STAT0_FIFOR_MASK   16
#define ATD1STAT0_ETORF_MASK   32
#define ATD1STAT0_SCF_MASK   128
#define ATD1STAT0_CC_MASK  15
#define ATD1STAT0_CC_BITNUM  0


/*** ATD1TEST1 - ATD1 Test Register; 0x00000089 ***/
typedef union {
  byte Byte;
  struct {
    byte SC          :1;                                       /* Special Channel Conversion Bit */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ATD1TEST1STR;
extern volatile ATD1TEST1STR _ATD1TEST1 @(REG_BASE + 0x00000089);
#define ATD1TEST1 _ATD1TEST1.Byte
#define ATD1TEST1_SC _ATD1TEST1.Bits.SC

#define ATD1TEST1_SC_MASK   1


/*** ATD1STAT2 - ATD 1 Status Register 2; 0x0000008A ***/
typedef union {
  byte Byte;
  struct {
    byte CCF8        :1;                                       /* Conversion Complete Flag 8 */
    byte CCF9        :1;                                       /* Conversion Complete Flag 9 */
    byte CCF10       :1;                                       /* Conversion Complete Flag 10 */
    byte CCF11       :1;                                       /* Conversion Complete Flag 11 */
    byte CCF12       :1;                                       /* Conversion Complete Flag 12 */
    byte CCF13       :1;                                       /* Conversion Complete Flag 13 */
    byte CCF14       :1;                                       /* Conversion Complete Flag 14 */
    byte CCF15       :1;                                       /* Conversion Complete Flag 15 */
  } Bits;
  struct {
    byte grpCCF_8 :8;
  } MergedBits;
} ATD1STAT2STR;
