frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile ATD1STAT2STR _ATD1STAT2 @(REG_BASE + 0x0000008A);
#define ATD1STAT2 _ATD1STAT2.Byte
#define ATD1STAT2_CCF8 _ATD1STAT2.Bits.CCF8
#define ATD1STAT2_CCF9 _ATD1STAT2.Bits.CCF9
#define ATD1STAT2_CCF10 _ATD1STAT2.Bits.CCF10
#define ATD1STAT2_CCF11 _ATD1STAT2.Bits.CCF11
#define ATD1STAT2_CCF12 _ATD1STAT2.Bits.CCF12
#define ATD1STAT2_CCF13 _ATD1STAT2.Bits.CCF13
#define ATD1STAT2_CCF14 _ATD1STAT2.Bits.CCF14
#define ATD1STAT2_CCF15 _ATD1STAT2.Bits.CCF15
#define ATD1STAT2_CCF_8 _ATD1STAT2.MergedBits.grpCCF_8
#define ATD1STAT2_CCF ATD1STAT2_CCF_8

#define ATD1STAT2_CCF8_MASK   1
#define ATD1STAT2_CCF9_MASK   2
#define ATD1STAT2_CCF10_MASK   4
#define ATD1STAT2_CCF11_MASK   8
#define ATD1STAT2_CCF12_MASK   16
#define ATD1STAT2_CCF13_MASK   32
#define ATD1STAT2_CCF14_MASK   64
#define ATD1STAT2_CCF15_MASK   128
#define ATD1STAT2_CCF_8_MASK  255
#define ATD1STAT2_CCF_8_BITNUM  0


/*** ATD1STAT1 - ATD 1 Status Register 1; 0x0000008B ***/
typedef union {
  byte Byte;
  struct {
    byte CCF0        :1;                                       /* Conversion Complete Flag 0 */
    byte CCF1        :1;                                       /* Conversion Complete Flag 1 */
    byte CCF2        :1;                                       /* Conversion Complete Flag 2 */
    byte CCF3        :1;                                       /* Conversion Complete Flag 3 */
    byte CCF4        :1;                                       /* Conversion Complete Flag 4 */
    byte CCF5        :1;                                       /* Conversion Complete Flag 5 */
    byte CCF6        :1;                                       /* Conversion Complete Flag 6 */
    byte CCF7        :1;                                       /* Conversion Complete Flag 7 */
  } Bits;
  struct {
    byte grpCCF  :8;
  } MergedBits;
} ATD1STAT1STR;
extern volatile ATD1STAT1STR _ATD1STAT1 @(REG_BASE + 0x0000008B);
#define ATD1STAT1 _ATD1STAT1.Byte
#define ATD1STAT1_CCF0 _ATD1STAT1.Bits.CCF0
#define ATD1STAT1_CCF1 _ATD1STAT1.Bits.CCF1
#define ATD1STAT1_CCF2 _ATD1STAT1.Bits.CCF2
#define ATD1STAT1_CCF3 _ATD1STAT1.Bits.CCF3
#define ATD1STAT1_CCF4 _ATD1STAT1.Bits.CCF4
#define ATD1STAT1_CCF5 _ATD1STAT1.Bits.CCF5
#define ATD1STAT1_CCF6 _ATD1STAT1.Bits.CCF6
#define ATD1STAT1_CCF7 _ATD1STAT1.Bits.CCF7
#define ATD1STAT1_CCF _ATD1STAT1.MergedBits.grpCCF

#define ATD1STAT1_CCF0_MASK   1
#define ATD1STAT1_CCF1_MASK   2
#define ATD1STAT1_CCF2_MASK   4
#define ATD1STAT1_CCF3_MASK   8
#define ATD1STAT1_CCF4_MASK   16
#define ATD1STAT1_CCF5_MASK   32
#define ATD1STAT1_CCF6_MASK   64
#define ATD1STAT1_CCF7_MASK   128
#define ATD1STAT1_CCF_MASK  255
#define ATD1STAT1_CCF_BITNUM  0


/*** ATD1DIEN0 - ATD 1 Input Enable Register 0; 0x0000008C ***/
typedef union {
  byte Byte;
  struct {
    byte IEN8        :1;                                       /* ATD Digital Input Enable on channel 8 */
    byte IEN9        :1;                                       /* ATD Digital Input Enable on channel 9 */
    byte IEN10       :1;                                       /* ATD Digital Input Enable on channel 10 */
    byte IEN11       :1;                                       /* ATD Digital Input Enable on channel 11 */
    byte IEN12       :1;                                       /* ATD Digital Input Enable on channel 12 */
    byte IEN13       :1;                                       /* ATD Digital Input Enable on channel 13 */
    byte IEN14       :1;                                       /* ATD Digital Input Enable on channel 14 */
    byte IEN15       :1;                                       /* ATD Digital Input Enable on channel 15 */
  } Bits;
  struct {
    byte grpIEN_8 :8;
  } MergedBits;
} ATD1DIEN0STR;
extern volatile ATD1DIEN0STR _ATD1DIEN0 @(REG_BASE + 0x0000008C);
#define ATD1DIEN0 _ATD1DIEN0.Byte
#define ATD1DIEN0_IEN8 _ATD1DIEN0.Bits.IEN8
#define ATD1DIEN0_IEN9 _ATD1DIEN0.Bits.IEN9
#define ATD1DIEN0_IEN10 _ATD1DIEN0.Bits.IEN10
#define ATD1DIEN0_IEN11 _ATD1DIEN0.Bits.IEN11
#define ATD1DIEN0_IEN12 _ATD1DIEN0.Bits.IEN12
#define ATD1DIEN0_IEN13 _ATD1DIEN0.Bits.IEN13
#define ATD1DIEN0_IEN14 _ATD1DIEN0.Bits.IEN14
#define ATD1DIEN0_IEN15 _ATD1DIEN0.Bits.IEN15
/* ATD1DIEN_ARR: Access 2 ATD1DIENx registers in a array */
#define ATD1DIEN_ARR ((Byte *) &ATD1DIEN0)
#define ATD1DIEN0_IEN_8 _ATD1DIEN0.MergedBits.grpIEN_8
#define ATD1DIEN0_IEN ATD1DIEN0_IEN_8

#define ATD1DIEN0_IEN8_MASK   1
#define ATD1DIEN0_IEN9_MASK   2
#define ATD1DIEN0_IEN10_MASK   4
#define ATD1DIEN0_IEN11_MASK   8
#define ATD1DIEN0_IEN12_MASK   16
#define ATD1DIEN0_IEN13_MASK   32
#define ATD1DIEN0_IEN14_MASK   64
#define ATD1DIEN0_IEN15_MASK   128
#define ATD1DIEN0_IEN_8_MASK  255
#define ATD1DIEN0_IEN_8_BITNUM  0


/*** ATD1DIEN1 - ATD 1 Input Enable Register 1; 0x0000008D ***/
typedef union {
  byte Byte;
  struct {
    byte IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
    byte IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
    byte IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
    byte IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
    byte IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
    byte IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
    byte IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
    byte IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
  } Bits;
  struct {
    byte grpIEN  :8;
  } MergedBits;
} ATD1DIEN1STR;
extern volatile ATD1DIEN1STR _ATD1DIEN1 @(REG_BASE + 0x0000008D);
#define ATD1DIEN1 _ATD1DIEN1.Byte
#define ATD1DIEN1_IEN0 _ATD1DIEN1.Bits.IEN0
#define ATD1DIEN1_IEN1 _ATD1DIEN1.Bits.IEN1
#define ATD1DIEN1_IEN2 _ATD1DIEN1.Bits.IEN2
#define ATD1DIEN1_IEN3 _ATD1DIEN1.Bits.IEN3
#define ATD1DIEN1_IEN4 _ATD1DIEN1.Bits.IEN4
#define ATD1DIEN1_IEN5 _ATD1DIEN1.Bits.IEN5
#define ATD1DIEN1_IEN6 _ATD1DIEN1.Bits.IEN6
#define ATD1DIEN1_IEN7 _ATD1DIEN1.Bits.IEN7
#define ATD1DIEN1_IEN _ATD1DIEN1.MergedBits.grpIEN

#define ATD1DIEN1_IEN0_MASK   1
#define ATD1DIEN1_IEN1_MASK   2
#define ATD1DIEN1_IEN2_MASK   4
#define ATD1DIEN1_IEN3_MASK   8
#define ATD1DIEN1_IEN4_MASK   16
#define ATD1DIEN1_IEN5_MASK   32
#define ATD1DIEN1_IEN6_MASK   64
#define ATD1DIEN1_IEN7_MASK   128
#define ATD1DIEN1_IEN_MASK  255
#define ATD1DIEN1_IEN_BITNUM  0


/*** ATD1_PORTAD0 - ATD1 Port AD0 Register; 0x0000008E ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD8       :1;                                       /* A/D Channel 8 (AN8) Digital Input */
    byte PTAD9       :1;                                       /* A/D Channel 9 (AN9) Digital Input */
    byte PTAD10      :1;                                       /* A/D Channel 10 (AN10) Digital Input */
    byte PTAD11      :1;                                       /* A/D Channel 11 (AN11) Digital Input */
    byte PTAD12      :1;                                       /* A/D Channel 12 (AN12) Digital Input */
    byte PTAD13      :1;                                       /* A/D Channel 13 (AN13) Digital Input */
    byte PTAD14      :1;                                       /* A/D Channel 14 (AN14) Digital Input */
    byte PTAD15      :1;                                       /* A/D Channel 15 (AN15) Digital Input */
  } Bits;
  struct {
    byte grpPTAD_8 :8;
  } MergedBits;
} ATD1_PORTAD0STR;
