frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
    #define ATD1DR4L_BIT_6 _ATD1DR4.Overlap_STR.ATD1DR4LSTR.MergedBits.grpBIT_6
    #define ATD1DR4L_BIT ATD1DR4L_BIT_6
    
    #define ATD1DR4L_BIT6_MASK   64
    #define ATD1DR4L_BIT7_MASK   128
    #define ATD1DR4L_BIT_6_MASK  192
    #define ATD1DR4L_BIT_6_BITNUM  6

  } Overlap_STR;

  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpBIT_6 :10;
  } MergedBits;
} ATD1DR4STR;
extern volatile ATD1DR4STR _ATD1DR4 @(REG_BASE + 0x00000098);
#define ATD1DR4 _ATD1DR4.Word
#define ATD1DR4_BIT6 _ATD1DR4.Bits.BIT6
#define ATD1DR4_BIT7 _ATD1DR4.Bits.BIT7
#define ATD1DR4_BIT8 _ATD1DR4.Bits.BIT8
#define ATD1DR4_BIT9 _ATD1DR4.Bits.BIT9
#define ATD1DR4_BIT10 _ATD1DR4.Bits.BIT10
#define ATD1DR4_BIT11 _ATD1DR4.Bits.BIT11
#define ATD1DR4_BIT12 _ATD1DR4.Bits.BIT12
#define ATD1DR4_BIT13 _ATD1DR4.Bits.BIT13
#define ATD1DR4_BIT14 _ATD1DR4.Bits.BIT14
#define ATD1DR4_BIT15 _ATD1DR4.Bits.BIT15
#define ATD1DR4_BIT_6 _ATD1DR4.MergedBits.grpBIT_6
#define ATD1DR4_BIT ATD1DR4_BIT_6

#define ATD1DR4_BIT6_MASK   64
#define ATD1DR4_BIT7_MASK   128
#define ATD1DR4_BIT8_MASK   256
#define ATD1DR4_BIT9_MASK   512
#define ATD1DR4_BIT10_MASK   1024
#define ATD1DR4_BIT11_MASK   2048
#define ATD1DR4_BIT12_MASK   4096
#define ATD1DR4_BIT13_MASK   8192
#define ATD1DR4_BIT14_MASK   16384
#define ATD1DR4_BIT15_MASK   32768
#define ATD1DR4_BIT_6_MASK  65472
#define ATD1DR4_BIT_6_BITNUM  6


/*** ATD1DR5 - ATD 1 Conversion Result Register 5; 0x0000009A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR5H - ATD 1 Conversion Result Register 5 High; 0x0000009A ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD1DR5HSTR;
    #define ATD1DR5H _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Byte
    #define ATD1DR5H_BIT8 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT8
    #define ATD1DR5H_BIT9 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT9
    #define ATD1DR5H_BIT10 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT10
    #define ATD1DR5H_BIT11 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT11
    #define ATD1DR5H_BIT12 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT12
    #define ATD1DR5H_BIT13 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT13
    #define ATD1DR5H_BIT14 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT14
    #define ATD1DR5H_BIT15 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.Bits.BIT15
    
    #define ATD1DR5H_BIT_8 _ATD1DR5.Overlap_STR.ATD1DR5HSTR.MergedBits.grpBIT_8
    #define ATD1DR5H_BIT ATD1DR5H_BIT_8
    
    #define ATD1DR5H_BIT8_MASK   1
    #define ATD1DR5H_BIT9_MASK   2
    #define ATD1DR5H_BIT10_MASK   4
    #define ATD1DR5H_BIT11_MASK   8
    #define ATD1DR5H_BIT12_MASK   16
    #define ATD1DR5H_BIT13_MASK   32
    #define ATD1DR5H_BIT14_MASK   64
    #define ATD1DR5H_BIT15_MASK   128
    #define ATD1DR5H_BIT_8_MASK  255
    #define ATD1DR5H_BIT_8_BITNUM  0


    /*** ATD1DR5L - ATD 1 Conversion Result Register 5 Low; 0x0000009B ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD1DR5LSTR;
    #define ATD1DR5L _ATD1DR5.Overlap_STR.ATD1DR5LSTR.Byte
    #define ATD1DR5L_BIT6 _ATD1DR5.Overlap_STR.ATD1DR5LSTR.Bits.BIT6
    #define ATD1DR5L_BIT7 _ATD1DR5.Overlap_STR.ATD1DR5LSTR.Bits.BIT7
    
    #define ATD1DR5L_BIT_6 _ATD1DR5.Overlap_STR.ATD1DR5LSTR.MergedBits.grpBIT_6
    #define ATD1DR5L_BIT ATD1DR5L_BIT_6
    
    #define ATD1DR5L_BIT6_MASK   64
    #define ATD1DR5L_BIT7_MASK   128
    #define ATD1DR5L_BIT_6_MASK  192
    #define ATD1DR5L_BIT_6_BITNUM  6

  } Overlap_STR;

  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpBIT_6 :10;
  } MergedBits;
} ATD1DR5STR;
extern volatile ATD1DR5STR _ATD1DR5 @(REG_BASE + 0x0000009A);
#define ATD1DR5 _ATD1DR5.Word
#define ATD1DR5_BIT6 _ATD1DR5.Bits.BIT6
#define ATD1DR5_BIT7 _ATD1DR5.Bits.BIT7
#define ATD1DR5_BIT8 _ATD1DR5.Bits.BIT8
#define ATD1DR5_BIT9 _ATD1DR5.Bits.BIT9
#define ATD1DR5_BIT10 _ATD1DR5.Bits.BIT10
#define ATD1DR5_BIT11 _ATD1DR5.Bits.BIT11
#define ATD1DR5_BIT12 _ATD1DR5.Bits.BIT12
#define ATD1DR5_BIT13 _ATD1DR5.Bits.BIT13
#define ATD1DR5_BIT14 _ATD1DR5.Bits.BIT14
#define ATD1DR5_BIT15 _ATD1DR5.Bits.BIT15
#define ATD1DR5_BIT_6 _ATD1DR5.MergedBits.grpBIT_6
#define ATD1DR5_BIT ATD1DR5_BIT_6

#define ATD1DR5_BIT6_MASK   64
#define ATD1DR5_BIT7_MASK   128
#define ATD1DR5_BIT8_MASK   256
#define ATD1DR5_BIT9_MASK   512
#define ATD1DR5_BIT10_MASK   1024
#define ATD1DR5_BIT11_MASK   2048
#define ATD1DR5_BIT12_MASK   4096
#define ATD1DR5_BIT13_MASK   8192
#define ATD1DR5_BIT14_MASK   16384
#define ATD1DR5_BIT15_MASK   32768
#define ATD1DR5_BIT_6_MASK  65472
#define ATD1DR5_BIT_6_BITNUM  6


/*** ATD1DR6 - ATD 1 Conversion Result Register 6; 0x0000009C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR6H - ATD 1 Conversion Result Register 6 High; 0x0000009C ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD1DR6HSTR;
    #define ATD1DR6H _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Byte
    #define ATD1DR6H_BIT8 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT8
    #define ATD1DR6H_BIT9 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT9
    #define ATD1DR6H_BIT10 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT10
    #define ATD1DR6H_BIT11 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT11
    #define ATD1DR6H_BIT12 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT12
    #define ATD1DR6H_BIT13 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT13
    #define ATD1DR6H_BIT14 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT14
    #define ATD1DR6H_BIT15 _ATD1DR6.Overlap_STR.ATD1DR6HSTR.Bits.BIT15
    
