frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpBIT_6 :10;
  } MergedBits;
} ATD1DR11STR;
extern volatile ATD1DR11STR _ATD1DR11 @(REG_BASE + 0x000000A6);
#define ATD1DR11 _ATD1DR11.Word
#define ATD1DR11_BIT6 _ATD1DR11.Bits.BIT6
#define ATD1DR11_BIT7 _ATD1DR11.Bits.BIT7
#define ATD1DR11_BIT8 _ATD1DR11.Bits.BIT8
#define ATD1DR11_BIT9 _ATD1DR11.Bits.BIT9
#define ATD1DR11_BIT10 _ATD1DR11.Bits.BIT10
#define ATD1DR11_BIT11 _ATD1DR11.Bits.BIT11
#define ATD1DR11_BIT12 _ATD1DR11.Bits.BIT12
#define ATD1DR11_BIT13 _ATD1DR11.Bits.BIT13
#define ATD1DR11_BIT14 _ATD1DR11.Bits.BIT14
#define ATD1DR11_BIT15 _ATD1DR11.Bits.BIT15
#define ATD1DR11_BIT_6 _ATD1DR11.MergedBits.grpBIT_6
#define ATD1DR11_BIT ATD1DR11_BIT_6

#define ATD1DR11_BIT6_MASK   64
#define ATD1DR11_BIT7_MASK   128
#define ATD1DR11_BIT8_MASK   256
#define ATD1DR11_BIT9_MASK   512
#define ATD1DR11_BIT10_MASK   1024
#define ATD1DR11_BIT11_MASK   2048
#define ATD1DR11_BIT12_MASK   4096
#define ATD1DR11_BIT13_MASK   8192
#define ATD1DR11_BIT14_MASK   16384
#define ATD1DR11_BIT15_MASK   32768
#define ATD1DR11_BIT_6_MASK  65472
#define ATD1DR11_BIT_6_BITNUM  6


/*** ATD1DR12 - ATD 1 Conversion Result Register 12; 0x000000A8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR12H - ATD 1 Conversion Result Register 12 High; 0x000000A8 ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD1DR12HSTR;
    #define ATD1DR12H _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Byte
    #define ATD1DR12H_BIT8 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT8
    #define ATD1DR12H_BIT9 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT9
    #define ATD1DR12H_BIT10 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT10
    #define ATD1DR12H_BIT11 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT11
    #define ATD1DR12H_BIT12 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT12
    #define ATD1DR12H_BIT13 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT13
    #define ATD1DR12H_BIT14 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT14
    #define ATD1DR12H_BIT15 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.Bits.BIT15
    
    #define ATD1DR12H_BIT_8 _ATD1DR12.Overlap_STR.ATD1DR12HSTR.MergedBits.grpBIT_8
    #define ATD1DR12H_BIT ATD1DR12H_BIT_8
    
    #define ATD1DR12H_BIT8_MASK   1
    #define ATD1DR12H_BIT9_MASK   2
    #define ATD1DR12H_BIT10_MASK   4
    #define ATD1DR12H_BIT11_MASK   8
    #define ATD1DR12H_BIT12_MASK   16
    #define ATD1DR12H_BIT13_MASK   32
    #define ATD1DR12H_BIT14_MASK   64
    #define ATD1DR12H_BIT15_MASK   128
    #define ATD1DR12H_BIT_8_MASK  255
    #define ATD1DR12H_BIT_8_BITNUM  0


    /*** ATD1DR12L - ATD 1 Conversion Result Register 12 Low; 0x000000A9 ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD1DR12LSTR;
    #define ATD1DR12L _ATD1DR12.Overlap_STR.ATD1DR12LSTR.Byte
    #define ATD1DR12L_BIT6 _ATD1DR12.Overlap_STR.ATD1DR12LSTR.Bits.BIT6
    #define ATD1DR12L_BIT7 _ATD1DR12.Overlap_STR.ATD1DR12LSTR.Bits.BIT7
    
    #define ATD1DR12L_BIT_6 _ATD1DR12.Overlap_STR.ATD1DR12LSTR.MergedBits.grpBIT_6
    #define ATD1DR12L_BIT ATD1DR12L_BIT_6
    
    #define ATD1DR12L_BIT6_MASK   64
    #define ATD1DR12L_BIT7_MASK   128
    #define ATD1DR12L_BIT_6_MASK  192
    #define ATD1DR12L_BIT_6_BITNUM  6

  } Overlap_STR;

  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpBIT_6 :10;
  } MergedBits;
} ATD1DR12STR;
extern volatile ATD1DR12STR _ATD1DR12 @(REG_BASE + 0x000000A8);
#define ATD1DR12 _ATD1DR12.Word
#define ATD1DR12_BIT6 _ATD1DR12.Bits.BIT6
#define ATD1DR12_BIT7 _ATD1DR12.Bits.BIT7
#define ATD1DR12_BIT8 _ATD1DR12.Bits.BIT8
#define ATD1DR12_BIT9 _ATD1DR12.Bits.BIT9
#define ATD1DR12_BIT10 _ATD1DR12.Bits.BIT10
#define ATD1DR12_BIT11 _ATD1DR12.Bits.BIT11
#define ATD1DR12_BIT12 _ATD1DR12.Bits.BIT12
#define ATD1DR12_BIT13 _ATD1DR12.Bits.BIT13
#define ATD1DR12_BIT14 _ATD1DR12.Bits.BIT14
#define ATD1DR12_BIT15 _ATD1DR12.Bits.BIT15
#define ATD1DR12_BIT_6 _ATD1DR12.MergedBits.grpBIT_6
#define ATD1DR12_BIT ATD1DR12_BIT_6

#define ATD1DR12_BIT6_MASK   64
#define ATD1DR12_BIT7_MASK   128
#define ATD1DR12_BIT8_MASK   256
#define ATD1DR12_BIT9_MASK   512
#define ATD1DR12_BIT10_MASK   1024
#define ATD1DR12_BIT11_MASK   2048
#define ATD1DR12_BIT12_MASK   4096
#define ATD1DR12_BIT13_MASK   8192
#define ATD1DR12_BIT14_MASK   16384
#define ATD1DR12_BIT15_MASK   32768
#define ATD1DR12_BIT_6_MASK  65472
#define ATD1DR12_BIT_6_BITNUM  6


/*** ATD1DR13 - ATD 1 Conversion Result Register 13; 0x000000AA ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1DR13H - ATD 1 Conversion Result Register 13 High; 0x000000AA ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
      struct {
        byte grpBIT_8 :8;
      } MergedBits;
    } ATD1DR13HSTR;
    #define ATD1DR13H _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Byte
    #define ATD1DR13H_BIT8 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT8
    #define ATD1DR13H_BIT9 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT9
    #define ATD1DR13H_BIT10 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT10
    #define ATD1DR13H_BIT11 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT11
    #define ATD1DR13H_BIT12 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT12
    #define ATD1DR13H_BIT13 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT13
    #define ATD1DR13H_BIT14 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT14
    #define ATD1DR13H_BIT15 _ATD1DR13.Overlap_STR.ATD1DR13HSTR.Bits.BIT15
    
