frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile ATD1DR15STR _ATD1DR15 @(REG_BASE + 0x000000AE);
#define ATD1DR15 _ATD1DR15.Word
#define ATD1DR15_BIT6 _ATD1DR15.Bits.BIT6
#define ATD1DR15_BIT7 _ATD1DR15.Bits.BIT7
#define ATD1DR15_BIT8 _ATD1DR15.Bits.BIT8
#define ATD1DR15_BIT9 _ATD1DR15.Bits.BIT9
#define ATD1DR15_BIT10 _ATD1DR15.Bits.BIT10
#define ATD1DR15_BIT11 _ATD1DR15.Bits.BIT11
#define ATD1DR15_BIT12 _ATD1DR15.Bits.BIT12
#define ATD1DR15_BIT13 _ATD1DR15.Bits.BIT13
#define ATD1DR15_BIT14 _ATD1DR15.Bits.BIT14
#define ATD1DR15_BIT15 _ATD1DR15.Bits.BIT15
#define ATD1DR15_BIT_6 _ATD1DR15.MergedBits.grpBIT_6
#define ATD1DR15_BIT ATD1DR15_BIT_6

#define ATD1DR15_BIT6_MASK   64
#define ATD1DR15_BIT7_MASK   128
#define ATD1DR15_BIT8_MASK   256
#define ATD1DR15_BIT9_MASK   512
#define ATD1DR15_BIT10_MASK   1024
#define ATD1DR15_BIT11_MASK   2048
#define ATD1DR15_BIT12_MASK   4096
#define ATD1DR15_BIT13_MASK   8192
#define ATD1DR15_BIT14_MASK   16384
#define ATD1DR15_BIT15_MASK   32768
#define ATD1DR15_BIT_6_MASK  65472
#define ATD1DR15_BIT_6_BITNUM  6


/*** IIC1_IBAD - IIC 1 Address Register; 0x000000B0 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte ADR1        :1;                                       /* Slave Address Bit 1 */
    byte ADR2        :1;                                       /* Slave Address Bit 2 */
    byte ADR3        :1;                                       /* Slave Address Bit 3 */
    byte ADR4        :1;                                       /* Slave Address Bit 4 */
    byte ADR5        :1;                                       /* Slave Address Bit 5 */
    byte ADR6        :1;                                       /* Slave Address Bit 6 */
    byte ADR7        :1;                                       /* Slave Address Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte grpADR_1 :7;
  } MergedBits;
} IIC1_IBADSTR;
extern volatile IIC1_IBADSTR _IIC1_IBAD @(REG_BASE + 0x000000B0);
#define IIC1_IBAD _IIC1_IBAD.Byte
#define IIC1_IBAD_ADR1 _IIC1_IBAD.Bits.ADR1
#define IIC1_IBAD_ADR2 _IIC1_IBAD.Bits.ADR2
#define IIC1_IBAD_ADR3 _IIC1_IBAD.Bits.ADR3
#define IIC1_IBAD_ADR4 _IIC1_IBAD.Bits.ADR4
#define IIC1_IBAD_ADR5 _IIC1_IBAD.Bits.ADR5
#define IIC1_IBAD_ADR6 _IIC1_IBAD.Bits.ADR6
#define IIC1_IBAD_ADR7 _IIC1_IBAD.Bits.ADR7
#define IIC1_IBAD_ADR_1 _IIC1_IBAD.MergedBits.grpADR_1
#define IIC1_IBAD_ADR IIC1_IBAD_ADR_1

#define IIC1_IBAD_ADR1_MASK   2
#define IIC1_IBAD_ADR2_MASK   4
#define IIC1_IBAD_ADR3_MASK   8
#define IIC1_IBAD_ADR4_MASK   16
#define IIC1_IBAD_ADR5_MASK   32
#define IIC1_IBAD_ADR6_MASK   64
#define IIC1_IBAD_ADR7_MASK   128
#define IIC1_IBAD_ADR_1_MASK  254
#define IIC1_IBAD_ADR_1_BITNUM  1


/*** IIC1_IBFD - IIC 1 Frequency Divider Register; 0x000000B1 ***/
typedef union {
  byte Byte;
  struct {
    byte IBC0        :1;                                       /* I-Bus Clock Rate 0 */
    byte IBC1        :1;                                       /* I-Bus Clock Rate 1 */
    byte IBC2        :1;                                       /* I-Bus Clock Rate 2 */
    byte IBC3        :1;                                       /* I-Bus Clock Rate 3 */
    byte IBC4        :1;                                       /* I-Bus Clock Rate 4 */
    byte IBC5        :1;                                       /* I-Bus Clock Rate 5 */
    byte IBC6        :1;                                       /* I-Bus Clock Rate 6 */
    byte IBC7        :1;                                       /* I-Bus Clock Rate 7 */
  } Bits;
  struct {
    byte grpIBC  :8;
  } MergedBits;
} IIC1_IBFDSTR;
extern volatile IIC1_IBFDSTR _IIC1_IBFD @(REG_BASE + 0x000000B1);
#define IIC1_IBFD _IIC1_IBFD.Byte
#define IIC1_IBFD_IBC0 _IIC1_IBFD.Bits.IBC0
#define IIC1_IBFD_IBC1 _IIC1_IBFD.Bits.IBC1
#define IIC1_IBFD_IBC2 _IIC1_IBFD.Bits.IBC2
#define IIC1_IBFD_IBC3 _IIC1_IBFD.Bits.IBC3
#define IIC1_IBFD_IBC4 _IIC1_IBFD.Bits.IBC4
#define IIC1_IBFD_IBC5 _IIC1_IBFD.Bits.IBC5
#define IIC1_IBFD_IBC6 _IIC1_IBFD.Bits.IBC6
#define IIC1_IBFD_IBC7 _IIC1_IBFD.Bits.IBC7
#define IIC1_IBFD_IBC _IIC1_IBFD.MergedBits.grpIBC

#define IIC1_IBFD_IBC0_MASK   1
#define IIC1_IBFD_IBC1_MASK   2
#define IIC1_IBFD_IBC2_MASK   4
#define IIC1_IBFD_IBC3_MASK   8
#define IIC1_IBFD_IBC4_MASK   16
#define IIC1_IBFD_IBC5_MASK   32
#define IIC1_IBFD_IBC6_MASK   64
#define IIC1_IBFD_IBC7_MASK   128
#define IIC1_IBFD_IBC_MASK  255
#define IIC1_IBFD_IBC_BITNUM  0


/*** IIC1_IBCR - IIC 1 Control Register; 0x000000B2 ***/
typedef union {
  byte Byte;
  struct {
    byte IBSWAI      :1;                                       /* I-Bus Interface Stop in WAIT mode */
    byte             :1; 
    byte RSTA        :1;                                       /* Repeat Start */
    byte TXAK        :1;                                       /* Transmit Acknowledge enable */
    byte TX_RX       :1;                                       /* Transmit/Receive mode select bit */
    byte MS_SL       :1;                                       /* Master/Slave mode select bit */
    byte IBIE        :1;                                       /* I-Bus Interrupt Enable */
    byte IBEN        :1;                                       /* I-Bus Enable */
  } Bits;
} IIC1_IBCRSTR;
extern volatile IIC1_IBCRSTR _IIC1_IBCR @(REG_BASE + 0x000000B2);
#define IIC1_IBCR _IIC1_IBCR.Byte
#define IIC1_IBCR_IBSWAI _IIC1_IBCR.Bits.IBSWAI
#define IIC1_IBCR_RSTA _IIC1_IBCR.Bits.RSTA
#define IIC1_IBCR_TXAK _IIC1_IBCR.Bits.TXAK
#define IIC1_IBCR_TX_RX _IIC1_IBCR.Bits.TX_RX
#define IIC1_IBCR_MS_SL _IIC1_IBCR.Bits.MS_SL
#define IIC1_IBCR_IBIE _IIC1_IBCR.Bits.IBIE
#define IIC1_IBCR_IBEN _IIC1_IBCR.Bits.IBEN

#define IIC1_IBCR_IBSWAI_MASK   1
#define IIC1_IBCR_RSTA_MASK   4
#define IIC1_IBCR_TXAK_MASK   8
#define IIC1_IBCR_TX_RX_MASK   16
#define IIC1_IBCR_MS_SL_MASK   32
#define IIC1_IBCR_IBIE_MASK   64
#define IIC1_IBCR_IBEN_MASK   128


/*** IIC1_IBSR - IIC 1 Status Register; 0x000000B3 ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Received Acknowledge */
    byte IBIF        :1;                                       /* I-Bus Interrupt */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1; 
    byte IBAL        :1;                                       /* Arbitration Lost */
    byte IBB         :1;                                       /* Bus busy bit */
    byte IAAS        :1;                                       /* Addressed as a slave bit */
    byte TCF         :1;                                       /* Data transferring bit */
  } Bits;
} IIC1_IBSRSTR;
extern volatile IIC1_IBSRSTR _IIC1_IBSR @(REG_BASE + 0x000000B3);
#define IIC1_IBSR _IIC1_IBSR.Byte
#define IIC1_IBSR_RXAK _IIC1_IBSR.Bits.RXAK
#define IIC1_IBSR_IBIF _IIC1_IBSR.Bits.IBIF
#define IIC1_IBSR_SRW _IIC1_IBSR.Bits.SRW
#define IIC1_IBSR_IBAL _IIC1_IBSR.Bits.IBAL
#define IIC1_IBSR_IBB _IIC1_IBSR.Bits.IBB
#define IIC1_IBSR_IAAS _IIC1_IBSR.Bits.IAAS
#define IIC1_IBSR_TCF _IIC1_IBSR.Bits.TCF

#define IIC1_IBSR_RXAK_MASK   1
#define IIC1_IBSR_IBIF_MASK   2
#define IIC1_IBSR_SRW_MASK   4
#define IIC1_IBSR_IBAL_MASK   16
#define IIC1_IBSR_IBB_MASK   32
#define IIC1_IBSR_IAAS_MASK   64
#define IIC1_IBSR_TCF_MASK   128


/*** IIC1_IBDR - IIC 1 Data I/O Register; 0x000000B4 ***/
typedef union {
  byte Byte;
  struct {
    byte D0          :1;                                       /* IIC Data Bit 0 */
    byte D1          :1;                                       /* IIC Data Bit 1 */
    byte D2          :1;                                       /* IIC Data Bit 2 */
    byte D3          :1;                                       /* IIC Data Bit 3 */
    byte D4          :1;                                       /* IIC Data Bit 4 */
    byte D5          :1;                                       /* IIC Data Bit 5 */
    byte D6          :1;                                       /* IIC Data Bit 6 */
    byte D7          :1;                                       /* IIC Data Bit 7 */
  } Bits;
  struct {
    byte grpD    :8;
  } MergedBits;
} IIC1_IBDRSTR;
extern volatile IIC1_IBDRSTR _IIC1_IBDR @(REG_BASE + 0x000000B4);
#define IIC1_IBDR _IIC1_IBDR.Byte
#define IIC1_IBDR_D0 _IIC1_IBDR.Bits.D0
#define IIC1_IBDR_D1 _IIC1_IBDR.Bits.D1
#define IIC1_IBDR_D2 _IIC1_IBDR.Bits.D2
#define IIC1_IBDR_D3 _IIC1_IBDR.Bits.D3
#define IIC1_IBDR_D4 _IIC1_IBDR.Bits.D4
#define IIC1_IBDR_D5 _IIC1_IBDR.Bits.D5
#define IIC1_IBDR_D6 _IIC1_IBDR.Bits.D6
#define IIC1_IBDR_D7 _IIC1_IBDR.Bits.D7
#define IIC1_IBDR_D _IIC1_IBDR.MergedBits.grpD

#define IIC1_IBDR_D0_MASK   1
#define IIC1_IBDR_D1_MASK   2
#define IIC1_IBDR_D2_MASK   4
#define IIC1_IBDR_D3_MASK   8
#define IIC1_IBDR_D4_MASK   16
#define IIC1_IBDR_D5_MASK   32
#define IIC1_IBDR_D6_MASK   64
#define IIC1_IBDR_D7_MASK   128
#define IIC1_IBDR_D_MASK  255
#define IIC1_IBDR_D_BITNUM  0


/*** SCI2ASR1 - SCI 2 Alternative Status Register 1; 0x000000B8 ***/
typedef union {
  byte Byte;
  union { /*Several registers at the same address */
    /*** SCI2ASR1 - SCI 2 Alternative Status Register 1; Several registers at the same address ***/
    union {
      struct {
        byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
        byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
        byte BERRV       :1;                                       /* Bit Error Value */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
      } Bits;
    } SCI2ASR1STR;
    #define SCI2ASR1 _SCI2ASR1.Byte
    #define SCI2ASR1_BKDIF _SCI2ASR1.SameAddr_STR.SCI2ASR1STR.Bits.BKDIF
    #define SCI2ASR1_BERRIF _SCI2ASR1.SameAddr_STR.SCI2ASR1STR.Bits.BERRIF
    #define SCI2ASR1_BERRV _SCI2ASR1.SameAddr_STR.SCI2ASR1STR.Bits.BERRV
    #define SCI2ASR1_RXEDGIF _SCI2ASR1.SameAddr_STR.SCI2ASR1STR.Bits.RXEDGIF
    
    
    #define SCI2ASR1_BKDIF_MASK   1
    #define SCI2ASR1_BERRIF_MASK   2
    #define SCI2ASR1_BERRV_MASK   4
    #define SCI2ASR1_RXEDGIF_MASK   128

    /*** SCI2BDH - SCI 2 Baud Rate Register High; Several registers at the same address ***/
    union {
      struct {
        byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
        byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
        byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
        byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
        byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
        byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
        byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
        byte IREN        :1;                                       /* Infrared Enable Bit */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte grpTNP :2;
        byte     :1;
      } MergedBits;
    } SCI2BDHSTR;
    #define SCI2BDH _SCI2ASR1.Byte
    #define SCI2BDH_SBR8 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.SBR8
    #define SCI2BDH_SBR9 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.SBR9
    #define SCI2BDH_SBR10 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.SBR10
    #define SCI2BDH_SBR11 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.SBR11
    #define SCI2BDH_SBR12 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.SBR12
    #define SCI2BDH_TNP0 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.TNP0
    #define SCI2BDH_TNP1 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.TNP1
    #define SCI2BDH_IREN _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.Bits.IREN
    
    #define SCI2BDH_SBR_8 _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.MergedBits.grpSBR_8
    #define SCI2BDH_TNP _SCI2ASR1.SameAddr_STR.SCI2BDHSTR.MergedBits.grpTNP
    #define SCI2BDH_SBR SCI2BDH_SBR_8
    
    #define SCI2BDH_SBR8_MASK   1
    #define SCI2BDH_SBR9_MASK   2
    #define SCI2BDH_SBR10_MASK   4
    #define SCI2BDH_SBR11_MASK   8
    #define SCI2BDH_SBR12_MASK   16
    #define SCI2BDH_TNP0_MASK   32
    #define SCI2BDH_TNP1_MASK   64
    #define SCI2BDH_IREN_MASK   128
    #define SCI2BDH_SBR_8_MASK  31
    #define SCI2BDH_SBR_8_BITNUM  0
    #define SCI2BDH_TNP_MASK  96
    #define SCI2BDH_TNP_BITNUM  5

