frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile SCI2SR2STR _SCI2SR2 @(REG_BASE + 0x000000BD);
#define SCI2SR2 _SCI2SR2.Byte
#define SCI2SR2_RAF _SCI2SR2.Bits.RAF
#define SCI2SR2_TXDIR _SCI2SR2.Bits.TXDIR
#define SCI2SR2_BRK13 _SCI2SR2.Bits.BRK13
#define SCI2SR2_RXPOL _SCI2SR2.Bits.RXPOL
#define SCI2SR2_TXPOL _SCI2SR2.Bits.TXPOL
#define SCI2SR2_AMAP _SCI2SR2.Bits.AMAP

#define SCI2SR2_RAF_MASK   1
#define SCI2SR2_TXDIR_MASK   2
#define SCI2SR2_BRK13_MASK   4
#define SCI2SR2_RXPOL_MASK   8
#define SCI2SR2_TXPOL_MASK   16
#define SCI2SR2_AMAP_MASK   128


/*** SCI2DRH - SCI 2 Data Register High; 0x000000BE ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI2DRHSTR;
extern volatile SCI2DRHSTR _SCI2DRH @(REG_BASE + 0x000000BE);
#define SCI2DRH _SCI2DRH.Byte
#define SCI2DRH_T8 _SCI2DRH.Bits.T8
#define SCI2DRH_R8 _SCI2DRH.Bits.R8

#define SCI2DRH_T8_MASK   64
#define SCI2DRH_R8_MASK   128


/*** SCI2DRL - SCI 2 Data Register Low; 0x000000BF ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI2DRLSTR;
extern volatile SCI2DRLSTR _SCI2DRL @(REG_BASE + 0x000000BF);
#define SCI2DRL _SCI2DRL.Byte
#define SCI2DRL_R0_T0 _SCI2DRL.Bits.R0_T0
#define SCI2DRL_R1_T1 _SCI2DRL.Bits.R1_T1
#define SCI2DRL_R2_T2 _SCI2DRL.Bits.R2_T2
#define SCI2DRL_R3_T3 _SCI2DRL.Bits.R3_T3
#define SCI2DRL_R4_T4 _SCI2DRL.Bits.R4_T4
#define SCI2DRL_R5_T5 _SCI2DRL.Bits.R5_T5
#define SCI2DRL_R6_T6 _SCI2DRL.Bits.R6_T6
#define SCI2DRL_R7_T7 _SCI2DRL.Bits.R7_T7

#define SCI2DRL_R0_T0_MASK   1
#define SCI2DRL_R1_T1_MASK   2
#define SCI2DRL_R2_T2_MASK   4
#define SCI2DRL_R3_T3_MASK   8
#define SCI2DRL_R4_T4_MASK   16
#define SCI2DRL_R5_T5_MASK   32
#define SCI2DRL_R6_T6_MASK   64
#define SCI2DRL_R7_T7_MASK   128


/*** SCI3ASR1 - SCI 3 Alternative Status Register 1; 0x000000C0 ***/
typedef union {
  byte Byte;
  union { /*Several registers at the same address */
    /*** SCI3ASR1 - SCI 3 Alternative Status Register 1; Several registers at the same address ***/
    union {
      struct {
        byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
        byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
        byte BERRV       :1;                                       /* Bit Error Value */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
      } Bits;
    } SCI3ASR1STR;
    #define SCI3ASR1 _SCI3ASR1.Byte
    #define SCI3ASR1_BKDIF _SCI3ASR1.SameAddr_STR.SCI3ASR1STR.Bits.BKDIF
    #define SCI3ASR1_BERRIF _SCI3ASR1.SameAddr_STR.SCI3ASR1STR.Bits.BERRIF
    #define SCI3ASR1_BERRV _SCI3ASR1.SameAddr_STR.SCI3ASR1STR.Bits.BERRV
    #define SCI3ASR1_RXEDGIF _SCI3ASR1.SameAddr_STR.SCI3ASR1STR.Bits.RXEDGIF
    
    
    #define SCI3ASR1_BKDIF_MASK   1
    #define SCI3ASR1_BERRIF_MASK   2
    #define SCI3ASR1_BERRV_MASK   4
    #define SCI3ASR1_RXEDGIF_MASK   128

    /*** SCI3BDH - SCI 3 Baud Rate Register High; Several registers at the same address ***/
    union {
      struct {
        byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
        byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
        byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
        byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
        byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
        byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
        byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
        byte IREN        :1;                                       /* Infrared Enable Bit */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte grpTNP :2;
        byte     :1;
      } MergedBits;
    } SCI3BDHSTR;
    #define SCI3BDH _SCI3ASR1.Byte
    #define SCI3BDH_SBR8 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.SBR8
    #define SCI3BDH_SBR9 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.SBR9
    #define SCI3BDH_SBR10 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.SBR10
    #define SCI3BDH_SBR11 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.SBR11
    #define SCI3BDH_SBR12 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.SBR12
    #define SCI3BDH_TNP0 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.TNP0
    #define SCI3BDH_TNP1 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.TNP1
    #define SCI3BDH_IREN _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.Bits.IREN
    
    #define SCI3BDH_SBR_8 _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.MergedBits.grpSBR_8
    #define SCI3BDH_TNP _SCI3ASR1.SameAddr_STR.SCI3BDHSTR.MergedBits.grpTNP
    #define SCI3BDH_SBR SCI3BDH_SBR_8
    
    #define SCI3BDH_SBR8_MASK   1
    #define SCI3BDH_SBR9_MASK   2
    #define SCI3BDH_SBR10_MASK   4
    #define SCI3BDH_SBR11_MASK   8
    #define SCI3BDH_SBR12_MASK   16
    #define SCI3BDH_TNP0_MASK   32
    #define SCI3BDH_TNP1_MASK   64
    #define SCI3BDH_IREN_MASK   128
    #define SCI3BDH_SBR_8_MASK  31
    #define SCI3BDH_SBR_8_BITNUM  0
    #define SCI3BDH_TNP_MASK  96
    #define SCI3BDH_TNP_BITNUM  5

