frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile SCI3SR2STR _SCI3SR2 @(REG_BASE + 0x000000C5);
#define SCI3SR2 _SCI3SR2.Byte
#define SCI3SR2_RAF _SCI3SR2.Bits.RAF
#define SCI3SR2_TXDIR _SCI3SR2.Bits.TXDIR
#define SCI3SR2_BRK13 _SCI3SR2.Bits.BRK13
#define SCI3SR2_RXPOL _SCI3SR2.Bits.RXPOL
#define SCI3SR2_TXPOL _SCI3SR2.Bits.TXPOL
#define SCI3SR2_AMAP _SCI3SR2.Bits.AMAP

#define SCI3SR2_RAF_MASK   1
#define SCI3SR2_TXDIR_MASK   2
#define SCI3SR2_BRK13_MASK   4
#define SCI3SR2_RXPOL_MASK   8
#define SCI3SR2_TXPOL_MASK   16
#define SCI3SR2_AMAP_MASK   128


/*** SCI3DRH - SCI 3 Data Register High; 0x000000C6 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI3DRHSTR;
extern volatile SCI3DRHSTR _SCI3DRH @(REG_BASE + 0x000000C6);
#define SCI3DRH _SCI3DRH.Byte
#define SCI3DRH_T8 _SCI3DRH.Bits.T8
#define SCI3DRH_R8 _SCI3DRH.Bits.R8

#define SCI3DRH_T8_MASK   64
#define SCI3DRH_R8_MASK   128


/*** SCI3DRL - SCI 3 Data Register Low; 0x000000C7 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI3DRLSTR;
extern volatile SCI3DRLSTR _SCI3DRL @(REG_BASE + 0x000000C7);
#define SCI3DRL _SCI3DRL.Byte
#define SCI3DRL_R0_T0 _SCI3DRL.Bits.R0_T0
#define SCI3DRL_R1_T1 _SCI3DRL.Bits.R1_T1
#define SCI3DRL_R2_T2 _SCI3DRL.Bits.R2_T2
#define SCI3DRL_R3_T3 _SCI3DRL.Bits.R3_T3
#define SCI3DRL_R4_T4 _SCI3DRL.Bits.R4_T4
#define SCI3DRL_R5_T5 _SCI3DRL.Bits.R5_T5
#define SCI3DRL_R6_T6 _SCI3DRL.Bits.R6_T6
#define SCI3DRL_R7_T7 _SCI3DRL.Bits.R7_T7

#define SCI3DRL_R0_T0_MASK   1
#define SCI3DRL_R1_T1_MASK   2
#define SCI3DRL_R2_T2_MASK   4
#define SCI3DRL_R3_T3_MASK   8
#define SCI3DRL_R4_T4_MASK   16
#define SCI3DRL_R5_T5_MASK   32
#define SCI3DRL_R6_T6_MASK   64
#define SCI3DRL_R7_T7_MASK   128


/*** SCI0ASR1 - SCI 0 Alternative Status Register 1; 0x000000C8 ***/
typedef union {
  byte Byte;
  union { /*Several registers at the same address */
    /*** SCI0ASR1 - SCI 0 Alternative Status Register 1; Several registers at the same address ***/
    union {
      struct {
        byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
        byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
        byte BERRV       :1;                                       /* Bit Error Value */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
      } Bits;
    } SCI0ASR1STR;
    #define SCI0ASR1 _SCI0ASR1.Byte
    #define SCI0ASR1_BKDIF _SCI0ASR1.SameAddr_STR.SCI0ASR1STR.Bits.BKDIF
    #define SCI0ASR1_BERRIF _SCI0ASR1.SameAddr_STR.SCI0ASR1STR.Bits.BERRIF
    #define SCI0ASR1_BERRV _SCI0ASR1.SameAddr_STR.SCI0ASR1STR.Bits.BERRV
    #define SCI0ASR1_RXEDGIF _SCI0ASR1.SameAddr_STR.SCI0ASR1STR.Bits.RXEDGIF
    
    
    #define SCI0ASR1_BKDIF_MASK   1
    #define SCI0ASR1_BERRIF_MASK   2
    #define SCI0ASR1_BERRV_MASK   4
    #define SCI0ASR1_RXEDGIF_MASK   128

    /*** SCI0BDH - SCI 0 Baud Rate Register High; Several registers at the same address ***/
    union {
      struct {
        byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
        byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
        byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
        byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
        byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
        byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
        byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
        byte IREN        :1;                                       /* Infrared Enable Bit */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte grpTNP :2;
        byte     :1;
      } MergedBits;
    } SCI0BDHSTR;
    #define SCI0BDH _SCI0ASR1.Byte
    #define SCI0BDH_SBR8 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.SBR8
    #define SCI0BDH_SBR9 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.SBR9
    #define SCI0BDH_SBR10 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.SBR10
    #define SCI0BDH_SBR11 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.SBR11
    #define SCI0BDH_SBR12 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.SBR12
    #define SCI0BDH_TNP0 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.TNP0
    #define SCI0BDH_TNP1 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.TNP1
    #define SCI0BDH_IREN _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.Bits.IREN
    
    #define SCI0BDH_SBR_8 _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.MergedBits.grpSBR_8
    #define SCI0BDH_TNP _SCI0ASR1.SameAddr_STR.SCI0BDHSTR.MergedBits.grpTNP
    #define SCI0BDH_SBR SCI0BDH_SBR_8
    
    #define SCI0BDH_SBR8_MASK   1
    #define SCI0BDH_SBR9_MASK   2
    #define SCI0BDH_SBR10_MASK   4
    #define SCI0BDH_SBR11_MASK   8
    #define SCI0BDH_SBR12_MASK   16
    #define SCI0BDH_TNP0_MASK   32
    #define SCI0BDH_TNP1_MASK   64
    #define SCI0BDH_IREN_MASK   128
    #define SCI0BDH_SBR_8_MASK  31
    #define SCI0BDH_SBR_8_BITNUM  0
    #define SCI0BDH_TNP_MASK  96
    #define SCI0BDH_TNP_BITNUM  5

