frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile SCI0SR2STR _SCI0SR2 @(REG_BASE + 0x000000CD);
#define SCI0SR2 _SCI0SR2.Byte
#define SCI0SR2_RAF _SCI0SR2.Bits.RAF
#define SCI0SR2_TXDIR _SCI0SR2.Bits.TXDIR
#define SCI0SR2_BRK13 _SCI0SR2.Bits.BRK13
#define SCI0SR2_RXPOL _SCI0SR2.Bits.RXPOL
#define SCI0SR2_TXPOL _SCI0SR2.Bits.TXPOL
#define SCI0SR2_AMAP _SCI0SR2.Bits.AMAP

#define SCI0SR2_RAF_MASK   1
#define SCI0SR2_TXDIR_MASK   2
#define SCI0SR2_BRK13_MASK   4
#define SCI0SR2_RXPOL_MASK   8
#define SCI0SR2_TXPOL_MASK   16
#define SCI0SR2_AMAP_MASK   128


/*** SCI0DRH - SCI 0 Data Register High; 0x000000CE ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI0DRHSTR;
extern volatile SCI0DRHSTR _SCI0DRH @(REG_BASE + 0x000000CE);
#define SCI0DRH _SCI0DRH.Byte
#define SCI0DRH_T8 _SCI0DRH.Bits.T8
#define SCI0DRH_R8 _SCI0DRH.Bits.R8

#define SCI0DRH_T8_MASK   64
#define SCI0DRH_R8_MASK   128


/*** SCI0DRL - SCI 0 Data Register Low; 0x000000CF ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI0DRLSTR;
extern volatile SCI0DRLSTR _SCI0DRL @(REG_BASE + 0x000000CF);
#define SCI0DRL _SCI0DRL.Byte
#define SCI0DRL_R0_T0 _SCI0DRL.Bits.R0_T0
#define SCI0DRL_R1_T1 _SCI0DRL.Bits.R1_T1
#define SCI0DRL_R2_T2 _SCI0DRL.Bits.R2_T2
#define SCI0DRL_R3_T3 _SCI0DRL.Bits.R3_T3
#define SCI0DRL_R4_T4 _SCI0DRL.Bits.R4_T4
#define SCI0DRL_R5_T5 _SCI0DRL.Bits.R5_T5
#define SCI0DRL_R6_T6 _SCI0DRL.Bits.R6_T6
#define SCI0DRL_R7_T7 _SCI0DRL.Bits.R7_T7

#define SCI0DRL_R0_T0_MASK   1
#define SCI0DRL_R1_T1_MASK   2
#define SCI0DRL_R2_T2_MASK   4
#define SCI0DRL_R3_T3_MASK   8
#define SCI0DRL_R4_T4_MASK   16
#define SCI0DRL_R5_T5_MASK   32
#define SCI0DRL_R6_T6_MASK   64
#define SCI0DRL_R7_T7_MASK   128


/*** SCI1ASR1 - SCI 1 Alternative Status Register 1; 0x000000D0 ***/
typedef union {
  byte Byte;
  union { /*Several registers at the same address */
    /*** SCI1ASR1 - SCI 1 Alternative Status Register 1; Several registers at the same address ***/
    union {
      struct {
        byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
        byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
        byte BERRV       :1;                                       /* Bit Error Value */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
      } Bits;
    } SCI1ASR1STR;
    #define SCI1ASR1 _SCI1ASR1.Byte
    #define SCI1ASR1_BKDIF _SCI1ASR1.SameAddr_STR.SCI1ASR1STR.Bits.BKDIF
    #define SCI1ASR1_BERRIF _SCI1ASR1.SameAddr_STR.SCI1ASR1STR.Bits.BERRIF
    #define SCI1ASR1_BERRV _SCI1ASR1.SameAddr_STR.SCI1ASR1STR.Bits.BERRV
    #define SCI1ASR1_RXEDGIF _SCI1ASR1.SameAddr_STR.SCI1ASR1STR.Bits.RXEDGIF
    
    
    #define SCI1ASR1_BKDIF_MASK   1
    #define SCI1ASR1_BERRIF_MASK   2
    #define SCI1ASR1_BERRV_MASK   4
    #define SCI1ASR1_RXEDGIF_MASK   128

    /*** SCI1BDH - SCI 1 Baud Rate Register High; Several registers at the same address ***/
    union {
      struct {
        byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
        byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
        byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
        byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
        byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
        byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
        byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
        byte IREN        :1;                                       /* Infrared Enable Bit */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte grpTNP :2;
        byte     :1;
      } MergedBits;
    } SCI1BDHSTR;
    #define SCI1BDH _SCI1ASR1.Byte
    #define SCI1BDH_SBR8 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.SBR8
    #define SCI1BDH_SBR9 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.SBR9
    #define SCI1BDH_SBR10 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.SBR10
    #define SCI1BDH_SBR11 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.SBR11
    #define SCI1BDH_SBR12 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.SBR12
    #define SCI1BDH_TNP0 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.TNP0
    #define SCI1BDH_TNP1 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.TNP1
    #define SCI1BDH_IREN _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.Bits.IREN
    
    #define SCI1BDH_SBR_8 _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.MergedBits.grpSBR_8
    #define SCI1BDH_TNP _SCI1ASR1.SameAddr_STR.SCI1BDHSTR.MergedBits.grpTNP
    #define SCI1BDH_SBR SCI1BDH_SBR_8
    
    #define SCI1BDH_SBR8_MASK   1
    #define SCI1BDH_SBR9_MASK   2
    #define SCI1BDH_SBR10_MASK   4
    #define SCI1BDH_SBR11_MASK   8
    #define SCI1BDH_SBR12_MASK   16
    #define SCI1BDH_TNP0_MASK   32
    #define SCI1BDH_TNP1_MASK   64
    #define SCI1BDH_IREN_MASK   128
    #define SCI1BDH_SBR_8_MASK  31
    #define SCI1BDH_SBR_8_BITNUM  0
    #define SCI1BDH_TNP_MASK  96
    #define SCI1BDH_TNP_BITNUM  5

