frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  } SameAddr_STR; /*Several registers at the same address */

} SCI1ASR1STR;
extern volatile SCI1ASR1STR _SCI1ASR1 @(REG_BASE + 0x000000D0);



/*** SCI1BD - SCI 1 Baud Rate Register; 0x000000D1 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI1ACR1 - SCI 1 Alternative Control Register 1; 0x000000D1 ***/
    union {
      byte Byte;
      union { /*Several registers at the same address */
        /*** SCI1ACR1 - SCI 1 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI1ACR1STR;
        #define SCI1ACR1 _SCI1BD.Overlap_STR.SCI1ACR1STR.Byte
        #define SCI1ACR1_BKDIE _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1ACR1STR.Bits.BKDIE
        #define SCI1ACR1_BERRIE _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1ACR1STR.Bits.BERRIE
        #define SCI1ACR1_RXEDGIE _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1ACR1STR.Bits.RXEDGIE
        
        
        #define SCI1ACR1_BKDIE_MASK   1
        #define SCI1ACR1_BERRIE_MASK   2
        #define SCI1ACR1_RXEDGIE_MASK   128
    
        /*** SCI1BDL - SCI 1 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
          struct {
            byte grpSBR :8;
          } MergedBits;
        } SCI1BDLSTR;
        #define SCI1BDL _SCI1BD.Overlap_STR.SCI1ACR1STR.Byte
        #define SCI1BDL_SBR0 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR0
        #define SCI1BDL_SBR1 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR1
        #define SCI1BDL_SBR2 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR2
        #define SCI1BDL_SBR3 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR3
        #define SCI1BDL_SBR4 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR4
        #define SCI1BDL_SBR5 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR5
        #define SCI1BDL_SBR6 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR6
        #define SCI1BDL_SBR7 _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.Bits.SBR7
        
        #define SCI1BDL_SBR _SCI1BD.Overlap_STR.SCI1ACR1STR.SameAddr_STR.SCI1BDLSTR.MergedBits.grpSBR
        
        #define SCI1BDL_SBR0_MASK   1
        #define SCI1BDL_SBR1_MASK   2
        #define SCI1BDL_SBR2_MASK   4
        #define SCI1BDL_SBR3_MASK   8
        #define SCI1BDL_SBR4_MASK   16
        #define SCI1BDL_SBR5_MASK   32
        #define SCI1BDL_SBR6_MASK   64
        #define SCI1BDL_SBR7_MASK   128
        #define SCI1BDL_SBR_MASK  255
        #define SCI1BDL_SBR_BITNUM  0
    
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI1ACR1STR;
    


    /*** SCI1ACR2 - SCI 1 Alternative Control Register 2; 0x000000D2 ***/
    union {
      byte Byte;
      union { /*Several registers at the same address */
        /*** SCI1ACR2 - SCI 1 Alternative Control Register 2; Several registers at the same address ***/
        union {
          struct {
            byte BKDFE       :1;                                       /* Break Detect Feature Enable */
            byte BERRM0      :1;                                       /* Bit Error Mode Bit 0 */
            byte BERRM1      :1;                                       /* Bit Error Mode Bit 1 */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
          } Bits;
          struct {
            byte :1;
            byte grpBERRM :2;
            byte :1;
            byte :1;
            byte :1;
            byte :1;
            byte :1;
          } MergedBits;
        } SCI1ACR2STR;
        #define SCI1ACR2 _SCI1BD.Overlap_STR.SCI1ACR2STR.Byte
        #define SCI1ACR2_BKDFE _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1ACR2STR.Bits.BKDFE
        #define SCI1ACR2_BERRM0 _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1ACR2STR.Bits.BERRM0
        #define SCI1ACR2_BERRM1 _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1ACR2STR.Bits.BERRM1
        
        #define SCI1ACR2_BERRM _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1ACR2STR.MergedBits.grpBERRM
        
        #define SCI1ACR2_BKDFE_MASK   1
        #define SCI1ACR2_BERRM0_MASK   2
        #define SCI1ACR2_BERRM1_MASK   4
        #define SCI1ACR2_BERRM_MASK  6
        #define SCI1ACR2_BERRM_BITNUM  1
    
        /*** SCI1CR1 - SCI 1 Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte PT          :1;                                       /* Parity Type Bit */
            byte PE          :1;                                       /* Parity Enable Bit */
            byte ILT         :1;                                       /* Idle Line Type Bit */
            byte WAKE        :1;                                       /* Wakeup Condition Bit */
            byte M           :1;                                       /* Data Format Mode Bit */
            byte RSRC        :1;                                       /* Receiver Source Bit */
            byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
            byte LOOPS       :1;                                       /* Loop Select Bit */
          } Bits;
        } SCI1CR1STR;
        #define SCI1CR1 _SCI1BD.Overlap_STR.SCI1ACR2STR.Byte
        #define SCI1CR1_PT _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.PT
        #define SCI1CR1_PE _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.PE
        #define SCI1CR1_ILT _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.ILT
        #define SCI1CR1_WAKE _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.WAKE
        #define SCI1CR1_M _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.M
        #define SCI1CR1_RSRC _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.RSRC
        #define SCI1CR1_SCISWAI _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.SCISWAI
        #define SCI1CR1_LOOPS _SCI1BD.Overlap_STR.SCI1ACR2STR.SameAddr_STR.SCI1CR1STR.Bits.LOOPS
        
        
        #define SCI1CR1_PT_MASK   1
        #define SCI1CR1_PE_MASK   2
        #define SCI1CR1_ILT_MASK   4
        #define SCI1CR1_WAKE_MASK   8
        #define SCI1CR1_M_MASK   16
        #define SCI1CR1_RSRC_MASK   32
        #define SCI1CR1_SCISWAI_MASK   64
        #define SCI1CR1_LOOPS_MASK   128
    
