frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile SPI0BRSTR _SPI0BR @(REG_BASE + 0x000000DA);
#define SPI0BR _SPI0BR.Byte
#define SPI0BR_SPR0 _SPI0BR.Bits.SPR0
#define SPI0BR_SPR1 _SPI0BR.Bits.SPR1
#define SPI0BR_SPR2 _SPI0BR.Bits.SPR2
#define SPI0BR_SPPR0 _SPI0BR.Bits.SPPR0
#define SPI0BR_SPPR1 _SPI0BR.Bits.SPPR1
#define SPI0BR_SPPR2 _SPI0BR.Bits.SPPR2
#define SPI0BR_SPR _SPI0BR.MergedBits.grpSPR
#define SPI0BR_SPPR _SPI0BR.MergedBits.grpSPPR

#define SPI0BR_SPR0_MASK   1
#define SPI0BR_SPR1_MASK   2
#define SPI0BR_SPR2_MASK   4
#define SPI0BR_SPPR0_MASK   16
#define SPI0BR_SPPR1_MASK   32
#define SPI0BR_SPPR2_MASK   64
#define SPI0BR_SPR_MASK  7
#define SPI0BR_SPR_BITNUM  0
#define SPI0BR_SPPR_MASK  112
#define SPI0BR_SPPR_BITNUM  4


/*** SPI0SR - SPI 0 Status Register; 0x000000DB ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte MODF        :1;                                       /* Mode Fault Flag */
    byte SPTEF       :1;                                       /* SPI Transmit Empty Interrupt Flag */
    byte             :1; 
    byte SPIF        :1;                                       /* SPIF Receive Interrupt Flag */
  } Bits;
} SPI0SRSTR;
extern volatile SPI0SRSTR _SPI0SR @(REG_BASE + 0x000000DB);
#define SPI0SR _SPI0SR.Byte
#define SPI0SR_MODF _SPI0SR.Bits.MODF
#define SPI0SR_SPTEF _SPI0SR.Bits.SPTEF
#define SPI0SR_SPIF _SPI0SR.Bits.SPIF

#define SPI0SR_MODF_MASK   16
#define SPI0SR_SPTEF_MASK   32
#define SPI0SR_SPIF_MASK   128


/*** SPI0DR - SPI 0 Data Register; 0x000000DD ***/
typedef union {
  byte Byte;
  struct {
    byte grpBIT  :8;
  } MergedBits;
} SPI0DRSTR;
extern volatile SPI0DRSTR _SPI0DR @(REG_BASE + 0x000000DD);
#define SPI0DR _SPI0DR.Byte
#define SPI0DR_BIT _SPI0DR.MergedBits.grpBIT

#define SPI0DR_BIT_MASK  255
#define SPI0DR_BIT_BITNUM  0


/*** IIC0_IBAD - IIC 0 Address Register; 0x000000E0 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte ADR1        :1;                                       /* Slave Address Bit 1 */
    byte ADR2        :1;                                       /* Slave Address Bit 2 */
    byte ADR3        :1;                                       /* Slave Address Bit 3 */
    byte ADR4        :1;                                       /* Slave Address Bit 4 */
    byte ADR5        :1;                                       /* Slave Address Bit 5 */
    byte ADR6        :1;                                       /* Slave Address Bit 6 */
    byte ADR7        :1;                                       /* Slave Address Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte grpADR_1 :7;
  } MergedBits;
} IIC0_IBADSTR;
extern volatile IIC0_IBADSTR _IIC0_IBAD @(REG_BASE + 0x000000E0);
#define IIC0_IBAD _IIC0_IBAD.Byte
#define IIC0_IBAD_ADR1 _IIC0_IBAD.Bits.ADR1
#define IIC0_IBAD_ADR2 _IIC0_IBAD.Bits.ADR2
#define IIC0_IBAD_ADR3 _IIC0_IBAD.Bits.ADR3
#define IIC0_IBAD_ADR4 _IIC0_IBAD.Bits.ADR4
#define IIC0_IBAD_ADR5 _IIC0_IBAD.Bits.ADR5
#define IIC0_IBAD_ADR6 _IIC0_IBAD.Bits.ADR6
#define IIC0_IBAD_ADR7 _IIC0_IBAD.Bits.ADR7
#define IIC0_IBAD_ADR_1 _IIC0_IBAD.MergedBits.grpADR_1
#define IIC0_IBAD_ADR IIC0_IBAD_ADR_1

#define IIC0_IBAD_ADR1_MASK   2
#define IIC0_IBAD_ADR2_MASK   4
#define IIC0_IBAD_ADR3_MASK   8
#define IIC0_IBAD_ADR4_MASK   16
#define IIC0_IBAD_ADR5_MASK   32
#define IIC0_IBAD_ADR6_MASK   64
#define IIC0_IBAD_ADR7_MASK   128
#define IIC0_IBAD_ADR_1_MASK  254
#define IIC0_IBAD_ADR_1_BITNUM  1


/*** IIC0_IBFD - IIC 0 Frequency Divider Register; 0x000000E1 ***/
typedef union {
  byte Byte;
  struct {
    byte IBC0        :1;                                       /* I-Bus Clock Rate 0 */
    byte IBC1        :1;                                       /* I-Bus Clock Rate 1 */
    byte IBC2        :1;                                       /* I-Bus Clock Rate 2 */
    byte IBC3        :1;                                       /* I-Bus Clock Rate 3 */
    byte IBC4        :1;                                       /* I-Bus Clock Rate 4 */
    byte IBC5        :1;                                       /* I-Bus Clock Rate 5 */
    byte IBC6        :1;                                       /* I-Bus Clock Rate 6 */
    byte IBC7        :1;                                       /* I-Bus Clock Rate 7 */
  } Bits;
  struct {
    byte grpIBC  :8;
  } MergedBits;
} IIC0_IBFDSTR;
extern volatile IIC0_IBFDSTR _IIC0_IBFD @(REG_BASE + 0x000000E1);
#define IIC0_IBFD _IIC0_IBFD.Byte
#define IIC0_IBFD_IBC0 _IIC0_IBFD.Bits.IBC0
#define IIC0_IBFD_IBC1 _IIC0_IBFD.Bits.IBC1
#define IIC0_IBFD_IBC2 _IIC0_IBFD.Bits.IBC2
#define IIC0_IBFD_IBC3 _IIC0_IBFD.Bits.IBC3
#define IIC0_IBFD_IBC4 _IIC0_IBFD.Bits.IBC4
#define IIC0_IBFD_IBC5 _IIC0_IBFD.Bits.IBC5
#define IIC0_IBFD_IBC6 _IIC0_IBFD.Bits.IBC6
#define IIC0_IBFD_IBC7 _IIC0_IBFD.Bits.IBC7
#define IIC0_IBFD_IBC _IIC0_IBFD.MergedBits.grpIBC

#define IIC0_IBFD_IBC0_MASK   1
#define IIC0_IBFD_IBC1_MASK   2
#define IIC0_IBFD_IBC2_MASK   4
#define IIC0_IBFD_IBC3_MASK   8
#define IIC0_IBFD_IBC4_MASK   16
#define IIC0_IBFD_IBC5_MASK   32
#define IIC0_IBFD_IBC6_MASK   64
#define IIC0_IBFD_IBC7_MASK   128
#define IIC0_IBFD_IBC_MASK  255
#define IIC0_IBFD_IBC_BITNUM  0


/*** IIC0_IBCR - IIC 0 Control Register; 0x000000E2 ***/
typedef union {
  byte Byte;
  struct {
    byte IBSWAI      :1;                                       /* I-Bus Interface Stop in WAIT mode */
    byte             :1; 
    byte RSTA        :1;                                       /* Repeat Start */
    byte TXAK        :1;                                       /* Transmit Acknowledge enable */
    byte TX_RX       :1;                                       /* Transmit/Receive mode select bit */
    byte MS_SL       :1;                                       /* Master/Slave mode select bit */
    byte IBIE        :1;                                       /* I-Bus Interrupt Enable */
    byte IBEN        :1;                                       /* I-Bus Enable */
  } Bits;
} IIC0_IBCRSTR;
extern volatile IIC0_IBCRSTR _IIC0_IBCR @(REG_BASE + 0x000000E2);
#define IIC0_IBCR _IIC0_IBCR.Byte
#define IIC0_IBCR_IBSWAI _IIC0_IBCR.Bits.IBSWAI
#define IIC0_IBCR_RSTA _IIC0_IBCR.Bits.RSTA
#define IIC0_IBCR_TXAK _IIC0_IBCR.Bits.TXAK
#define IIC0_IBCR_TX_RX _IIC0_IBCR.Bits.TX_RX
#define IIC0_IBCR_MS_SL _IIC0_IBCR.Bits.MS_SL
#define IIC0_IBCR_IBIE _IIC0_IBCR.Bits.IBIE
#define IIC0_IBCR_IBEN _IIC0_IBCR.Bits.IBEN

#define IIC0_IBCR_IBSWAI_MASK   1
#define IIC0_IBCR_RSTA_MASK   4
#define IIC0_IBCR_TXAK_MASK   8
#define IIC0_IBCR_TX_RX_MASK   16
#define IIC0_IBCR_MS_SL_MASK   32
#define IIC0_IBCR_IBIE_MASK   64
#define IIC0_IBCR_IBEN_MASK   128


/*** IIC0_IBSR - IIC 0 Status Register; 0x000000E3 ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Received Acknowledge */
    byte IBIF        :1;                                       /* I-Bus Interrupt */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1; 
    byte IBAL        :1;                                       /* Arbitration Lost */
    byte IBB         :1;                                       /* Bus busy bit */
    byte IAAS        :1;                                       /* Addressed as a slave bit */
    byte TCF         :1;                                       /* Data transferring bit */
  } Bits;
} IIC0_IBSRSTR;
extern volatile IIC0_IBSRSTR _IIC0_IBSR @(REG_BASE + 0x000000E3);
#define IIC0_IBSR _IIC0_IBSR.Byte
#define IIC0_IBSR_RXAK _IIC0_IBSR.Bits.RXAK
#define IIC0_IBSR_IBIF _IIC0_IBSR.Bits.IBIF
#define IIC0_IBSR_SRW _IIC0_IBSR.Bits.SRW
#define IIC0_IBSR_IBAL _IIC0_IBSR.Bits.IBAL
#define IIC0_IBSR_IBB _IIC0_IBSR.Bits.IBB
#define IIC0_IBSR_IAAS _IIC0_IBSR.Bits.IAAS
#define IIC0_IBSR_TCF _IIC0_IBSR.Bits.TCF

#define IIC0_IBSR_RXAK_MASK   1
#define IIC0_IBSR_IBIF_MASK   2
#define IIC0_IBSR_SRW_MASK   4
#define IIC0_IBSR_IBAL_MASK   16
#define IIC0_IBSR_IBB_MASK   32
#define IIC0_IBSR_IAAS_MASK   64
#define IIC0_IBSR_TCF_MASK   128


/*** IIC0_IBDR - IIC 0 Data I/O Register; 0x000000E4 ***/
typedef union {
  byte Byte;
  struct {
    byte D0          :1;                                       /* IIC Data Bit 0 */
    byte D1          :1;                                       /* IIC Data Bit 1 */
    byte D2          :1;                                       /* IIC Data Bit 2 */
    byte D3          :1;                                       /* IIC Data Bit 3 */
    byte D4          :1;                                       /* IIC Data Bit 4 */
    byte D5          :1;                                       /* IIC Data Bit 5 */
    byte D6          :1;                                       /* IIC Data Bit 6 */
    byte D7          :1;                                       /* IIC Data Bit 7 */
  } Bits;
  struct {
    byte grpD    :8;
  } MergedBits;
} IIC0_IBDRSTR;
extern volatile IIC0_IBDRSTR _IIC0_IBDR @(REG_BASE + 0x000000E4);
#define IIC0_IBDR _IIC0_IBDR.Byte
#define IIC0_IBDR_D0 _IIC0_IBDR.Bits.D0
#define IIC0_IBDR_D1 _IIC0_IBDR.Bits.D1
#define IIC0_IBDR_D2 _IIC0_IBDR.Bits.D2
#define IIC0_IBDR_D3 _IIC0_IBDR.Bits.D3
#define IIC0_IBDR_D4 _IIC0_IBDR.Bits.D4
#define IIC0_IBDR_D5 _IIC0_IBDR.Bits.D5
#define IIC0_IBDR_D6 _IIC0_IBDR.Bits.D6
#define IIC0_IBDR_D7 _IIC0_IBDR.Bits.D7
#define IIC0_IBDR_D _IIC0_IBDR.MergedBits.grpD

#define IIC0_IBDR_D0_MASK   1
#define IIC0_IBDR_D1_MASK   2
#define IIC0_IBDR_D2_MASK   4
#define IIC0_IBDR_D3_MASK   8
#define IIC0_IBDR_D4_MASK   16
#define IIC0_IBDR_D5_MASK   32
#define IIC0_IBDR_D6_MASK   64
#define IIC0_IBDR_D7_MASK   128
#define IIC0_IBDR_D_MASK  255
#define IIC0_IBDR_D_BITNUM  0


