frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
#define INT_CFDATA7_PRIOLVL_MASK   7
#define INT_CFDATA7_PRIOLVL_BITNUM 0
#define INT_CFDATA7_RQST_MASK   128


/*** SCI4ASR1 - SCI 4 Alternative Status Register 1; 0x00000130 ***/
typedef union {
  byte Byte;
  union { /*Several registers at the same address */
    /*** SCI4ASR1 - SCI 4 Alternative Status Register 1; Several registers at the same address ***/
    union {
      struct {
        byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
        byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
        byte BERRV       :1;                                       /* Bit Error Value */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
      } Bits;
    } SCI4ASR1STR;
    #define SCI4ASR1 _SCI4ASR1.Byte
    #define SCI4ASR1_BKDIF _SCI4ASR1.SameAddr_STR.SCI4ASR1STR.Bits.BKDIF
    #define SCI4ASR1_BERRIF _SCI4ASR1.SameAddr_STR.SCI4ASR1STR.Bits.BERRIF
    #define SCI4ASR1_BERRV _SCI4ASR1.SameAddr_STR.SCI4ASR1STR.Bits.BERRV
    #define SCI4ASR1_RXEDGIF _SCI4ASR1.SameAddr_STR.SCI4ASR1STR.Bits.RXEDGIF
    
    
    #define SCI4ASR1_BKDIF_MASK   1
    #define SCI4ASR1_BERRIF_MASK   2
    #define SCI4ASR1_BERRV_MASK   4
    #define SCI4ASR1_RXEDGIF_MASK   128

    /*** SCI4BDH - SCI 4 Baud Rate Register High; Several registers at the same address ***/
    union {
      struct {
        byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
        byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
        byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
        byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
        byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
        byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
        byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
        byte IREN        :1;                                       /* Infrared Enable Bit */
      } Bits;
      struct {
        byte grpSBR_8 :5;
        byte grpTNP :2;
        byte     :1;
      } MergedBits;
    } SCI4BDHSTR;
    #define SCI4BDH _SCI4ASR1.Byte
    #define SCI4BDH_SBR8 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.SBR8
    #define SCI4BDH_SBR9 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.SBR9
    #define SCI4BDH_SBR10 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.SBR10
    #define SCI4BDH_SBR11 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.SBR11
    #define SCI4BDH_SBR12 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.SBR12
    #define SCI4BDH_TNP0 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.TNP0
    #define SCI4BDH_TNP1 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.TNP1
    #define SCI4BDH_IREN _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.Bits.IREN
    
    #define SCI4BDH_SBR_8 _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.MergedBits.grpSBR_8
    #define SCI4BDH_TNP _SCI4ASR1.SameAddr_STR.SCI4BDHSTR.MergedBits.grpTNP
    #define SCI4BDH_SBR SCI4BDH_SBR_8
    
    #define SCI4BDH_SBR8_MASK   1
    #define SCI4BDH_SBR9_MASK   2
    #define SCI4BDH_SBR10_MASK   4
    #define SCI4BDH_SBR11_MASK   8
    #define SCI4BDH_SBR12_MASK   16
    #define SCI4BDH_TNP0_MASK   32
    #define SCI4BDH_TNP1_MASK   64
    #define SCI4BDH_IREN_MASK   128
    #define SCI4BDH_SBR_8_MASK  31
    #define SCI4BDH_SBR_8_BITNUM  0
    #define SCI4BDH_TNP_MASK  96
    #define SCI4BDH_TNP_BITNUM  5

  } SameAddr_STR; /*Several registers at the same address */

} SCI4ASR1STR;
extern volatile SCI4ASR1STR _SCI4ASR1 @(REG_BASE + 0x00000130);



/*** SCI4BD - SCI 4 Baud Rate Register; 0x00000131 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI4ACR1 - SCI 4 Alternative Control Register 1; 0x00000131 ***/
    union {
      byte Byte;
      union { /*Several registers at the same address */
        /*** SCI4ACR1 - SCI 4 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI4ACR1STR;
        #define SCI4ACR1 _SCI4BD.Overlap_STR.SCI4ACR1STR.Byte
        #define SCI4ACR1_BKDIE _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4ACR1STR.Bits.BKDIE
        #define SCI4ACR1_BERRIE _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4ACR1STR.Bits.BERRIE
        #define SCI4ACR1_RXEDGIE _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4ACR1STR.Bits.RXEDGIE
        
        
        #define SCI4ACR1_BKDIE_MASK   1
        #define SCI4ACR1_BERRIE_MASK   2
        #define SCI4ACR1_RXEDGIE_MASK   128
    
        /*** SCI4BDL - SCI 4 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
          struct {
            byte grpSBR :8;
          } MergedBits;
        } SCI4BDLSTR;
        #define SCI4BDL _SCI4BD.Overlap_STR.SCI4ACR1STR.Byte
        #define SCI4BDL_SBR0 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR0
        #define SCI4BDL_SBR1 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR1
        #define SCI4BDL_SBR2 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR2
        #define SCI4BDL_SBR3 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR3
        #define SCI4BDL_SBR4 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR4
        #define SCI4BDL_SBR5 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR5
        #define SCI4BDL_SBR6 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR6
        #define SCI4BDL_SBR7 _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.Bits.SBR7
        
        #define SCI4BDL_SBR _SCI4BD.Overlap_STR.SCI4ACR1STR.SameAddr_STR.SCI4BDLSTR.MergedBits.grpSBR
        
        #define SCI4BDL_SBR0_MASK   1
        #define SCI4BDL_SBR1_MASK   2
        #define SCI4BDL_SBR2_MASK   4
        #define SCI4BDL_SBR3_MASK   8
        #define SCI4BDL_SBR4_MASK   16
        #define SCI4BDL_SBR5_MASK   32
        #define SCI4BDL_SBR6_MASK   64
        #define SCI4BDL_SBR7_MASK   128
        #define SCI4BDL_SBR_MASK  255
        #define SCI4BDL_SBR_BITNUM  0
    
