frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
#define CAN0RFLG_RXF_MASK   1
#define CAN0RFLG_OVRIF_MASK   2
#define CAN0RFLG_TSTAT0_MASK   4
#define CAN0RFLG_TSTAT1_MASK   8
#define CAN0RFLG_RSTAT0_MASK   16
#define CAN0RFLG_RSTAT1_MASK   32
#define CAN0RFLG_CSCIF_MASK   64
#define CAN0RFLG_WUPIF_MASK   128
#define CAN0RFLG_TSTAT_MASK  12
#define CAN0RFLG_TSTAT_BITNUM  2
#define CAN0RFLG_RSTAT_MASK  48
#define CAN0RFLG_RSTAT_BITNUM  4


/*** CAN0RIER - MSCAN 0 Receiver Interrupt Enable Register; 0x00000145 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0RIERSTR;
extern volatile CAN0RIERSTR _CAN0RIER @(REG_BASE + 0x00000145);
#define CAN0RIER _CAN0RIER.Byte
#define CAN0RIER_RXFIE _CAN0RIER.Bits.RXFIE
#define CAN0RIER_OVRIE _CAN0RIER.Bits.OVRIE
#define CAN0RIER_TSTATE0 _CAN0RIER.Bits.TSTATE0
#define CAN0RIER_TSTATE1 _CAN0RIER.Bits.TSTATE1
#define CAN0RIER_RSTATE0 _CAN0RIER.Bits.RSTATE0
#define CAN0RIER_RSTATE1 _CAN0RIER.Bits.RSTATE1
#define CAN0RIER_CSCIE _CAN0RIER.Bits.CSCIE
#define CAN0RIER_WUPIE _CAN0RIER.Bits.WUPIE
#define CAN0RIER_TSTATE _CAN0RIER.MergedBits.grpTSTATE
#define CAN0RIER_RSTATE _CAN0RIER.MergedBits.grpRSTATE

#define CAN0RIER_RXFIE_MASK   1
#define CAN0RIER_OVRIE_MASK   2
#define CAN0RIER_TSTATE0_MASK   4
#define CAN0RIER_TSTATE1_MASK   8
#define CAN0RIER_RSTATE0_MASK   16
#define CAN0RIER_RSTATE1_MASK   32
#define CAN0RIER_CSCIE_MASK   64
#define CAN0RIER_WUPIE_MASK   128
#define CAN0RIER_TSTATE_MASK  12
#define CAN0RIER_TSTATE_BITNUM  2
#define CAN0RIER_RSTATE_MASK  48
#define CAN0RIER_RSTATE_BITNUM  4


/*** CAN0TFLG - MSCAN 0 Transmitter Flag Register; 0x00000146 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0TFLGSTR;
extern volatile CAN0TFLGSTR _CAN0TFLG @(REG_BASE + 0x00000146);
#define CAN0TFLG _CAN0TFLG.Byte
#define CAN0TFLG_TXE0 _CAN0TFLG.Bits.TXE0
#define CAN0TFLG_TXE1 _CAN0TFLG.Bits.TXE1
#define CAN0TFLG_TXE2 _CAN0TFLG.Bits.TXE2
#define CAN0TFLG_TXE _CAN0TFLG.MergedBits.grpTXE

#define CAN0TFLG_TXE0_MASK   1
#define CAN0TFLG_TXE1_MASK   2
#define CAN0TFLG_TXE2_MASK   4
#define CAN0TFLG_TXE_MASK  7
#define CAN0TFLG_TXE_BITNUM  0


/*** CAN0TIER - MSCAN 0 Transmitter Interrupt Enable Register; 0x00000147 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0TIERSTR;
extern volatile CAN0TIERSTR _CAN0TIER @(REG_BASE + 0x00000147);
#define CAN0TIER _CAN0TIER.Byte
#define CAN0TIER_TXEIE0 _CAN0TIER.Bits.TXEIE0
#define CAN0TIER_TXEIE1 _CAN0TIER.Bits.TXEIE1
#define CAN0TIER_TXEIE2 _CAN0TIER.Bits.TXEIE2
#define CAN0TIER_TXEIE _CAN0TIER.MergedBits.grpTXEIE

#define CAN0TIER_TXEIE0_MASK   1
#define CAN0TIER_TXEIE1_MASK   2
#define CAN0TIER_TXEIE2_MASK   4
#define CAN0TIER_TXEIE_MASK  7
#define CAN0TIER_TXEIE_BITNUM  0


/*** CAN0TARQ - MSCAN 0 Transmitter Message Abort Request; 0x00000148 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0TARQSTR;
extern volatile CAN0TARQSTR _CAN0TARQ @(REG_BASE + 0x00000148);
#define CAN0TARQ _CAN0TARQ.Byte
#define CAN0TARQ_ABTRQ0 _CAN0TARQ.Bits.ABTRQ0
#define CAN0TARQ_ABTRQ1 _CAN0TARQ.Bits.ABTRQ1
#define CAN0TARQ_ABTRQ2 _CAN0TARQ.Bits.ABTRQ2
#define CAN0TARQ_ABTRQ _CAN0TARQ.MergedBits.grpABTRQ

#define CAN0TARQ_ABTRQ0_MASK   1
#define CAN0TARQ_ABTRQ1_MASK   2
#define CAN0TARQ_ABTRQ2_MASK   4
#define CAN0TARQ_ABTRQ_MASK  7
#define CAN0TARQ_ABTRQ_BITNUM  0


/*** CAN0TAAK - MSCAN 0 Transmitter Message Abort Control; 0x00000149 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0TAAKSTR;
extern volatile CAN0TAAKSTR _CAN0TAAK @(REG_BASE + 0x00000149);
#define CAN0TAAK _CAN0TAAK.Byte
#define CAN0TAAK_ABTAK0 _CAN0TAAK.Bits.ABTAK0
#define CAN0TAAK_ABTAK1 _CAN0TAAK.Bits.ABTAK1
#define CAN0TAAK_ABTAK2 _CAN0TAAK.Bits.ABTAK2
#define CAN0TAAK_ABTAK _CAN0TAAK.MergedBits.grpABTAK

#define CAN0TAAK_ABTAK0_MASK   1
#define CAN0TAAK_ABTAK1_MASK   2
#define CAN0TAAK_ABTAK2_MASK   4
#define CAN0TAAK_ABTAK_MASK  7
#define CAN0TAAK_ABTAK_BITNUM  0


/*** CAN0TBSEL - MSCAN 0 Transmit Buffer Selection; 0x0000014A ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0TBSELSTR;
