frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile CAN0RXDSR5STR _CAN0RXDSR5 @(REG_BASE + 0x00000169);
#define CAN0RXDSR5 _CAN0RXDSR5.Byte
#define CAN0RXDSR5_DB0 _CAN0RXDSR5.Bits.DB0
#define CAN0RXDSR5_DB1 _CAN0RXDSR5.Bits.DB1
#define CAN0RXDSR5_DB2 _CAN0RXDSR5.Bits.DB2
#define CAN0RXDSR5_DB3 _CAN0RXDSR5.Bits.DB3
#define CAN0RXDSR5_DB4 _CAN0RXDSR5.Bits.DB4
#define CAN0RXDSR5_DB5 _CAN0RXDSR5.Bits.DB5
#define CAN0RXDSR5_DB6 _CAN0RXDSR5.Bits.DB6
#define CAN0RXDSR5_DB7 _CAN0RXDSR5.Bits.DB7
#define CAN0RXDSR5_DB _CAN0RXDSR5.MergedBits.grpDB

#define CAN0RXDSR5_DB0_MASK   1
#define CAN0RXDSR5_DB1_MASK   2
#define CAN0RXDSR5_DB2_MASK   4
#define CAN0RXDSR5_DB3_MASK   8
#define CAN0RXDSR5_DB4_MASK   16
#define CAN0RXDSR5_DB5_MASK   32
#define CAN0RXDSR5_DB6_MASK   64
#define CAN0RXDSR5_DB7_MASK   128
#define CAN0RXDSR5_DB_MASK  255
#define CAN0RXDSR5_DB_BITNUM  0


/*** CAN0RXDSR6 - MSCAN 0 Receive Data Segment Register 6; 0x0000016A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR6STR;
extern volatile CAN0RXDSR6STR _CAN0RXDSR6 @(REG_BASE + 0x0000016A);
#define CAN0RXDSR6 _CAN0RXDSR6.Byte
#define CAN0RXDSR6_DB0 _CAN0RXDSR6.Bits.DB0
#define CAN0RXDSR6_DB1 _CAN0RXDSR6.Bits.DB1
#define CAN0RXDSR6_DB2 _CAN0RXDSR6.Bits.DB2
#define CAN0RXDSR6_DB3 _CAN0RXDSR6.Bits.DB3
#define CAN0RXDSR6_DB4 _CAN0RXDSR6.Bits.DB4
#define CAN0RXDSR6_DB5 _CAN0RXDSR6.Bits.DB5
#define CAN0RXDSR6_DB6 _CAN0RXDSR6.Bits.DB6
#define CAN0RXDSR6_DB7 _CAN0RXDSR6.Bits.DB7
#define CAN0RXDSR6_DB _CAN0RXDSR6.MergedBits.grpDB

#define CAN0RXDSR6_DB0_MASK   1
#define CAN0RXDSR6_DB1_MASK   2
#define CAN0RXDSR6_DB2_MASK   4
#define CAN0RXDSR6_DB3_MASK   8
#define CAN0RXDSR6_DB4_MASK   16
#define CAN0RXDSR6_DB5_MASK   32
#define CAN0RXDSR6_DB6_MASK   64
#define CAN0RXDSR6_DB7_MASK   128
#define CAN0RXDSR6_DB_MASK  255
#define CAN0RXDSR6_DB_BITNUM  0


/*** CAN0RXDSR7 - MSCAN 0 Receive Data Segment Register 7; 0x0000016B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN0RXDSR7STR;
extern volatile CAN0RXDSR7STR _CAN0RXDSR7 @(REG_BASE + 0x0000016B);
#define CAN0RXDSR7 _CAN0RXDSR7.Byte
#define CAN0RXDSR7_DB0 _CAN0RXDSR7.Bits.DB0
#define CAN0RXDSR7_DB1 _CAN0RXDSR7.Bits.DB1
#define CAN0RXDSR7_DB2 _CAN0RXDSR7.Bits.DB2
#define CAN0RXDSR7_DB3 _CAN0RXDSR7.Bits.DB3
#define CAN0RXDSR7_DB4 _CAN0RXDSR7.Bits.DB4
#define CAN0RXDSR7_DB5 _CAN0RXDSR7.Bits.DB5
#define CAN0RXDSR7_DB6 _CAN0RXDSR7.Bits.DB6
#define CAN0RXDSR7_DB7 _CAN0RXDSR7.Bits.DB7
#define CAN0RXDSR7_DB _CAN0RXDSR7.MergedBits.grpDB

#define CAN0RXDSR7_DB0_MASK   1
#define CAN0RXDSR7_DB1_MASK   2
#define CAN0RXDSR7_DB2_MASK   4
#define CAN0RXDSR7_DB3_MASK   8
#define CAN0RXDSR7_DB4_MASK   16
#define CAN0RXDSR7_DB5_MASK   32
#define CAN0RXDSR7_DB6_MASK   64
#define CAN0RXDSR7_DB7_MASK   128
#define CAN0RXDSR7_DB_MASK  255
#define CAN0RXDSR7_DB_BITNUM  0


/*** CAN0RXDLR - MSCAN 0 Receive Data Length Register; 0x0000016C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN0RXDLRSTR;
extern volatile CAN0RXDLRSTR _CAN0RXDLR @(REG_BASE + 0x0000016C);
#define CAN0RXDLR _CAN0RXDLR.Byte
#define CAN0RXDLR_DLC0 _CAN0RXDLR.Bits.DLC0
#define CAN0RXDLR_DLC1 _CAN0RXDLR.Bits.DLC1
#define CAN0RXDLR_DLC2 _CAN0RXDLR.Bits.DLC2
#define CAN0RXDLR_DLC3 _CAN0RXDLR.Bits.DLC3
#define CAN0RXDLR_DLC _CAN0RXDLR.MergedBits.grpDLC

#define CAN0RXDLR_DLC0_MASK   1
#define CAN0RXDLR_DLC1_MASK   2
#define CAN0RXDLR_DLC2_MASK   4
#define CAN0RXDLR_DLC3_MASK   8
#define CAN0RXDLR_DLC_MASK  15
#define CAN0RXDLR_DLC_BITNUM  0


/*** CAN0RXTSR - MSCAN 0 Receive Time Stamp Register; 0x0000016E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN0RXTSRH - MSCAN 0 Receive Time Stamp Register High; 0x0000016E ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN0RXTSRHSTR;
    #define CAN0RXTSRH _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Byte
    #define CAN0RXTSRH_TSR8 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR8
    #define CAN0RXTSRH_TSR9 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR9
    #define CAN0RXTSRH_TSR10 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR10
    #define CAN0RXTSRH_TSR11 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR11
    #define CAN0RXTSRH_TSR12 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR12
    #define CAN0RXTSRH_TSR13 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR13
    #define CAN0RXTSRH_TSR14 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR14
    #define CAN0RXTSRH_TSR15 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.Bits.TSR15
    
    #define CAN0RXTSRH_TSR_8 _CAN0RXTSR.Overlap_STR.CAN0RXTSRHSTR.MergedBits.grpTSR_8
    #define CAN0RXTSRH_TSR CAN0RXTSRH_TSR_8
    
    #define CAN0RXTSRH_TSR8_MASK   1
    #define CAN0RXTSRH_TSR9_MASK   2
    #define CAN0RXTSRH_TSR10_MASK   4
    #define CAN0RXTSRH_TSR11_MASK   8
    #define CAN0RXTSRH_TSR12_MASK   16
    #define CAN0RXTSRH_TSR13_MASK   32
    #define CAN0RXTSRH_TSR14_MASK   64
    #define CAN0RXTSRH_TSR15_MASK   128
    #define CAN0RXTSRH_TSR_8_MASK  255
    #define CAN0RXTSRH_TSR_8_BITNUM  0


