frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile CAN1BTR1STR _CAN1BTR1 @(REG_BASE + 0x00000183);
#define CAN1BTR1 _CAN1BTR1.Byte
#define CAN1BTR1_TSEG10 _CAN1BTR1.Bits.TSEG10
#define CAN1BTR1_TSEG11 _CAN1BTR1.Bits.TSEG11
#define CAN1BTR1_TSEG12 _CAN1BTR1.Bits.TSEG12
#define CAN1BTR1_TSEG13 _CAN1BTR1.Bits.TSEG13
#define CAN1BTR1_TSEG20 _CAN1BTR1.Bits.TSEG20
#define CAN1BTR1_TSEG21 _CAN1BTR1.Bits.TSEG21
#define CAN1BTR1_TSEG22 _CAN1BTR1.Bits.TSEG22
#define CAN1BTR1_SAMP _CAN1BTR1.Bits.SAMP
#define CAN1BTR1_TSEG_10 _CAN1BTR1.MergedBits.grpTSEG_10
#define CAN1BTR1_TSEG_20 _CAN1BTR1.MergedBits.grpTSEG_20
#define CAN1BTR1_TSEG CAN1BTR1_TSEG_10

#define CAN1BTR1_TSEG10_MASK   1
#define CAN1BTR1_TSEG11_MASK   2
#define CAN1BTR1_TSEG12_MASK   4
#define CAN1BTR1_TSEG13_MASK   8
#define CAN1BTR1_TSEG20_MASK   16
#define CAN1BTR1_TSEG21_MASK   32
#define CAN1BTR1_TSEG22_MASK   64
#define CAN1BTR1_SAMP_MASK   128
#define CAN1BTR1_TSEG_10_MASK  15
#define CAN1BTR1_TSEG_10_BITNUM  0
#define CAN1BTR1_TSEG_20_MASK  112
#define CAN1BTR1_TSEG_20_BITNUM  4


/*** CAN1RFLG - MSCAN 1 Receiver Flag Register; 0x00000184 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1RFLGSTR;
extern volatile CAN1RFLGSTR _CAN1RFLG @(REG_BASE + 0x00000184);
#define CAN1RFLG _CAN1RFLG.Byte
#define CAN1RFLG_RXF _CAN1RFLG.Bits.RXF
#define CAN1RFLG_OVRIF _CAN1RFLG.Bits.OVRIF
#define CAN1RFLG_TSTAT0 _CAN1RFLG.Bits.TSTAT0
#define CAN1RFLG_TSTAT1 _CAN1RFLG.Bits.TSTAT1
#define CAN1RFLG_RSTAT0 _CAN1RFLG.Bits.RSTAT0
#define CAN1RFLG_RSTAT1 _CAN1RFLG.Bits.RSTAT1
#define CAN1RFLG_CSCIF _CAN1RFLG.Bits.CSCIF
#define CAN1RFLG_WUPIF _CAN1RFLG.Bits.WUPIF
#define CAN1RFLG_TSTAT _CAN1RFLG.MergedBits.grpTSTAT
#define CAN1RFLG_RSTAT _CAN1RFLG.MergedBits.grpRSTAT

#define CAN1RFLG_RXF_MASK   1
#define CAN1RFLG_OVRIF_MASK   2
#define CAN1RFLG_TSTAT0_MASK   4
#define CAN1RFLG_TSTAT1_MASK   8
#define CAN1RFLG_RSTAT0_MASK   16
#define CAN1RFLG_RSTAT1_MASK   32
#define CAN1RFLG_CSCIF_MASK   64
#define CAN1RFLG_WUPIF_MASK   128
#define CAN1RFLG_TSTAT_MASK  12
#define CAN1RFLG_TSTAT_BITNUM  2
#define CAN1RFLG_RSTAT_MASK  48
#define CAN1RFLG_RSTAT_BITNUM  4


/*** CAN1RIER - MSCAN 1 Receiver Interrupt Enable Register; 0x00000185 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1RIERSTR;
extern volatile CAN1RIERSTR _CAN1RIER @(REG_BASE + 0x00000185);
#define CAN1RIER _CAN1RIER.Byte
#define CAN1RIER_RXFIE _CAN1RIER.Bits.RXFIE
#define CAN1RIER_OVRIE _CAN1RIER.Bits.OVRIE
#define CAN1RIER_TSTATE0 _CAN1RIER.Bits.TSTATE0
#define CAN1RIER_TSTATE1 _CAN1RIER.Bits.TSTATE1
#define CAN1RIER_RSTATE0 _CAN1RIER.Bits.RSTATE0
#define CAN1RIER_RSTATE1 _CAN1RIER.Bits.RSTATE1
#define CAN1RIER_CSCIE _CAN1RIER.Bits.CSCIE
#define CAN1RIER_WUPIE _CAN1RIER.Bits.WUPIE
#define CAN1RIER_TSTATE _CAN1RIER.MergedBits.grpTSTATE
#define CAN1RIER_RSTATE _CAN1RIER.MergedBits.grpRSTATE

#define CAN1RIER_RXFIE_MASK   1
#define CAN1RIER_OVRIE_MASK   2
#define CAN1RIER_TSTATE0_MASK   4
#define CAN1RIER_TSTATE1_MASK   8
#define CAN1RIER_RSTATE0_MASK   16
#define CAN1RIER_RSTATE1_MASK   32
#define CAN1RIER_CSCIE_MASK   64
#define CAN1RIER_WUPIE_MASK   128
#define CAN1RIER_TSTATE_MASK  12
#define CAN1RIER_TSTATE_BITNUM  2
#define CAN1RIER_RSTATE_MASK  48
#define CAN1RIER_RSTATE_BITNUM  4


/*** CAN1TFLG - MSCAN 1 Transmitter Flag Register; 0x00000186 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1TFLGSTR;
extern volatile CAN1TFLGSTR _CAN1TFLG @(REG_BASE + 0x00000186);
#define CAN1TFLG _CAN1TFLG.Byte
#define CAN1TFLG_TXE0 _CAN1TFLG.Bits.TXE0
#define CAN1TFLG_TXE1 _CAN1TFLG.Bits.TXE1
#define CAN1TFLG_TXE2 _CAN1TFLG.Bits.TXE2
#define CAN1TFLG_TXE _CAN1TFLG.MergedBits.grpTXE

#define CAN1TFLG_TXE0_MASK   1
#define CAN1TFLG_TXE1_MASK   2
#define CAN1TFLG_TXE2_MASK   4
#define CAN1TFLG_TXE_MASK  7
#define CAN1TFLG_TXE_BITNUM  0


/*** CAN1TIER - MSCAN 1 Transmitter Interrupt Enable Register; 0x00000187 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1TIERSTR;
extern volatile CAN1TIERSTR _CAN1TIER @(REG_BASE + 0x00000187);
#define CAN1TIER _CAN1TIER.Byte
#define CAN1TIER_TXEIE0 _CAN1TIER.Bits.TXEIE0
#define CAN1TIER_TXEIE1 _CAN1TIER.Bits.TXEIE1
#define CAN1TIER_TXEIE2 _CAN1TIER.Bits.TXEIE2
#define CAN1TIER_TXEIE _CAN1TIER.MergedBits.grpTXEIE

