frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
#define CAN1IDAR6_AC0_MASK   1
#define CAN1IDAR6_AC1_MASK   2
#define CAN1IDAR6_AC2_MASK   4
#define CAN1IDAR6_AC3_MASK   8
#define CAN1IDAR6_AC4_MASK   16
#define CAN1IDAR6_AC5_MASK   32
#define CAN1IDAR6_AC6_MASK   64
#define CAN1IDAR6_AC7_MASK   128
#define CAN1IDAR6_AC_MASK  255
#define CAN1IDAR6_AC_BITNUM  0


/*** CAN1IDAR7 - MSCAN 1 Identifier Acceptance Register 7; 0x0000019B ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
  struct {
    byte grpAC   :8;
  } MergedBits;
} CAN1IDAR7STR;
extern volatile CAN1IDAR7STR _CAN1IDAR7 @(REG_BASE + 0x0000019B);
#define CAN1IDAR7 _CAN1IDAR7.Byte
#define CAN1IDAR7_AC0 _CAN1IDAR7.Bits.AC0
#define CAN1IDAR7_AC1 _CAN1IDAR7.Bits.AC1
#define CAN1IDAR7_AC2 _CAN1IDAR7.Bits.AC2
#define CAN1IDAR7_AC3 _CAN1IDAR7.Bits.AC3
#define CAN1IDAR7_AC4 _CAN1IDAR7.Bits.AC4
#define CAN1IDAR7_AC5 _CAN1IDAR7.Bits.AC5
#define CAN1IDAR7_AC6 _CAN1IDAR7.Bits.AC6
#define CAN1IDAR7_AC7 _CAN1IDAR7.Bits.AC7
#define CAN1IDAR7_AC _CAN1IDAR7.MergedBits.grpAC

#define CAN1IDAR7_AC0_MASK   1
#define CAN1IDAR7_AC1_MASK   2
#define CAN1IDAR7_AC2_MASK   4
#define CAN1IDAR7_AC3_MASK   8
#define CAN1IDAR7_AC4_MASK   16
#define CAN1IDAR7_AC5_MASK   32
#define CAN1IDAR7_AC6_MASK   64
#define CAN1IDAR7_AC7_MASK   128
#define CAN1IDAR7_AC_MASK  255
#define CAN1IDAR7_AC_BITNUM  0


/*** CAN1IDMR4 - MSCAN 1 Identifier Mask Register 4; 0x0000019C ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR4STR;
extern volatile CAN1IDMR4STR _CAN1IDMR4 @(REG_BASE + 0x0000019C);
#define CAN1IDMR4 _CAN1IDMR4.Byte
#define CAN1IDMR4_AM0 _CAN1IDMR4.Bits.AM0
#define CAN1IDMR4_AM1 _CAN1IDMR4.Bits.AM1
#define CAN1IDMR4_AM2 _CAN1IDMR4.Bits.AM2
#define CAN1IDMR4_AM3 _CAN1IDMR4.Bits.AM3
#define CAN1IDMR4_AM4 _CAN1IDMR4.Bits.AM4
#define CAN1IDMR4_AM5 _CAN1IDMR4.Bits.AM5
#define CAN1IDMR4_AM6 _CAN1IDMR4.Bits.AM6
#define CAN1IDMR4_AM7 _CAN1IDMR4.Bits.AM7
#define CAN1IDMR4_AM _CAN1IDMR4.MergedBits.grpAM

#define CAN1IDMR4_AM0_MASK   1
#define CAN1IDMR4_AM1_MASK   2
#define CAN1IDMR4_AM2_MASK   4
#define CAN1IDMR4_AM3_MASK   8
#define CAN1IDMR4_AM4_MASK   16
#define CAN1IDMR4_AM5_MASK   32
#define CAN1IDMR4_AM6_MASK   64
#define CAN1IDMR4_AM7_MASK   128
#define CAN1IDMR4_AM_MASK  255
#define CAN1IDMR4_AM_BITNUM  0


/*** CAN1IDMR5 - MSCAN 1 Identifier Mask Register 5; 0x0000019D ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR5STR;
extern volatile CAN1IDMR5STR _CAN1IDMR5 @(REG_BASE + 0x0000019D);
#define CAN1IDMR5 _CAN1IDMR5.Byte
#define CAN1IDMR5_AM0 _CAN1IDMR5.Bits.AM0
#define CAN1IDMR5_AM1 _CAN1IDMR5.Bits.AM1
#define CAN1IDMR5_AM2 _CAN1IDMR5.Bits.AM2
#define CAN1IDMR5_AM3 _CAN1IDMR5.Bits.AM3
#define CAN1IDMR5_AM4 _CAN1IDMR5.Bits.AM4
#define CAN1IDMR5_AM5 _CAN1IDMR5.Bits.AM5
#define CAN1IDMR5_AM6 _CAN1IDMR5.Bits.AM6
#define CAN1IDMR5_AM7 _CAN1IDMR5.Bits.AM7
#define CAN1IDMR5_AM _CAN1IDMR5.MergedBits.grpAM

#define CAN1IDMR5_AM0_MASK   1
#define CAN1IDMR5_AM1_MASK   2
#define CAN1IDMR5_AM2_MASK   4
#define CAN1IDMR5_AM3_MASK   8
#define CAN1IDMR5_AM4_MASK   16
#define CAN1IDMR5_AM5_MASK   32
#define CAN1IDMR5_AM6_MASK   64
#define CAN1IDMR5_AM7_MASK   128
#define CAN1IDMR5_AM_MASK  255
#define CAN1IDMR5_AM_BITNUM  0


/*** CAN1IDMR6 - MSCAN 1 Identifier Mask Register 6; 0x0000019E ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR6STR;
extern volatile CAN1IDMR6STR _CAN1IDMR6 @(REG_BASE + 0x0000019E);
#define CAN1IDMR6 _CAN1IDMR6.Byte
#define CAN1IDMR6_AM0 _CAN1IDMR6.Bits.AM0
#define CAN1IDMR6_AM1 _CAN1IDMR6.Bits.AM1
#define CAN1IDMR6_AM2 _CAN1IDMR6.Bits.AM2
#define CAN1IDMR6_AM3 _CAN1IDMR6.Bits.AM3
#define CAN1IDMR6_AM4 _CAN1IDMR6.Bits.AM4
#define CAN1IDMR6_AM5 _CAN1IDMR6.Bits.AM5
#define CAN1IDMR6_AM6 _CAN1IDMR6.Bits.AM6
#define CAN1IDMR6_AM7 _CAN1IDMR6.Bits.AM7
#define CAN1IDMR6_AM _CAN1IDMR6.MergedBits.grpAM

#define CAN1IDMR6_AM0_MASK   1
#define CAN1IDMR6_AM1_MASK   2
#define CAN1IDMR6_AM2_MASK   4
#define CAN1IDMR6_AM3_MASK   8
#define CAN1IDMR6_AM4_MASK   16
#define CAN1IDMR6_AM5_MASK   32
#define CAN1IDMR6_AM6_MASK   64
#define CAN1IDMR6_AM7_MASK   128
#define CAN1IDMR6_AM_MASK  255
#define CAN1IDMR6_AM_BITNUM  0


/*** CAN1IDMR7 - MSCAN 1 Identifier Mask Register 7; 0x0000019F ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
  struct {
    byte grpAM   :8;
  } MergedBits;
} CAN1IDMR7STR;
extern volatile CAN1IDMR7STR _CAN1IDMR7 @(REG_BASE + 0x0000019F);
#define CAN1IDMR7 _CAN1IDMR7.Byte
#define CAN1IDMR7_AM0 _CAN1IDMR7.Bits.AM0
#define CAN1IDMR7_AM1 _CAN1IDMR7.Bits.AM1
#define CAN1IDMR7_AM2 _CAN1IDMR7.Bits.AM2
#define CAN1IDMR7_AM3 _CAN1IDMR7.Bits.AM3
#define CAN1IDMR7_AM4 _CAN1IDMR7.Bits.AM4
#define CAN1IDMR7_AM5 _CAN1IDMR7.Bits.AM5
#define CAN1IDMR7_AM6 _CAN1IDMR7.Bits.AM6
#define CAN1IDMR7_AM7 _CAN1IDMR7.Bits.AM7
#define CAN1IDMR7_AM _CAN1IDMR7.MergedBits.grpAM

