frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
#define CAN1RXIDR3_RTR_MASK   1
#define CAN1RXIDR3_ID0_MASK   2
#define CAN1RXIDR3_ID1_MASK   4
#define CAN1RXIDR3_ID2_MASK   8
#define CAN1RXIDR3_ID3_MASK   16
#define CAN1RXIDR3_ID4_MASK   32
#define CAN1RXIDR3_ID5_MASK   64
#define CAN1RXIDR3_ID6_MASK   128
#define CAN1RXIDR3_ID_MASK  254
#define CAN1RXIDR3_ID_BITNUM  1


/*** CAN1RXDSR0 - MSCAN 1 Receive Data Segment Register 0; 0x000001A4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR0STR;
extern volatile CAN1RXDSR0STR _CAN1RXDSR0 @(REG_BASE + 0x000001A4);
#define CAN1RXDSR0 _CAN1RXDSR0.Byte
#define CAN1RXDSR0_DB0 _CAN1RXDSR0.Bits.DB0
#define CAN1RXDSR0_DB1 _CAN1RXDSR0.Bits.DB1
#define CAN1RXDSR0_DB2 _CAN1RXDSR0.Bits.DB2
#define CAN1RXDSR0_DB3 _CAN1RXDSR0.Bits.DB3
#define CAN1RXDSR0_DB4 _CAN1RXDSR0.Bits.DB4
#define CAN1RXDSR0_DB5 _CAN1RXDSR0.Bits.DB5
#define CAN1RXDSR0_DB6 _CAN1RXDSR0.Bits.DB6
#define CAN1RXDSR0_DB7 _CAN1RXDSR0.Bits.DB7
/* CAN1RXDSR_ARR: Access 8 CAN1RXDSRx registers in a array */
#define CAN1RXDSR_ARR ((Byte *) &CAN1RXDSR0)
#define CAN1RXDSR0_DB _CAN1RXDSR0.MergedBits.grpDB

#define CAN1RXDSR0_DB0_MASK   1
#define CAN1RXDSR0_DB1_MASK   2
#define CAN1RXDSR0_DB2_MASK   4
#define CAN1RXDSR0_DB3_MASK   8
#define CAN1RXDSR0_DB4_MASK   16
#define CAN1RXDSR0_DB5_MASK   32
#define CAN1RXDSR0_DB6_MASK   64
#define CAN1RXDSR0_DB7_MASK   128
#define CAN1RXDSR0_DB_MASK  255
#define CAN1RXDSR0_DB_BITNUM  0


/*** CAN1RXDSR1 - MSCAN 1 Receive Data Segment Register 1; 0x000001A5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR1STR;
extern volatile CAN1RXDSR1STR _CAN1RXDSR1 @(REG_BASE + 0x000001A5);
#define CAN1RXDSR1 _CAN1RXDSR1.Byte
#define CAN1RXDSR1_DB0 _CAN1RXDSR1.Bits.DB0
#define CAN1RXDSR1_DB1 _CAN1RXDSR1.Bits.DB1
#define CAN1RXDSR1_DB2 _CAN1RXDSR1.Bits.DB2
#define CAN1RXDSR1_DB3 _CAN1RXDSR1.Bits.DB3
#define CAN1RXDSR1_DB4 _CAN1RXDSR1.Bits.DB4
#define CAN1RXDSR1_DB5 _CAN1RXDSR1.Bits.DB5
#define CAN1RXDSR1_DB6 _CAN1RXDSR1.Bits.DB6
#define CAN1RXDSR1_DB7 _CAN1RXDSR1.Bits.DB7
#define CAN1RXDSR1_DB _CAN1RXDSR1.MergedBits.grpDB

#define CAN1RXDSR1_DB0_MASK   1
#define CAN1RXDSR1_DB1_MASK   2
#define CAN1RXDSR1_DB2_MASK   4
#define CAN1RXDSR1_DB3_MASK   8
#define CAN1RXDSR1_DB4_MASK   16
#define CAN1RXDSR1_DB5_MASK   32
#define CAN1RXDSR1_DB6_MASK   64
#define CAN1RXDSR1_DB7_MASK   128
#define CAN1RXDSR1_DB_MASK  255
#define CAN1RXDSR1_DB_BITNUM  0


/*** CAN1RXDSR2 - MSCAN 1 Receive Data Segment Register 2; 0x000001A6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR2STR;
extern volatile CAN1RXDSR2STR _CAN1RXDSR2 @(REG_BASE + 0x000001A6);
#define CAN1RXDSR2 _CAN1RXDSR2.Byte
#define CAN1RXDSR2_DB0 _CAN1RXDSR2.Bits.DB0
#define CAN1RXDSR2_DB1 _CAN1RXDSR2.Bits.DB1
#define CAN1RXDSR2_DB2 _CAN1RXDSR2.Bits.DB2
#define CAN1RXDSR2_DB3 _CAN1RXDSR2.Bits.DB3
#define CAN1RXDSR2_DB4 _CAN1RXDSR2.Bits.DB4
#define CAN1RXDSR2_DB5 _CAN1RXDSR2.Bits.DB5
#define CAN1RXDSR2_DB6 _CAN1RXDSR2.Bits.DB6
#define CAN1RXDSR2_DB7 _CAN1RXDSR2.Bits.DB7
#define CAN1RXDSR2_DB _CAN1RXDSR2.MergedBits.grpDB

#define CAN1RXDSR2_DB0_MASK   1
#define CAN1RXDSR2_DB1_MASK   2
#define CAN1RXDSR2_DB2_MASK   4
#define CAN1RXDSR2_DB3_MASK   8
#define CAN1RXDSR2_DB4_MASK   16
#define CAN1RXDSR2_DB5_MASK   32
#define CAN1RXDSR2_DB6_MASK   64
#define CAN1RXDSR2_DB7_MASK   128
#define CAN1RXDSR2_DB_MASK  255
#define CAN1RXDSR2_DB_BITNUM  0


/*** CAN1RXDSR3 - MSCAN 1 Receive Data Segment Register 3; 0x000001A7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1RXDSR3STR;
extern volatile CAN1RXDSR3STR _CAN1RXDSR3 @(REG_BASE + 0x000001A7);
#define CAN1RXDSR3 _CAN1RXDSR3.Byte
#define CAN1RXDSR3_DB0 _CAN1RXDSR3.Bits.DB0
#define CAN1RXDSR3_DB1 _CAN1RXDSR3.Bits.DB1
#define CAN1RXDSR3_DB2 _CAN1RXDSR3.Bits.DB2
#define CAN1RXDSR3_DB3 _CAN1RXDSR3.Bits.DB3
#define CAN1RXDSR3_DB4 _CAN1RXDSR3.Bits.DB4
#define CAN1RXDSR3_DB5 _CAN1RXDSR3.Bits.DB5
#define CAN1RXDSR3_DB6 _CAN1RXDSR3.Bits.DB6
#define CAN1RXDSR3_DB7 _CAN1RXDSR3.Bits.DB7
#define CAN1RXDSR3_DB _CAN1RXDSR3.MergedBits.grpDB

