frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
/*** CAN1TXDSR4 - MSCAN 1 Transmit Data Segment Register 4; 0x000001B8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1TXDSR4STR;
extern volatile CAN1TXDSR4STR _CAN1TXDSR4 @(REG_BASE + 0x000001B8);
#define CAN1TXDSR4 _CAN1TXDSR4.Byte
#define CAN1TXDSR4_DB0 _CAN1TXDSR4.Bits.DB0
#define CAN1TXDSR4_DB1 _CAN1TXDSR4.Bits.DB1
#define CAN1TXDSR4_DB2 _CAN1TXDSR4.Bits.DB2
#define CAN1TXDSR4_DB3 _CAN1TXDSR4.Bits.DB3
#define CAN1TXDSR4_DB4 _CAN1TXDSR4.Bits.DB4
#define CAN1TXDSR4_DB5 _CAN1TXDSR4.Bits.DB5
#define CAN1TXDSR4_DB6 _CAN1TXDSR4.Bits.DB6
#define CAN1TXDSR4_DB7 _CAN1TXDSR4.Bits.DB7
#define CAN1TXDSR4_DB _CAN1TXDSR4.MergedBits.grpDB

#define CAN1TXDSR4_DB0_MASK   1
#define CAN1TXDSR4_DB1_MASK   2
#define CAN1TXDSR4_DB2_MASK   4
#define CAN1TXDSR4_DB3_MASK   8
#define CAN1TXDSR4_DB4_MASK   16
#define CAN1TXDSR4_DB5_MASK   32
#define CAN1TXDSR4_DB6_MASK   64
#define CAN1TXDSR4_DB7_MASK   128
#define CAN1TXDSR4_DB_MASK  255
#define CAN1TXDSR4_DB_BITNUM  0


/*** CAN1TXDSR5 - MSCAN 1 Transmit Data Segment Register 5; 0x000001B9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1TXDSR5STR;
extern volatile CAN1TXDSR5STR _CAN1TXDSR5 @(REG_BASE + 0x000001B9);
#define CAN1TXDSR5 _CAN1TXDSR5.Byte
#define CAN1TXDSR5_DB0 _CAN1TXDSR5.Bits.DB0
#define CAN1TXDSR5_DB1 _CAN1TXDSR5.Bits.DB1
#define CAN1TXDSR5_DB2 _CAN1TXDSR5.Bits.DB2
#define CAN1TXDSR5_DB3 _CAN1TXDSR5.Bits.DB3
#define CAN1TXDSR5_DB4 _CAN1TXDSR5.Bits.DB4
#define CAN1TXDSR5_DB5 _CAN1TXDSR5.Bits.DB5
#define CAN1TXDSR5_DB6 _CAN1TXDSR5.Bits.DB6
#define CAN1TXDSR5_DB7 _CAN1TXDSR5.Bits.DB7
#define CAN1TXDSR5_DB _CAN1TXDSR5.MergedBits.grpDB

#define CAN1TXDSR5_DB0_MASK   1
#define CAN1TXDSR5_DB1_MASK   2
#define CAN1TXDSR5_DB2_MASK   4
#define CAN1TXDSR5_DB3_MASK   8
#define CAN1TXDSR5_DB4_MASK   16
#define CAN1TXDSR5_DB5_MASK   32
#define CAN1TXDSR5_DB6_MASK   64
#define CAN1TXDSR5_DB7_MASK   128
#define CAN1TXDSR5_DB_MASK  255
#define CAN1TXDSR5_DB_BITNUM  0


/*** CAN1TXDSR6 - MSCAN 1 Transmit Data Segment Register 6; 0x000001BA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1TXDSR6STR;
extern volatile CAN1TXDSR6STR _CAN1TXDSR6 @(REG_BASE + 0x000001BA);
#define CAN1TXDSR6 _CAN1TXDSR6.Byte
#define CAN1TXDSR6_DB0 _CAN1TXDSR6.Bits.DB0
#define CAN1TXDSR6_DB1 _CAN1TXDSR6.Bits.DB1
#define CAN1TXDSR6_DB2 _CAN1TXDSR6.Bits.DB2
#define CAN1TXDSR6_DB3 _CAN1TXDSR6.Bits.DB3
#define CAN1TXDSR6_DB4 _CAN1TXDSR6.Bits.DB4
#define CAN1TXDSR6_DB5 _CAN1TXDSR6.Bits.DB5
#define CAN1TXDSR6_DB6 _CAN1TXDSR6.Bits.DB6
#define CAN1TXDSR6_DB7 _CAN1TXDSR6.Bits.DB7
#define CAN1TXDSR6_DB _CAN1TXDSR6.MergedBits.grpDB

#define CAN1TXDSR6_DB0_MASK   1
#define CAN1TXDSR6_DB1_MASK   2
#define CAN1TXDSR6_DB2_MASK   4
#define CAN1TXDSR6_DB3_MASK   8
#define CAN1TXDSR6_DB4_MASK   16
#define CAN1TXDSR6_DB5_MASK   32
#define CAN1TXDSR6_DB6_MASK   64
#define CAN1TXDSR6_DB7_MASK   128
#define CAN1TXDSR6_DB_MASK  255
#define CAN1TXDSR6_DB_BITNUM  0


/*** CAN1TXDSR7 - MSCAN 1 Transmit Data Segment Register 7; 0x000001BB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN1TXDSR7STR;
extern volatile CAN1TXDSR7STR _CAN1TXDSR7 @(REG_BASE + 0x000001BB);
#define CAN1TXDSR7 _CAN1TXDSR7.Byte
#define CAN1TXDSR7_DB0 _CAN1TXDSR7.Bits.DB0
#define CAN1TXDSR7_DB1 _CAN1TXDSR7.Bits.DB1
#define CAN1TXDSR7_DB2 _CAN1TXDSR7.Bits.DB2
#define CAN1TXDSR7_DB3 _CAN1TXDSR7.Bits.DB3
#define CAN1TXDSR7_DB4 _CAN1TXDSR7.Bits.DB4
#define CAN1TXDSR7_DB5 _CAN1TXDSR7.Bits.DB5
#define CAN1TXDSR7_DB6 _CAN1TXDSR7.Bits.DB6
#define CAN1TXDSR7_DB7 _CAN1TXDSR7.Bits.DB7
#define CAN1TXDSR7_DB _CAN1TXDSR7.MergedBits.grpDB

