frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
#define CAN1TXDSR7_DB0_MASK   1
#define CAN1TXDSR7_DB1_MASK   2
#define CAN1TXDSR7_DB2_MASK   4
#define CAN1TXDSR7_DB3_MASK   8
#define CAN1TXDSR7_DB4_MASK   16
#define CAN1TXDSR7_DB5_MASK   32
#define CAN1TXDSR7_DB6_MASK   64
#define CAN1TXDSR7_DB7_MASK   128
#define CAN1TXDSR7_DB_MASK  255
#define CAN1TXDSR7_DB_BITNUM  0


/*** CAN1TXDLR - MSCAN 1 Transmit Data Length Register; 0x000001BC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN1TXDLRSTR;
extern volatile CAN1TXDLRSTR _CAN1TXDLR @(REG_BASE + 0x000001BC);
#define CAN1TXDLR _CAN1TXDLR.Byte
#define CAN1TXDLR_DLC0 _CAN1TXDLR.Bits.DLC0
#define CAN1TXDLR_DLC1 _CAN1TXDLR.Bits.DLC1
#define CAN1TXDLR_DLC2 _CAN1TXDLR.Bits.DLC2
#define CAN1TXDLR_DLC3 _CAN1TXDLR.Bits.DLC3
#define CAN1TXDLR_DLC _CAN1TXDLR.MergedBits.grpDLC

#define CAN1TXDLR_DLC0_MASK   1
#define CAN1TXDLR_DLC1_MASK   2
#define CAN1TXDLR_DLC2_MASK   4
#define CAN1TXDLR_DLC3_MASK   8
#define CAN1TXDLR_DLC_MASK  15
#define CAN1TXDLR_DLC_BITNUM  0


/*** CAN1TXTBPR - MSCAN 1 Transmit Buffer Priority; 0x000001BD ***/
typedef union {
  byte Byte;
  struct {
    byte PRIO0       :1;                                       /* Transmit Buffer Priority Bit 0 */
    byte PRIO1       :1;                                       /* Transmit Buffer Priority Bit 1 */
    byte PRIO2       :1;                                       /* Transmit Buffer Priority Bit 2 */
    byte PRIO3       :1;                                       /* Transmit Buffer Priority Bit 3 */
    byte PRIO4       :1;                                       /* Transmit Buffer Priority Bit 4 */
    byte PRIO5       :1;                                       /* Transmit Buffer Priority Bit 5 */
    byte PRIO6       :1;                                       /* Transmit Buffer Priority Bit 6 */
    byte PRIO7       :1;                                       /* Transmit Buffer Priority Bit 7 */
  } Bits;
  struct {
    byte grpPRIO :8;
  } MergedBits;
} CAN1TXTBPRSTR;
extern volatile CAN1TXTBPRSTR _CAN1TXTBPR @(REG_BASE + 0x000001BD);
#define CAN1TXTBPR _CAN1TXTBPR.Byte
#define CAN1TXTBPR_PRIO0 _CAN1TXTBPR.Bits.PRIO0
#define CAN1TXTBPR_PRIO1 _CAN1TXTBPR.Bits.PRIO1
#define CAN1TXTBPR_PRIO2 _CAN1TXTBPR.Bits.PRIO2
#define CAN1TXTBPR_PRIO3 _CAN1TXTBPR.Bits.PRIO3
#define CAN1TXTBPR_PRIO4 _CAN1TXTBPR.Bits.PRIO4
#define CAN1TXTBPR_PRIO5 _CAN1TXTBPR.Bits.PRIO5
#define CAN1TXTBPR_PRIO6 _CAN1TXTBPR.Bits.PRIO6
#define CAN1TXTBPR_PRIO7 _CAN1TXTBPR.Bits.PRIO7
#define CAN1TXTBPR_PRIO _CAN1TXTBPR.MergedBits.grpPRIO

#define CAN1TXTBPR_PRIO0_MASK   1
#define CAN1TXTBPR_PRIO1_MASK   2
#define CAN1TXTBPR_PRIO2_MASK   4
#define CAN1TXTBPR_PRIO3_MASK   8
#define CAN1TXTBPR_PRIO4_MASK   16
#define CAN1TXTBPR_PRIO5_MASK   32
#define CAN1TXTBPR_PRIO6_MASK   64
#define CAN1TXTBPR_PRIO7_MASK   128
#define CAN1TXTBPR_PRIO_MASK  255
#define CAN1TXTBPR_PRIO_BITNUM  0


/*** CAN1TXTSR - MSCAN 1 Transmit Time Stamp Register; 0x000001BE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN1TXTSRH - MSCAN 1 Transmit Time Stamp Register High; 0x000001BE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN1TXTSRHSTR;
    #define CAN1TXTSRH _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Byte
    #define CAN1TXTSRH_TSR8 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR8
    #define CAN1TXTSRH_TSR9 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR9
    #define CAN1TXTSRH_TSR10 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR10
    #define CAN1TXTSRH_TSR11 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR11
    #define CAN1TXTSRH_TSR12 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR12
    #define CAN1TXTSRH_TSR13 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR13
    #define CAN1TXTSRH_TSR14 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR14
    #define CAN1TXTSRH_TSR15 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.Bits.TSR15
    
    #define CAN1TXTSRH_TSR_8 _CAN1TXTSR.Overlap_STR.CAN1TXTSRHSTR.MergedBits.grpTSR_8
    #define CAN1TXTSRH_TSR CAN1TXTSRH_TSR_8
    
    #define CAN1TXTSRH_TSR8_MASK   1
    #define CAN1TXTSRH_TSR9_MASK   2
    #define CAN1TXTSRH_TSR10_MASK   4
    #define CAN1TXTSRH_TSR11_MASK   8
    #define CAN1TXTSRH_TSR12_MASK   16
    #define CAN1TXTSRH_TSR13_MASK   32
    #define CAN1TXTSRH_TSR14_MASK   64
    #define CAN1TXTSRH_TSR15_MASK   128
    #define CAN1TXTSRH_TSR_8_MASK  255
    #define CAN1TXTSRH_TSR_8_BITNUM  0


    /*** CAN1TXTSRL - MSCAN 1 Transmit Time Stamp Register Low; 0x000001BF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN1TXTSRLSTR;
    #define CAN1TXTSRL _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Byte
    #define CAN1TXTSRL_TSR0 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR0
    #define CAN1TXTSRL_TSR1 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR1
    #define CAN1TXTSRL_TSR2 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR2
    #define CAN1TXTSRL_TSR3 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR3
    #define CAN1TXTSRL_TSR4 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR4
    #define CAN1TXTSRL_TSR5 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR5
    #define CAN1TXTSRL_TSR6 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR6
    #define CAN1TXTSRL_TSR7 _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.Bits.TSR7
    
    #define CAN1TXTSRL_TSR _CAN1TXTSR.Overlap_STR.CAN1TXTSRLSTR.MergedBits.grpTSR
    
    #define CAN1TXTSRL_TSR0_MASK   1
    #define CAN1TXTSRL_TSR1_MASK   2
    #define CAN1TXTSRL_TSR2_MASK   4
    #define CAN1TXTSRL_TSR3_MASK   8
    #define CAN1TXTSRL_TSR4_MASK   16
    #define CAN1TXTSRL_TSR5_MASK   32
    #define CAN1TXTSRL_TSR6_MASK   64
    #define CAN1TXTSRL_TSR7_MASK   128
    #define CAN1TXTSRL_TSR_MASK  255
    #define CAN1TXTSRL_TSR_BITNUM  0

  } Overlap_STR;

