frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN1TXTSRSTR;
extern volatile CAN1TXTSRSTR _CAN1TXTSR @(REG_BASE + 0x000001BE);
#define CAN1TXTSR _CAN1TXTSR.Word
#define CAN1TXTSR_TSR0 _CAN1TXTSR.Bits.TSR0
#define CAN1TXTSR_TSR1 _CAN1TXTSR.Bits.TSR1
#define CAN1TXTSR_TSR2 _CAN1TXTSR.Bits.TSR2
#define CAN1TXTSR_TSR3 _CAN1TXTSR.Bits.TSR3
#define CAN1TXTSR_TSR4 _CAN1TXTSR.Bits.TSR4
#define CAN1TXTSR_TSR5 _CAN1TXTSR.Bits.TSR5
#define CAN1TXTSR_TSR6 _CAN1TXTSR.Bits.TSR6
#define CAN1TXTSR_TSR7 _CAN1TXTSR.Bits.TSR7
#define CAN1TXTSR_TSR8 _CAN1TXTSR.Bits.TSR8
#define CAN1TXTSR_TSR9 _CAN1TXTSR.Bits.TSR9
#define CAN1TXTSR_TSR10 _CAN1TXTSR.Bits.TSR10
#define CAN1TXTSR_TSR11 _CAN1TXTSR.Bits.TSR11
#define CAN1TXTSR_TSR12 _CAN1TXTSR.Bits.TSR12
#define CAN1TXTSR_TSR13 _CAN1TXTSR.Bits.TSR13
#define CAN1TXTSR_TSR14 _CAN1TXTSR.Bits.TSR14
#define CAN1TXTSR_TSR15 _CAN1TXTSR.Bits.TSR15
#define CAN1TXTSR_TSR _CAN1TXTSR.MergedBits.grpTSR

#define CAN1TXTSR_TSR0_MASK   1
#define CAN1TXTSR_TSR1_MASK   2
#define CAN1TXTSR_TSR2_MASK   4
#define CAN1TXTSR_TSR3_MASK   8
#define CAN1TXTSR_TSR4_MASK   16
#define CAN1TXTSR_TSR5_MASK   32
#define CAN1TXTSR_TSR6_MASK   64
#define CAN1TXTSR_TSR7_MASK   128
#define CAN1TXTSR_TSR8_MASK   256
#define CAN1TXTSR_TSR9_MASK   512
#define CAN1TXTSR_TSR10_MASK   1024
#define CAN1TXTSR_TSR11_MASK   2048
#define CAN1TXTSR_TSR12_MASK   4096
#define CAN1TXTSR_TSR13_MASK   8192
#define CAN1TXTSR_TSR14_MASK   16384
#define CAN1TXTSR_TSR15_MASK   32768
#define CAN1TXTSR_TSR_MASK  65535
#define CAN1TXTSR_TSR_BITNUM  0


/*** PTT - Port T I/O Register; 0x00000240 ***/
typedef union {
  byte Byte;
  struct {
    byte PTT0        :1;                                       /* Port T Bit 0 */
    byte PTT1        :1;                                       /* Port T Bit 1 */
    byte PTT2        :1;                                       /* Port T Bit 2 */
    byte PTT3        :1;                                       /* Port T Bit 3 */
    byte PTT4        :1;                                       /* Port T Bit 4 */
    byte PTT5        :1;                                       /* Port T Bit 5 */
    byte PTT6        :1;                                       /* Port T Bit 6 */
    byte PTT7        :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte grpPTT  :8;
  } MergedBits;
} PTTSTR;
extern volatile PTTSTR _PTT @(REG_BASE + 0x00000240);
#define PTT _PTT.Byte
#define PTT_PTT0 _PTT.Bits.PTT0
#define PTT_PTT1 _PTT.Bits.PTT1
#define PTT_PTT2 _PTT.Bits.PTT2
#define PTT_PTT3 _PTT.Bits.PTT3
#define PTT_PTT4 _PTT.Bits.PTT4
#define PTT_PTT5 _PTT.Bits.PTT5
#define PTT_PTT6 _PTT.Bits.PTT6
#define PTT_PTT7 _PTT.Bits.PTT7
#define PTT_PTT _PTT.MergedBits.grpPTT

#define PTT_PTT0_MASK   1
#define PTT_PTT1_MASK   2
#define PTT_PTT2_MASK   4
#define PTT_PTT3_MASK   8
#define PTT_PTT4_MASK   16
#define PTT_PTT5_MASK   32
#define PTT_PTT6_MASK   64
#define PTT_PTT7_MASK   128
#define PTT_PTT_MASK  255
#define PTT_PTT_BITNUM  0


/*** PTIT - Port T Input Register; 0x00000241 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIT0       :1;                                       /* Port T Bit 0 */
    byte PTIT1       :1;                                       /* Port T Bit 1 */
    byte PTIT2       :1;                                       /* Port T Bit 2 */
    byte PTIT3       :1;                                       /* Port T Bit 3 */
    byte PTIT4       :1;                                       /* Port T Bit 4 */
    byte PTIT5       :1;                                       /* Port T Bit 5 */
    byte PTIT6       :1;                                       /* Port T Bit 6 */
    byte PTIT7       :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte grpPTIT :8;
  } MergedBits;
} PTITSTR;
extern volatile PTITSTR _PTIT @(REG_BASE + 0x00000241);
#define PTIT _PTIT.Byte
#define PTIT_PTIT0 _PTIT.Bits.PTIT0
#define PTIT_PTIT1 _PTIT.Bits.PTIT1
#define PTIT_PTIT2 _PTIT.Bits.PTIT2
#define PTIT_PTIT3 _PTIT.Bits.PTIT3
#define PTIT_PTIT4 _PTIT.Bits.PTIT4
#define PTIT_PTIT5 _PTIT.Bits.PTIT5
#define PTIT_PTIT6 _PTIT.Bits.PTIT6
#define PTIT_PTIT7 _PTIT.Bits.PTIT7
#define PTIT_PTIT _PTIT.MergedBits.grpPTIT

#define PTIT_PTIT0_MASK   1
#define PTIT_PTIT1_MASK   2
#define PTIT_PTIT2_MASK   4
#define PTIT_PTIT3_MASK   8
#define PTIT_PTIT4_MASK   16
#define PTIT_PTIT5_MASK   32
#define PTIT_PTIT6_MASK   64
#define PTIT_PTIT7_MASK   128
#define PTIT_PTIT_MASK  255
#define PTIT_PTIT_BITNUM  0


/*** DDRT - Port T Data Direction Register; 0x00000242 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRT0       :1;                                       /* Data Direction Port T Bit 0 */
    byte DDRT1       :1;                                       /* Data Direction Port T Bit 1 */
    byte DDRT2       :1;                                       /* Data Direction Port T Bit 2 */
    byte DDRT3       :1;                                       /* Data Direction Port T Bit 3 */
    byte DDRT4       :1;                                       /* Data Direction Port T Bit 4 */
    byte DDRT5       :1;                                       /* Data Direction Port T Bit 5 */
    byte DDRT6       :1;                                       /* Data Direction Port T Bit 6 */
    byte DDRT7       :1;                                       /* Data Direction Port T Bit 7 */
  } Bits;
  struct {
    byte grpDDRT :8;
  } MergedBits;
} DDRTSTR;
extern volatile DDRTSTR _DDRT @(REG_BASE + 0x00000242);
#define DDRT _DDRT.Byte
#define DDRT_DDRT0 _DDRT.Bits.DDRT0
#define DDRT_DDRT1 _DDRT.Bits.DDRT1
#define DDRT_DDRT2 _DDRT.Bits.DDRT2
#define DDRT_DDRT3 _DDRT.Bits.DDRT3
#define DDRT_DDRT4 _DDRT.Bits.DDRT4
#define DDRT_DDRT5 _DDRT.Bits.DDRT5
#define DDRT_DDRT6 _DDRT.Bits.DDRT6
#define DDRT_DDRT7 _DDRT.Bits.DDRT7
#define DDRT_DDRT _DDRT.MergedBits.grpDDRT

#define DDRT_DDRT0_MASK   1
#define DDRT_DDRT1_MASK   2
#define DDRT_DDRT2_MASK   4
#define DDRT_DDRT3_MASK   8
#define DDRT_DDRT4_MASK   16
#define DDRT_DDRT5_MASK   32
#define DDRT_DDRT6_MASK   64
#define DDRT_DDRT7_MASK   128
#define DDRT_DDRT_MASK  255
#define DDRT_DDRT_BITNUM  0


/*** RDRT - Port T Reduced Drive Register; 0x00000243 ***/
typedef union {
  byte Byte;
  struct {
    byte RDRT0       :1;                                       /* Reduced Drive Port T Bit 0 */
    byte RDRT1       :1;                                       /* Reduced Drive Port T Bit 1 */
    byte RDRT2       :1;                                       /* Reduced Drive Port T Bit 2 */
    byte RDRT3       :1;                                       /* Reduced Drive Port T Bit 3 */
    byte RDRT4       :1;                                       /* Reduced Drive Port T Bit 4 */
    byte RDRT5       :1;                                       /* Reduced Drive Port T Bit 5 */
    byte RDRT6       :1;                                       /* Reduced Drive Port T Bit 6 */
    byte RDRT7       :1;                                       /* Reduced Drive Port T Bit 7 */
  } Bits;
  struct {
    byte grpRDRT :8;
  } MergedBits;
} RDRTSTR;
extern volatile RDRTSTR _RDRT @(REG_BASE + 0x00000243);
#define RDRT _RDRT.Byte
#define RDRT_RDRT0 _RDRT.Bits.RDRT0
#define RDRT_RDRT1 _RDRT.Bits.RDRT1
#define RDRT_RDRT2 _RDRT.Bits.RDRT2
#define RDRT_RDRT3 _RDRT.Bits.RDRT3
#define RDRT_RDRT4 _RDRT.Bits.RDRT4
#define RDRT_RDRT5 _RDRT.Bits.RDRT5
#define RDRT_RDRT6 _RDRT.Bits.RDRT6
#define RDRT_RDRT7 _RDRT.Bits.RDRT7
#define RDRT_RDRT _RDRT.MergedBits.grpRDRT

#define RDRT_RDRT0_MASK   1
#define RDRT_RDRT1_MASK   2
#define RDRT_RDRT2_MASK   4
#define RDRT_RDRT3_MASK   8
#define RDRT_RDRT4_MASK   16
#define RDRT_RDRT5_MASK   32
#define RDRT_RDRT6_MASK   64
#define RDRT_RDRT7_MASK   128
#define RDRT_RDRT_MASK  255
#define RDRT_RDRT_BITNUM  0


