frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile PPSJSTR _PPSJ @(REG_BASE + 0x0000026D);
#define PPSJ _PPSJ.Byte
#define PPSJ_PPSJ0 _PPSJ.Bits.PPSJ0
#define PPSJ_PPSJ1 _PPSJ.Bits.PPSJ1
#define PPSJ_PPSJ2 _PPSJ.Bits.PPSJ2
#define PPSJ_PPSJ4 _PPSJ.Bits.PPSJ4
#define PPSJ_PPSJ5 _PPSJ.Bits.PPSJ5
#define PPSJ_PPSJ6 _PPSJ.Bits.PPSJ6
#define PPSJ_PPSJ7 _PPSJ.Bits.PPSJ7
#define PPSJ_PPSJ _PPSJ.MergedBits.grpPPSJ
#define PPSJ_PPSJ_4 _PPSJ.MergedBits.grpPPSJ_4

#define PPSJ_PPSJ0_MASK   1
#define PPSJ_PPSJ1_MASK   2
#define PPSJ_PPSJ2_MASK   4
#define PPSJ_PPSJ4_MASK   16
#define PPSJ_PPSJ5_MASK   32
#define PPSJ_PPSJ6_MASK   64
#define PPSJ_PPSJ7_MASK   128
#define PPSJ_PPSJ_MASK  7
#define PPSJ_PPSJ_BITNUM  0
#define PPSJ_PPSJ_4_MASK  240
#define PPSJ_PPSJ_4_BITNUM  4


/*** PIEJ - Port J Interrupt Enable Register; 0x0000026E ***/
typedef union {
  byte Byte;
  struct {
    byte PIEJ0       :1;                                       /* Interrupt Enable Port J Bit 0 */
    byte PIEJ1       :1;                                       /* Interrupt Enable Port J Bit 1 */
    byte PIEJ2       :1;                                       /* Interrupt Enable Port J Bit 2 */
    byte             :1; 
    byte PIEJ4       :1;                                       /* Interrupt Enable Port J Bit 4 */
    byte PIEJ5       :1;                                       /* Interrupt Enable Port J Bit 5 */
    byte PIEJ6       :1;                                       /* Interrupt Enable Port J Bit 6 */
    byte PIEJ7       :1;                                       /* Interrupt Enable Port J Bit 7 */
  } Bits;
  struct {
    byte grpPIEJ :3;
    byte         :1;
    byte grpPIEJ_4 :4;
  } MergedBits;
} PIEJSTR;
extern volatile PIEJSTR _PIEJ @(REG_BASE + 0x0000026E);
#define PIEJ _PIEJ.Byte
#define PIEJ_PIEJ0 _PIEJ.Bits.PIEJ0
#define PIEJ_PIEJ1 _PIEJ.Bits.PIEJ1
#define PIEJ_PIEJ2 _PIEJ.Bits.PIEJ2
#define PIEJ_PIEJ4 _PIEJ.Bits.PIEJ4
#define PIEJ_PIEJ5 _PIEJ.Bits.PIEJ5
#define PIEJ_PIEJ6 _PIEJ.Bits.PIEJ6
#define PIEJ_PIEJ7 _PIEJ.Bits.PIEJ7
#define PIEJ_PIEJ _PIEJ.MergedBits.grpPIEJ
#define PIEJ_PIEJ_4 _PIEJ.MergedBits.grpPIEJ_4

#define PIEJ_PIEJ0_MASK   1
#define PIEJ_PIEJ1_MASK   2
#define PIEJ_PIEJ2_MASK   4
#define PIEJ_PIEJ4_MASK   16
#define PIEJ_PIEJ5_MASK   32
#define PIEJ_PIEJ6_MASK   64
#define PIEJ_PIEJ7_MASK   128
#define PIEJ_PIEJ_MASK  7
#define PIEJ_PIEJ_BITNUM  0
#define PIEJ_PIEJ_4_MASK  240
#define PIEJ_PIEJ_4_BITNUM  4


/*** PIFJ - Port J Interrupt Flag Register; 0x0000026F ***/
typedef union {
  byte Byte;
  struct {
    byte PIFJ0       :1;                                       /* Interrupt Flags Port J Bit 0 */
    byte PIFJ1       :1;                                       /* Interrupt Flags Port J Bit 1 */
    byte PIFJ2       :1;                                       /* Interrupt Flags Port J Bit 2 */
    byte             :1; 
    byte PIFJ4       :1;                                       /* Interrupt Flags Port J Bit 4 */
    byte PIFJ5       :1;                                       /* Interrupt Flags Port J Bit 5 */
    byte PIFJ6       :1;                                       /* Interrupt Flags Port J Bit 6 */
    byte PIFJ7       :1;                                       /* Interrupt Flags Port J Bit 7 */
  } Bits;
  struct {
    byte grpPIFJ :3;
    byte         :1;
    byte grpPIFJ_4 :4;
  } MergedBits;
} PIFJSTR;
extern volatile PIFJSTR _PIFJ @(REG_BASE + 0x0000026F);
#define PIFJ _PIFJ.Byte
#define PIFJ_PIFJ0 _PIFJ.Bits.PIFJ0
#define PIFJ_PIFJ1 _PIFJ.Bits.PIFJ1
#define PIFJ_PIFJ2 _PIFJ.Bits.PIFJ2
#define PIFJ_PIFJ4 _PIFJ.Bits.PIFJ4
#define PIFJ_PIFJ5 _PIFJ.Bits.PIFJ5
#define PIFJ_PIFJ6 _PIFJ.Bits.PIFJ6
#define PIFJ_PIFJ7 _PIFJ.Bits.PIFJ7
#define PIFJ_PIFJ _PIFJ.MergedBits.grpPIFJ
#define PIFJ_PIFJ_4 _PIFJ.MergedBits.grpPIFJ_4

#define PIFJ_PIFJ0_MASK   1
#define PIFJ_PIFJ1_MASK   2
#define PIFJ_PIFJ2_MASK   4
#define PIFJ_PIFJ4_MASK   16
#define PIFJ_PIFJ5_MASK   32
#define PIFJ_PIFJ6_MASK   64
#define PIFJ_PIFJ7_MASK   128
#define PIFJ_PIFJ_MASK  7
#define PIFJ_PIFJ_BITNUM  0
#define PIFJ_PIFJ_4_MASK  240
#define PIFJ_PIFJ_4_BITNUM  4


/*** PT1AD0 - Port AD0 Data Register 1; 0x00000271 ***/
typedef union {
  byte Byte;
  struct {
    byte PT1AD00     :1;                                       /* Port AD0 Data Bit 0 */
    byte PT1AD01     :1;                                       /* Port AD0 Data Bit 1 */
    byte PT1AD02     :1;                                       /* Port AD0 Data Bit 2 */
    byte PT1AD03     :1;                                       /* Port AD0 Data Bit 3 */
    byte PT1AD04     :1;                                       /* Port AD0 Data Bit 4 */
    byte PT1AD05     :1;                                       /* Port AD0 Data Bit 5 */
    byte PT1AD06     :1;                                       /* Port AD0 Data Bit 6 */
    byte PT1AD07     :1;                                       /* Port AD0 Data Bit 7 */
  } Bits;
  struct {
    byte grpPT1AD0 :8;
  } MergedBits;
} PT1AD0STR;
extern volatile PT1AD0STR _PT1AD0 @(REG_BASE + 0x00000271);
#define PT1AD0 _PT1AD0.Byte
#define PT1AD0_PT1AD00 _PT1AD0.Bits.PT1AD00
#define PT1AD0_PT1AD01 _PT1AD0.Bits.PT1AD01
#define PT1AD0_PT1AD02 _PT1AD0.Bits.PT1AD02
#define PT1AD0_PT1AD03 _PT1AD0.Bits.PT1AD03
#define PT1AD0_PT1AD04 _PT1AD0.Bits.PT1AD04
#define PT1AD0_PT1AD05 _PT1AD0.Bits.PT1AD05
#define PT1AD0_PT1AD06 _PT1AD0.Bits.PT1AD06
#define PT1AD0_PT1AD07 _PT1AD0.Bits.PT1AD07
#define PT1AD0_PT1AD0 _PT1AD0.MergedBits.grpPT1AD0

#define PT1AD0_PT1AD00_MASK   1
#define PT1AD0_PT1AD01_MASK   2
#define PT1AD0_PT1AD02_MASK   4
#define PT1AD0_PT1AD03_MASK   8
#define PT1AD0_PT1AD04_MASK   16
#define PT1AD0_PT1AD05_MASK   32
#define PT1AD0_PT1AD06_MASK   64
#define PT1AD0_PT1AD07_MASK   128
#define PT1AD0_PT1AD0_MASK  255
#define PT1AD0_PT1AD0_BITNUM  0


/*** DDR1AD0 - Port AD0 Data Direction Register 1; 0x00000273 ***/
typedef union {
  byte Byte;
  struct {
    byte DDR1AD00    :1;                                       /* Port AD0 Data Direction Bit 0 */
    byte DDR1AD01    :1;                                       /* Port AD0 Data Direction Bit 1 */
    byte DDR1AD02    :1;                                       /* Port AD0 Data Direction Bit 2 */
    byte DDR1AD03    :1;                                       /* Port AD0 Data Direction Bit 3 */
    byte DDR1AD04    :1;                                       /* Port AD0 Data Direction Bit 4 */
    byte DDR1AD05    :1;                                       /* Port AD0 Data Direction Bit 5 */
    byte DDR1AD06    :1;                                       /* Port AD0 Data Direction Bit 6 */
    byte DDR1AD07    :1;                                       /* Port AD0 Data Direction Bit 7 */
  } Bits;
  struct {
    byte grpDDR1AD0 :8;
  } MergedBits;
} DDR1AD0STR;
extern volatile DDR1AD0STR _DDR1AD0 @(REG_BASE + 0x00000273);
#define DDR1AD0 _DDR1AD0.Byte
#define DDR1AD0_DDR1AD00 _DDR1AD0.Bits.DDR1AD00
#define DDR1AD0_DDR1AD01 _DDR1AD0.Bits.DDR1AD01
#define DDR1AD0_DDR1AD02 _DDR1AD0.Bits.DDR1AD02
#define DDR1AD0_DDR1AD03 _DDR1AD0.Bits.DDR1AD03
#define DDR1AD0_DDR1AD04 _DDR1AD0.Bits.DDR1AD04
#define DDR1AD0_DDR1AD05 _DDR1AD0.Bits.DDR1AD05
#define DDR1AD0_DDR1AD06 _DDR1AD0.Bits.DDR1AD06
#define DDR1AD0_DDR1AD07 _DDR1AD0.Bits.DDR1AD07
#define DDR1AD0_DDR1AD0 _DDR1AD0.MergedBits.grpDDR1AD0

#define DDR1AD0_DDR1AD00_MASK   1
#define DDR1AD0_DDR1AD01_MASK   2
#define DDR1AD0_DDR1AD02_MASK   4
#define DDR1AD0_DDR1AD03_MASK   8
#define DDR1AD0_DDR1AD04_MASK   16
#define DDR1AD0_DDR1AD05_MASK   32
#define DDR1AD0_DDR1AD06_MASK   64
#define DDR1AD0_DDR1AD07_MASK   128
#define DDR1AD0_DDR1AD0_MASK  255
#define DDR1AD0_DDR1AD0_BITNUM  0


/*** RDR1AD0 - Port AD0 Reduced Drive Register 1; 0x00000275 ***/
typedef union {
  byte Byte;
  struct {
    byte RDR1AD00    :1;                                       /* Port AD0 Reduced Drive Bit 0 */
    byte RDR1AD01    :1;                                       /* Port AD0 Reduced Drive Bit 1 */
    byte RDR1AD02    :1;                                       /* Port AD0 Reduced Drive Bit 2 */
    byte RDR1AD03    :1;                                       /* Port AD0 Reduced Drive Bit 3 */
    byte RDR1AD04    :1;                                       /* Port AD0 Reduced Drive Bit 4 */
    byte RDR1AD05    :1;                                       /* Port AD0 Reduced Drive Bit 5 */
    byte RDR1AD06    :1;                                       /* Port AD0 Reduced Drive Bit 6 */
    byte RDR1AD07    :1;                                       /* Port AD0 Reduced Drive Bit 7 */
  } Bits;
  struct {
    byte grpRDR1AD0 :8;
  } MergedBits;
} RDR1AD0STR;
extern volatile RDR1AD0STR _RDR1AD0 @(REG_BASE + 0x00000275);
#define RDR1AD0 _RDR1AD0.Byte
#define RDR1AD0_RDR1AD00 _RDR1AD0.Bits.RDR1AD00
#define RDR1AD0_RDR1AD01 _RDR1AD0.Bits.RDR1AD01
#define RDR1AD0_RDR1AD02 _RDR1AD0.Bits.RDR1AD02
#define RDR1AD0_RDR1AD03 _RDR1AD0.Bits.RDR1AD03
#define RDR1AD0_RDR1AD04 _RDR1AD0.Bits.RDR1AD04
#define RDR1AD0_RDR1AD05 _RDR1AD0.Bits.RDR1AD05
#define RDR1AD0_RDR1AD06 _RDR1AD0.Bits.RDR1AD06
#define RDR1AD0_RDR1AD07 _RDR1AD0.Bits.RDR1AD07
#define RDR1AD0_RDR1AD0 _RDR1AD0.MergedBits.grpRDR1AD0

#define RDR1AD0_RDR1AD00_MASK   1
#define RDR1AD0_RDR1AD01_MASK   2
#define RDR1AD0_RDR1AD02_MASK   4
#define RDR1AD0_RDR1AD03_MASK   8
#define RDR1AD0_RDR1AD04_MASK   16
#define RDR1AD0_RDR1AD05_MASK   32
#define RDR1AD0_RDR1AD06_MASK   64
#define RDR1AD0_RDR1AD07_MASK   128
#define RDR1AD0_RDR1AD0_MASK  255
#define RDR1AD0_RDR1AD0_BITNUM  0


