frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
/*** PER1AD0 - Port AD0 Pull Up Enable Register 1; 0x00000277 ***/
typedef union {
  byte Byte;
  struct {
    byte PER1AD00    :1;                                       /* Port AD0 Pull Up Enable Bit 0 */
    byte PER1AD01    :1;                                       /* Port AD0 Pull Up Enable Bit 1 */
    byte PER1AD02    :1;                                       /* Port AD0 Pull Up Enable Bit 2 */
    byte PER1AD03    :1;                                       /* Port AD0 Pull Up Enable Bit 3 */
    byte PER1AD04    :1;                                       /* Port AD0 Pull Up Enable Bit 4 */
    byte PER1AD05    :1;                                       /* Port AD0 Pull Up Enable Bit 5 */
    byte PER1AD06    :1;                                       /* Port AD0 Pull Up Enable Bit 6 */
    byte PER1AD07    :1;                                       /* Port AD0 Pull Up Enable Bit 7 */
  } Bits;
  struct {
    byte grpPER1AD0 :8;
  } MergedBits;
} PER1AD0STR;
extern volatile PER1AD0STR _PER1AD0 @(REG_BASE + 0x00000277);
#define PER1AD0 _PER1AD0.Byte
#define PER1AD0_PER1AD00 _PER1AD0.Bits.PER1AD00
#define PER1AD0_PER1AD01 _PER1AD0.Bits.PER1AD01
#define PER1AD0_PER1AD02 _PER1AD0.Bits.PER1AD02
#define PER1AD0_PER1AD03 _PER1AD0.Bits.PER1AD03
#define PER1AD0_PER1AD04 _PER1AD0.Bits.PER1AD04
#define PER1AD0_PER1AD05 _PER1AD0.Bits.PER1AD05
#define PER1AD0_PER1AD06 _PER1AD0.Bits.PER1AD06
#define PER1AD0_PER1AD07 _PER1AD0.Bits.PER1AD07
#define PER1AD0_PER1AD0 _PER1AD0.MergedBits.grpPER1AD0

#define PER1AD0_PER1AD00_MASK   1
#define PER1AD0_PER1AD01_MASK   2
#define PER1AD0_PER1AD02_MASK   4
#define PER1AD0_PER1AD03_MASK   8
#define PER1AD0_PER1AD04_MASK   16
#define PER1AD0_PER1AD05_MASK   32
#define PER1AD0_PER1AD06_MASK   64
#define PER1AD0_PER1AD07_MASK   128
#define PER1AD0_PER1AD0_MASK  255
#define PER1AD0_PER1AD0_BITNUM  0


/*** PT0AD1 - Port AD1 Data Register 0; 0x00000278 ***/
typedef union {
  byte Byte;
  struct {
    byte PT0AD18     :1;                                       /* Port AD1 Data Bit 8 */
    byte PT0AD19     :1;                                       /* Port AD1 Data Bit 9 */
    byte PT0AD110    :1;                                       /* Port AD1 Data Bit 10 */
    byte PT0AD111    :1;                                       /* Port AD1 Data Bit 11 */
    byte PT0AD112    :1;                                       /* Port AD1 Data Bit 12 */
    byte PT0AD113    :1;                                       /* Port AD1 Data Bit 13 */
    byte PT0AD114    :1;                                       /* Port AD1 Data Bit 14 */
    byte PT0AD115    :1;                                       /* Port AD1 Data Bit 15 */
  } Bits;
  struct {
    byte grpPT0AD_18 :2;
    byte grpPT0AD1_10 :6;
  } MergedBits;
} PT0AD1STR;
extern volatile PT0AD1STR _PT0AD1 @(REG_BASE + 0x00000278);
#define PT0AD1 _PT0AD1.Byte
#define PT0AD1_PT0AD18 _PT0AD1.Bits.PT0AD18
#define PT0AD1_PT0AD19 _PT0AD1.Bits.PT0AD19
#define PT0AD1_PT0AD110 _PT0AD1.Bits.PT0AD110
#define PT0AD1_PT0AD111 _PT0AD1.Bits.PT0AD111
#define PT0AD1_PT0AD112 _PT0AD1.Bits.PT0AD112
#define PT0AD1_PT0AD113 _PT0AD1.Bits.PT0AD113
#define PT0AD1_PT0AD114 _PT0AD1.Bits.PT0AD114
#define PT0AD1_PT0AD115 _PT0AD1.Bits.PT0AD115
#define PT0AD1_PT0AD_18 _PT0AD1.MergedBits.grpPT0AD_18
#define PT0AD1_PT0AD1_10 _PT0AD1.MergedBits.grpPT0AD1_10
#define PT0AD1_PT0AD PT0AD1_PT0AD_18

#define PT0AD1_PT0AD18_MASK   1
#define PT0AD1_PT0AD19_MASK   2
#define PT0AD1_PT0AD110_MASK   4
#define PT0AD1_PT0AD111_MASK   8
#define PT0AD1_PT0AD112_MASK   16
#define PT0AD1_PT0AD113_MASK   32
#define PT0AD1_PT0AD114_MASK   64
#define PT0AD1_PT0AD115_MASK   128
#define PT0AD1_PT0AD_18_MASK  3
#define PT0AD1_PT0AD_18_BITNUM  0
#define PT0AD1_PT0AD1_10_MASK  252
#define PT0AD1_PT0AD1_10_BITNUM  2


/*** PT1AD1 - Port AD1 Data Register 1; 0x00000279 ***/
typedef union {
  byte Byte;
  struct {
    byte PT1AD18     :1;                                       /* Port AD1 Data Bit 8 */
    byte PT1AD19     :1;                                       /* Port AD1 Data Bit 9 */
    byte PT1AD110    :1;                                       /* Port AD1 Data Bit 10 */
    byte PT1AD111    :1;                                       /* Port AD1 Data Bit 11 */
    byte PT1AD112    :1;                                       /* Port AD1 Data Bit 12 */
    byte PT1AD113    :1;                                       /* Port AD1 Data Bit 13 */
    byte PT1AD114    :1;                                       /* Port AD1 Data Bit 14 */
    byte PT1AD115    :1;                                       /* Port AD1 Data Bit 15 */
  } Bits;
  struct {
    byte grpPT1AD_18 :2;
    byte grpPT1AD1_10 :6;
  } MergedBits;
} PT1AD1STR;
extern volatile PT1AD1STR _PT1AD1 @(REG_BASE + 0x00000279);
#define PT1AD1 _PT1AD1.Byte
#define PT1AD1_PT1AD18 _PT1AD1.Bits.PT1AD18
#define PT1AD1_PT1AD19 _PT1AD1.Bits.PT1AD19
#define PT1AD1_PT1AD110 _PT1AD1.Bits.PT1AD110
#define PT1AD1_PT1AD111 _PT1AD1.Bits.PT1AD111
#define PT1AD1_PT1AD112 _PT1AD1.Bits.PT1AD112
#define PT1AD1_PT1AD113 _PT1AD1.Bits.PT1AD113
#define PT1AD1_PT1AD114 _PT1AD1.Bits.PT1AD114
#define PT1AD1_PT1AD115 _PT1AD1.Bits.PT1AD115
#define PT1AD1_PT1AD_18 _PT1AD1.MergedBits.grpPT1AD_18
#define PT1AD1_PT1AD1_10 _PT1AD1.MergedBits.grpPT1AD1_10
#define PT1AD1_PT1AD PT1AD1_PT1AD_18

#define PT1AD1_PT1AD18_MASK   1
#define PT1AD1_PT1AD19_MASK   2
#define PT1AD1_PT1AD110_MASK   4
#define PT1AD1_PT1AD111_MASK   8
#define PT1AD1_PT1AD112_MASK   16
#define PT1AD1_PT1AD113_MASK   32
#define PT1AD1_PT1AD114_MASK   64
#define PT1AD1_PT1AD115_MASK   128
#define PT1AD1_PT1AD_18_MASK  3
#define PT1AD1_PT1AD_18_BITNUM  0
#define PT1AD1_PT1AD1_10_MASK  252
#define PT1AD1_PT1AD1_10_BITNUM  2


/*** DDR0AD1 - Port AD1 Data Direction Register 0; 0x0000027A ***/
typedef union {
  byte Byte;
  struct {
    byte DDR0AD116   :1;                                       /* Port AD1 Data Direction Bit 16 */
    byte DDR0AD117   :1;                                       /* Port AD1 Data Direction Bit 17 */
    byte DDR0AD118   :1;                                       /* Port AD1 Data Direction Bit 18 */
    byte DDR0AD119   :1;                                       /* Port AD1 Data Direction Bit 19 */
    byte DDR0AD120   :1;                                       /* Port AD1 Data Direction Bit 20 */
    byte DDR0AD121   :1;                                       /* Port AD1 Data Direction Bit 21 */
    byte DDR0AD122   :1;                                       /* Port AD1 Data Direction Bit 22 */
    byte DDR0AD123   :1;                                       /* Port AD1 Data Direction Bit 23 */
  } Bits;
  struct {
    byte grpDDR0AD1_16 :8;
  } MergedBits;
} DDR0AD1STR;
extern volatile DDR0AD1STR _DDR0AD1 @(REG_BASE + 0x0000027A);
#define DDR0AD1 _DDR0AD1.Byte
#define DDR0AD1_DDR0AD116 _DDR0AD1.Bits.DDR0AD116
#define DDR0AD1_DDR0AD117 _DDR0AD1.Bits.DDR0AD117
#define DDR0AD1_DDR0AD118 _DDR0AD1.Bits.DDR0AD118
#define DDR0AD1_DDR0AD119 _DDR0AD1.Bits.DDR0AD119
#define DDR0AD1_DDR0AD120 _DDR0AD1.Bits.DDR0AD120
#define DDR0AD1_DDR0AD121 _DDR0AD1.Bits.DDR0AD121
#define DDR0AD1_DDR0AD122 _DDR0AD1.Bits.DDR0AD122
#define DDR0AD1_DDR0AD123 _DDR0AD1.Bits.DDR0AD123
#define DDR0AD1_DDR0AD1_16 _DDR0AD1.MergedBits.grpDDR0AD1_16

#define DDR0AD1_DDR0AD116_MASK   1
#define DDR0AD1_DDR0AD117_MASK   2
#define DDR0AD1_DDR0AD118_MASK   4
#define DDR0AD1_DDR0AD119_MASK   8
#define DDR0AD1_DDR0AD120_MASK   16
#define DDR0AD1_DDR0AD121_MASK   32
#define DDR0AD1_DDR0AD122_MASK   64
#define DDR0AD1_DDR0AD123_MASK   128
#define DDR0AD1_DDR0AD1_16_MASK  255
#define DDR0AD1_DDR0AD1_16_BITNUM  0


/*** DDR1AD1 - Port AD1 Data Direction Register 1; 0x0000027B ***/
typedef union {
  byte Byte;
  struct {
    byte DDR1AD18    :1;                                       /* Port AD1 Data Direction Bit 8 */
    byte DDR1AD19    :1;                                       /* Port AD1 Data Direction Bit 9 */
    byte DDR1AD110   :1;                                       /* Port AD1 Data Direction Bit 10 */
    byte DDR1AD111   :1;                                       /* Port AD1 Data Direction Bit 11 */
    byte DDR1AD112   :1;                                       /* Port AD1 Data Direction Bit 12 */
    byte DDR1AD113   :1;                                       /* Port AD1 Data Direction Bit 13 */
    byte DDR1AD114   :1;                                       /* Port AD1 Data Direction Bit 14 */
    byte DDR1AD115   :1;                                       /* Port AD1 Data Direction Bit 15 */
  } Bits;
  struct {
    byte grpDDR1AD_18 :2;
    byte grpDDR1AD1_10 :6;
  } MergedBits;
} DDR1AD1STR;
extern volatile DDR1AD1STR _DDR1AD1 @(REG_BASE + 0x0000027B);
#define DDR1AD1 _DDR1AD1.Byte
#define DDR1AD1_DDR1AD18 _DDR1AD1.Bits.DDR1AD18
#define DDR1AD1_DDR1AD19 _DDR1AD1.Bits.DDR1AD19
#define DDR1AD1_DDR1AD110 _DDR1AD1.Bits.DDR1AD110
#define DDR1AD1_DDR1AD111 _DDR1AD1.Bits.DDR1AD111
#define DDR1AD1_DDR1AD112 _DDR1AD1.Bits.DDR1AD112
#define DDR1AD1_DDR1AD113 _DDR1AD1.Bits.DDR1AD113
#define DDR1AD1_DDR1AD114 _DDR1AD1.Bits.DDR1AD114
#define DDR1AD1_DDR1AD115 _DDR1AD1.Bits.DDR1AD115
#define DDR1AD1_DDR1AD_18 _DDR1AD1.MergedBits.grpDDR1AD_18
#define DDR1AD1_DDR1AD1_10 _DDR1AD1.MergedBits.grpDDR1AD1_10
#define DDR1AD1_DDR1AD DDR1AD1_DDR1AD_18

#define DDR1AD1_DDR1AD18_MASK   1
#define DDR1AD1_DDR1AD19_MASK   2
#define DDR1AD1_DDR1AD110_MASK   4
#define DDR1AD1_DDR1AD111_MASK   8
#define DDR1AD1_DDR1AD112_MASK   16
#define DDR1AD1_DDR1AD113_MASK   32
#define DDR1AD1_DDR1AD114_MASK   64
#define DDR1AD1_DDR1AD115_MASK   128
#define DDR1AD1_DDR1AD_18_MASK  3
#define DDR1AD1_DDR1AD_18_BITNUM  0
#define DDR1AD1_DDR1AD1_10_MASK  252
#define DDR1AD1_DDR1AD1_10_BITNUM  2


/*** RDR0AD1 - Port AD1 Reduced Drive Register 0; 0x0000027C ***/
typedef union {
  byte Byte;
  struct {
    byte RDR0AD116   :1;                                       /* Port AD1 Reduced Drive Bit 16 */
    byte RDR0AD117   :1;                                       /* Port AD1 Reduced Drive Bit 17 */
    byte RDR0AD118   :1;                                       /* Port AD1 Reduced Drive Bit 18 */
    byte RDR0AD119   :1;                                       /* Port AD1 Reduced Drive Bit 19 */
    byte RDR0AD120   :1;                                       /* Port AD1 Reduced Drive Bit 20 */
    byte RDR0AD121   :1;                                       /* Port AD1 Reduced Drive Bit 21 */
    byte RDR0AD122   :1;                                       /* Port AD1 Reduced Drive Bit 22 */
    byte RDR0AD123   :1;                                       /* Port AD1 Reduced Drive Bit 23 */
  } Bits;
  struct {
    byte grpRDR0AD1_16 :8;
  } MergedBits;
} RDR0AD1STR;
extern volatile RDR0AD1STR _RDR0AD1 @(REG_BASE + 0x0000027C);
#define RDR0AD1 _RDR0AD1.Byte
#define RDR0AD1_RDR0AD116 _RDR0AD1.Bits.RDR0AD116
#define RDR0AD1_RDR0AD117 _RDR0AD1.Bits.RDR0AD117
#define RDR0AD1_RDR0AD118 _RDR0AD1.Bits.RDR0AD118
#define RDR0AD1_RDR0AD119 _RDR0AD1.Bits.RDR0AD119
#define RDR0AD1_RDR0AD120 _RDR0AD1.Bits.RDR0AD120
#define RDR0AD1_RDR0AD121 _RDR0AD1.Bits.RDR0AD121
#define RDR0AD1_RDR0AD122 _RDR0AD1.Bits.RDR0AD122
#define RDR0AD1_RDR0AD123 _RDR0AD1.Bits.RDR0AD123
#define RDR0AD1_RDR0AD1_16 _RDR0AD1.MergedBits.grpRDR0AD1_16

#define RDR0AD1_RDR0AD116_MASK   1
#define RDR0AD1_RDR0AD117_MASK   2
#define RDR0AD1_RDR0AD118_MASK   4
#define RDR0AD1_RDR0AD119_MASK   8
#define RDR0AD1_RDR0AD120_MASK   16
#define RDR0AD1_RDR0AD121_MASK   32
#define RDR0AD1_RDR0AD122_MASK   64
#define RDR0AD1_RDR0AD123_MASK   128
#define RDR0AD1_RDR0AD1_16_MASK  255
#define RDR0AD1_RDR0AD1_16_BITNUM  0


