frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
/*** RDR1AD1 - Port AD1 Reduced Drive Register 1; 0x0000027D ***/
typedef union {
  byte Byte;
  struct {
    byte RDR1AD18    :1;                                       /* Port AD1 Reduced Drive Bit 8 */
    byte RDR1AD19    :1;                                       /* Port AD1 Reduced Drive Bit 9 */
    byte RDR1AD110   :1;                                       /* Port AD1 Reduced Drive Bit 10 */
    byte RDR1AD111   :1;                                       /* Port AD1 Reduced Drive Bit 11 */
    byte RDR1AD112   :1;                                       /* Port AD1 Reduced Drive Bit 12 */
    byte RDR1AD113   :1;                                       /* Port AD1 Reduced Drive Bit 13 */
    byte RDR1AD114   :1;                                       /* Port AD1 Reduced Drive Bit 14 */
    byte RDR1AD115   :1;                                       /* Port AD1 Reduced Drive Bit 15 */
  } Bits;
  struct {
    byte grpRDR1AD_18 :2;
    byte grpRDR1AD1_10 :6;
  } MergedBits;
} RDR1AD1STR;
extern volatile RDR1AD1STR _RDR1AD1 @(REG_BASE + 0x0000027D);
#define RDR1AD1 _RDR1AD1.Byte
#define RDR1AD1_RDR1AD18 _RDR1AD1.Bits.RDR1AD18
#define RDR1AD1_RDR1AD19 _RDR1AD1.Bits.RDR1AD19
#define RDR1AD1_RDR1AD110 _RDR1AD1.Bits.RDR1AD110
#define RDR1AD1_RDR1AD111 _RDR1AD1.Bits.RDR1AD111
#define RDR1AD1_RDR1AD112 _RDR1AD1.Bits.RDR1AD112
#define RDR1AD1_RDR1AD113 _RDR1AD1.Bits.RDR1AD113
#define RDR1AD1_RDR1AD114 _RDR1AD1.Bits.RDR1AD114
#define RDR1AD1_RDR1AD115 _RDR1AD1.Bits.RDR1AD115
#define RDR1AD1_RDR1AD_18 _RDR1AD1.MergedBits.grpRDR1AD_18
#define RDR1AD1_RDR1AD1_10 _RDR1AD1.MergedBits.grpRDR1AD1_10
#define RDR1AD1_RDR1AD RDR1AD1_RDR1AD_18

#define RDR1AD1_RDR1AD18_MASK   1
#define RDR1AD1_RDR1AD19_MASK   2
#define RDR1AD1_RDR1AD110_MASK   4
#define RDR1AD1_RDR1AD111_MASK   8
#define RDR1AD1_RDR1AD112_MASK   16
#define RDR1AD1_RDR1AD113_MASK   32
#define RDR1AD1_RDR1AD114_MASK   64
#define RDR1AD1_RDR1AD115_MASK   128
#define RDR1AD1_RDR1AD_18_MASK  3
#define RDR1AD1_RDR1AD_18_BITNUM  0
#define RDR1AD1_RDR1AD1_10_MASK  252
#define RDR1AD1_RDR1AD1_10_BITNUM  2


/*** PER0AD1 - Port AD1 Pull Up Enable Register 0; 0x0000027E ***/
typedef union {
  byte Byte;
  struct {
    byte PER0AD116   :1;                                       /* Port AD1 Pull Up Enable Bit 16 */
    byte PER0AD117   :1;                                       /* Port AD1 Pull Up Enable Bit 17 */
    byte PER0AD118   :1;                                       /* Port AD1 Pull Up Enable Bit 18 */
    byte PER0AD119   :1;                                       /* Port AD1 Pull Up Enable Bit 19 */
    byte PER0AD120   :1;                                       /* Port AD1 Pull Up Enable Bit 20 */
    byte PER0AD121   :1;                                       /* Port AD1 Pull Up Enable Bit 21 */
    byte PER0AD122   :1;                                       /* Port AD1 Pull Up Enable Bit 22 */
    byte PER0AD123   :1;                                       /* Port AD1 Pull Up Enable Bit 23 */
  } Bits;
  struct {
    byte grpPER0AD1_16 :8;
  } MergedBits;
} PER0AD1STR;
extern volatile PER0AD1STR _PER0AD1 @(REG_BASE + 0x0000027E);
#define PER0AD1 _PER0AD1.Byte
#define PER0AD1_PER0AD116 _PER0AD1.Bits.PER0AD116
#define PER0AD1_PER0AD117 _PER0AD1.Bits.PER0AD117
#define PER0AD1_PER0AD118 _PER0AD1.Bits.PER0AD118
#define PER0AD1_PER0AD119 _PER0AD1.Bits.PER0AD119
#define PER0AD1_PER0AD120 _PER0AD1.Bits.PER0AD120
#define PER0AD1_PER0AD121 _PER0AD1.Bits.PER0AD121
#define PER0AD1_PER0AD122 _PER0AD1.Bits.PER0AD122
#define PER0AD1_PER0AD123 _PER0AD1.Bits.PER0AD123
#define PER0AD1_PER0AD1_16 _PER0AD1.MergedBits.grpPER0AD1_16

#define PER0AD1_PER0AD116_MASK   1
#define PER0AD1_PER0AD117_MASK   2
#define PER0AD1_PER0AD118_MASK   4
#define PER0AD1_PER0AD119_MASK   8
#define PER0AD1_PER0AD120_MASK   16
#define PER0AD1_PER0AD121_MASK   32
#define PER0AD1_PER0AD122_MASK   64
#define PER0AD1_PER0AD123_MASK   128
#define PER0AD1_PER0AD1_16_MASK  255
#define PER0AD1_PER0AD1_16_BITNUM  0


/*** PER1AD1 - Port AD1 Pull Up Enable Register 1; 0x0000027F ***/
typedef union {
  byte Byte;
  struct {
    byte PER1AD18    :1;                                       /* Port AD1 Pull Up Enable Bit 8 */
    byte PER1AD19    :1;                                       /* Port AD1 Pull Up Enable Bit 9 */
    byte PER1AD110   :1;                                       /* Port AD1 Pull Up Enable Bit 10 */
    byte PER1AD111   :1;                                       /* Port AD1 Pull Up Enable Bit 11 */
    byte PER1AD112   :1;                                       /* Port AD1 Pull Up Enable Bit 12 */
    byte PER1AD113   :1;                                       /* Port AD1 Pull Up Enable Bit 13 */
    byte PER1AD114   :1;                                       /* Port AD1 Pull Up Enable Bit 14 */
    byte PER1AD115   :1;                                       /* Port AD1 Pull Up Enable Bit 15 */
  } Bits;
  struct {
    byte grpPER1AD_18 :2;
    byte grpPER1AD1_10 :6;
  } MergedBits;
} PER1AD1STR;
extern volatile PER1AD1STR _PER1AD1 @(REG_BASE + 0x0000027F);
#define PER1AD1 _PER1AD1.Byte
#define PER1AD1_PER1AD18 _PER1AD1.Bits.PER1AD18
#define PER1AD1_PER1AD19 _PER1AD1.Bits.PER1AD19
#define PER1AD1_PER1AD110 _PER1AD1.Bits.PER1AD110
#define PER1AD1_PER1AD111 _PER1AD1.Bits.PER1AD111
#define PER1AD1_PER1AD112 _PER1AD1.Bits.PER1AD112
#define PER1AD1_PER1AD113 _PER1AD1.Bits.PER1AD113
#define PER1AD1_PER1AD114 _PER1AD1.Bits.PER1AD114
#define PER1AD1_PER1AD115 _PER1AD1.Bits.PER1AD115
#define PER1AD1_PER1AD_18 _PER1AD1.MergedBits.grpPER1AD_18
#define PER1AD1_PER1AD1_10 _PER1AD1.MergedBits.grpPER1AD1_10
#define PER1AD1_PER1AD PER1AD1_PER1AD_18

#define PER1AD1_PER1AD18_MASK   1
#define PER1AD1_PER1AD19_MASK   2
#define PER1AD1_PER1AD110_MASK   4
#define PER1AD1_PER1AD111_MASK   8
#define PER1AD1_PER1AD112_MASK   16
#define PER1AD1_PER1AD113_MASK   32
#define PER1AD1_PER1AD114_MASK   64
#define PER1AD1_PER1AD115_MASK   128
#define PER1AD1_PER1AD_18_MASK  3
#define PER1AD1_PER1AD_18_BITNUM  0
#define PER1AD1_PER1AD1_10_MASK  252
#define PER1AD1_PER1AD1_10_BITNUM  2


/*** CAN4CTL0 - MSCAN 4 Control 0 Register; 0x00000280 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN4CTL0STR;
