frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
#define CAN4RXDSR7_DB0_MASK   1
#define CAN4RXDSR7_DB1_MASK   2
#define CAN4RXDSR7_DB2_MASK   4
#define CAN4RXDSR7_DB3_MASK   8
#define CAN4RXDSR7_DB4_MASK   16
#define CAN4RXDSR7_DB5_MASK   32
#define CAN4RXDSR7_DB6_MASK   64
#define CAN4RXDSR7_DB7_MASK   128
#define CAN4RXDSR7_DB_MASK  255
#define CAN4RXDSR7_DB_BITNUM  0


/*** CAN4RXDLR - MSCAN 4 Receive Data Length Register; 0x000002AC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4RXDLRSTR;
extern volatile CAN4RXDLRSTR _CAN4RXDLR @(REG_BASE + 0x000002AC);
#define CAN4RXDLR _CAN4RXDLR.Byte
#define CAN4RXDLR_DLC0 _CAN4RXDLR.Bits.DLC0
#define CAN4RXDLR_DLC1 _CAN4RXDLR.Bits.DLC1
#define CAN4RXDLR_DLC2 _CAN4RXDLR.Bits.DLC2
#define CAN4RXDLR_DLC3 _CAN4RXDLR.Bits.DLC3
#define CAN4RXDLR_DLC _CAN4RXDLR.MergedBits.grpDLC

#define CAN4RXDLR_DLC0_MASK   1
#define CAN4RXDLR_DLC1_MASK   2
#define CAN4RXDLR_DLC2_MASK   4
#define CAN4RXDLR_DLC3_MASK   8
#define CAN4RXDLR_DLC_MASK  15
#define CAN4RXDLR_DLC_BITNUM  0


/*** CAN4RXTSR - MSCAN 4 Receive Time Stamp Register; 0x000002AE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN4RXTSRH - MSCAN 4 Receive Time Stamp Register High; 0x000002AE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN4RXTSRHSTR;
    #define CAN4RXTSRH _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Byte
    #define CAN4RXTSRH_TSR8 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR8
    #define CAN4RXTSRH_TSR9 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR9
    #define CAN4RXTSRH_TSR10 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR10
    #define CAN4RXTSRH_TSR11 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR11
    #define CAN4RXTSRH_TSR12 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR12
    #define CAN4RXTSRH_TSR13 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR13
    #define CAN4RXTSRH_TSR14 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR14
    #define CAN4RXTSRH_TSR15 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.Bits.TSR15
    
    #define CAN4RXTSRH_TSR_8 _CAN4RXTSR.Overlap_STR.CAN4RXTSRHSTR.MergedBits.grpTSR_8
    #define CAN4RXTSRH_TSR CAN4RXTSRH_TSR_8
    
    #define CAN4RXTSRH_TSR8_MASK   1
    #define CAN4RXTSRH_TSR9_MASK   2
    #define CAN4RXTSRH_TSR10_MASK   4
    #define CAN4RXTSRH_TSR11_MASK   8
    #define CAN4RXTSRH_TSR12_MASK   16
    #define CAN4RXTSRH_TSR13_MASK   32
    #define CAN4RXTSRH_TSR14_MASK   64
    #define CAN4RXTSRH_TSR15_MASK   128
    #define CAN4RXTSRH_TSR_8_MASK  255
    #define CAN4RXTSRH_TSR_8_BITNUM  0


    /*** CAN4RXTSRL - MSCAN 4 Receive Time Stamp Register Low; 0x000002AF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN4RXTSRLSTR;
    #define CAN4RXTSRL _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Byte
    #define CAN4RXTSRL_TSR0 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR0
    #define CAN4RXTSRL_TSR1 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR1
    #define CAN4RXTSRL_TSR2 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR2
    #define CAN4RXTSRL_TSR3 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR3
    #define CAN4RXTSRL_TSR4 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR4
    #define CAN4RXTSRL_TSR5 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR5
    #define CAN4RXTSRL_TSR6 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR6
    #define CAN4RXTSRL_TSR7 _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.Bits.TSR7
    
    #define CAN4RXTSRL_TSR _CAN4RXTSR.Overlap_STR.CAN4RXTSRLSTR.MergedBits.grpTSR
    
    #define CAN4RXTSRL_TSR0_MASK   1
    #define CAN4RXTSRL_TSR1_MASK   2
    #define CAN4RXTSRL_TSR2_MASK   4
    #define CAN4RXTSRL_TSR3_MASK   8
    #define CAN4RXTSRL_TSR4_MASK   16
    #define CAN4RXTSRL_TSR5_MASK   32
    #define CAN4RXTSRL_TSR6_MASK   64
    #define CAN4RXTSRL_TSR7_MASK   128
    #define CAN4RXTSRL_TSR_MASK  255
    #define CAN4RXTSRL_TSR_BITNUM  0

  } Overlap_STR;

  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
  struct {
    word grpTSR  :16;
  } MergedBits;
} CAN4RXTSRSTR;
extern volatile CAN4RXTSRSTR _CAN4RXTSR @(REG_BASE + 0x000002AE);
#define CAN4RXTSR _CAN4RXTSR.Word
#define CAN4RXTSR_TSR0 _CAN4RXTSR.Bits.TSR0
#define CAN4RXTSR_TSR1 _CAN4RXTSR.Bits.TSR1
#define CAN4RXTSR_TSR2 _CAN4RXTSR.Bits.TSR2
#define CAN4RXTSR_TSR3 _CAN4RXTSR.Bits.TSR3
#define CAN4RXTSR_TSR4 _CAN4RXTSR.Bits.TSR4
#define CAN4RXTSR_TSR5 _CAN4RXTSR.Bits.TSR5
#define CAN4RXTSR_TSR6 _CAN4RXTSR.Bits.TSR6
#define CAN4RXTSR_TSR7 _CAN4RXTSR.Bits.TSR7
#define CAN4RXTSR_TSR8 _CAN4RXTSR.Bits.TSR8
#define CAN4RXTSR_TSR9 _CAN4RXTSR.Bits.TSR9
#define CAN4RXTSR_TSR10 _CAN4RXTSR.Bits.TSR10
#define CAN4RXTSR_TSR11 _CAN4RXTSR.Bits.TSR11
#define CAN4RXTSR_TSR12 _CAN4RXTSR.Bits.TSR12
#define CAN4RXTSR_TSR13 _CAN4RXTSR.Bits.TSR13
#define CAN4RXTSR_TSR14 _CAN4RXTSR.Bits.TSR14
#define CAN4RXTSR_TSR15 _CAN4RXTSR.Bits.TSR15
#define CAN4RXTSR_TSR _CAN4RXTSR.MergedBits.grpTSR

#define CAN4RXTSR_TSR0_MASK   1
#define CAN4RXTSR_TSR1_MASK   2
#define CAN4RXTSR_TSR2_MASK   4
#define CAN4RXTSR_TSR3_MASK   8
#define CAN4RXTSR_TSR4_MASK   16
#define CAN4RXTSR_TSR5_MASK   32
#define CAN4RXTSR_TSR6_MASK   64
#define CAN4RXTSR_TSR7_MASK   128
#define CAN4RXTSR_TSR8_MASK   256
#define CAN4RXTSR_TSR9_MASK   512
#define CAN4RXTSR_TSR10_MASK   1024
#define CAN4RXTSR_TSR11_MASK   2048
#define CAN4RXTSR_TSR12_MASK   4096
#define CAN4RXTSR_TSR13_MASK   8192
#define CAN4RXTSR_TSR14_MASK   16384
#define CAN4RXTSR_TSR15_MASK   32768
#define CAN4RXTSR_TSR_MASK  65535
#define CAN4RXTSR_TSR_BITNUM  0


/*** CAN4TXIDR0 - MSCAN 4 Transmit Identifier Register 0; 0x000002B0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
  struct {
    byte grpID_21 :8;
  } MergedBits;
} CAN4TXIDR0STR;
extern volatile CAN4TXIDR0STR _CAN4TXIDR0 @(REG_BASE + 0x000002B0);
#define CAN4TXIDR0 _CAN4TXIDR0.Byte
#define CAN4TXIDR0_ID21 _CAN4TXIDR0.Bits.ID21
#define CAN4TXIDR0_ID22 _CAN4TXIDR0.Bits.ID22
#define CAN4TXIDR0_ID23 _CAN4TXIDR0.Bits.ID23
#define CAN4TXIDR0_ID24 _CAN4TXIDR0.Bits.ID24
#define CAN4TXIDR0_ID25 _CAN4TXIDR0.Bits.ID25
#define CAN4TXIDR0_ID26 _CAN4TXIDR0.Bits.ID26
#define CAN4TXIDR0_ID27 _CAN4TXIDR0.Bits.ID27
#define CAN4TXIDR0_ID28 _CAN4TXIDR0.Bits.ID28
/* CAN4TXIDR_ARR: Access 4 CAN4TXIDRx registers in a array */
#define CAN4TXIDR_ARR ((Byte *) &CAN4TXIDR0)
#define CAN4TXIDR0_ID_21 _CAN4TXIDR0.MergedBits.grpID_21
#define CAN4TXIDR0_ID CAN4TXIDR0_ID_21

#define CAN4TXIDR0_ID21_MASK   1
#define CAN4TXIDR0_ID22_MASK   2
#define CAN4TXIDR0_ID23_MASK   4
#define CAN4TXIDR0_ID24_MASK   8
#define CAN4TXIDR0_ID25_MASK   16
#define CAN4TXIDR0_ID26_MASK   32
#define CAN4TXIDR0_ID27_MASK   64
#define CAN4TXIDR0_ID28_MASK   128
#define CAN4TXIDR0_ID_21_MASK  255
#define CAN4TXIDR0_ID_21_BITNUM  0


/*** CAN4TXIDR1 - MSCAN 4 Transmit Identifier Register 1; 0x000002B1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN4TXIDR1STR;
extern volatile CAN4TXIDR1STR _CAN4TXIDR1 @(REG_BASE + 0x000002B1);
#define CAN4TXIDR1 _CAN4TXIDR1.Byte
#define CAN4TXIDR1_ID15 _CAN4TXIDR1.Bits.ID15
#define CAN4TXIDR1_ID16 _CAN4TXIDR1.Bits.ID16
#define CAN4TXIDR1_ID17 _CAN4TXIDR1.Bits.ID17
#define CAN4TXIDR1_IDE _CAN4TXIDR1.Bits.IDE
#define CAN4TXIDR1_SRR _CAN4TXIDR1.Bits.SRR
#define CAN4TXIDR1_ID18 _CAN4TXIDR1.Bits.ID18
#define CAN4TXIDR1_ID19 _CAN4TXIDR1.Bits.ID19
#define CAN4TXIDR1_ID20 _CAN4TXIDR1.Bits.ID20
#define CAN4TXIDR1_ID_15 _CAN4TXIDR1.MergedBits.grpID_15
#define CAN4TXIDR1_ID_18 _CAN4TXIDR1.MergedBits.grpID_18
#define CAN4TXIDR1_ID CAN4TXIDR1_ID_15

#define CAN4TXIDR1_ID15_MASK   1
#define CAN4TXIDR1_ID16_MASK   2
#define CAN4TXIDR1_ID17_MASK   4
#define CAN4TXIDR1_IDE_MASK   8
#define CAN4TXIDR1_SRR_MASK   16
#define CAN4TXIDR1_ID18_MASK   32
#define CAN4TXIDR1_ID19_MASK   64
#define CAN4TXIDR1_ID20_MASK   128
#define CAN4TXIDR1_ID_15_MASK  7
#define CAN4TXIDR1_ID_15_BITNUM  0
#define CAN4TXIDR1_ID_18_MASK  224
#define CAN4TXIDR1_ID_18_BITNUM  5


/*** CAN4TXIDR2 - MSCAN 4 Transmit Identifier Register 2; 0x000002B2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
  struct {
    byte grpID_7 :8;
  } MergedBits;
} CAN4TXIDR2STR;
