frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile CAN4TXIDR2STR _CAN4TXIDR2 @(REG_BASE + 0x000002B2);
#define CAN4TXIDR2 _CAN4TXIDR2.Byte
#define CAN4TXIDR2_ID7 _CAN4TXIDR2.Bits.ID7
#define CAN4TXIDR2_ID8 _CAN4TXIDR2.Bits.ID8
#define CAN4TXIDR2_ID9 _CAN4TXIDR2.Bits.ID9
#define CAN4TXIDR2_ID10 _CAN4TXIDR2.Bits.ID10
#define CAN4TXIDR2_ID11 _CAN4TXIDR2.Bits.ID11
#define CAN4TXIDR2_ID12 _CAN4TXIDR2.Bits.ID12
#define CAN4TXIDR2_ID13 _CAN4TXIDR2.Bits.ID13
#define CAN4TXIDR2_ID14 _CAN4TXIDR2.Bits.ID14
#define CAN4TXIDR2_ID_7 _CAN4TXIDR2.MergedBits.grpID_7
#define CAN4TXIDR2_ID CAN4TXIDR2_ID_7

#define CAN4TXIDR2_ID7_MASK   1
#define CAN4TXIDR2_ID8_MASK   2
#define CAN4TXIDR2_ID9_MASK   4
#define CAN4TXIDR2_ID10_MASK   8
#define CAN4TXIDR2_ID11_MASK   16
#define CAN4TXIDR2_ID12_MASK   32
#define CAN4TXIDR2_ID13_MASK   64
#define CAN4TXIDR2_ID14_MASK   128
#define CAN4TXIDR2_ID_7_MASK  255
#define CAN4TXIDR2_ID_7_BITNUM  0


/*** CAN4TXIDR3 - MSCAN 4 Transmit Identifier Register 3; 0x000002B3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN4TXIDR3STR;
extern volatile CAN4TXIDR3STR _CAN4TXIDR3 @(REG_BASE + 0x000002B3);
#define CAN4TXIDR3 _CAN4TXIDR3.Byte
#define CAN4TXIDR3_RTR _CAN4TXIDR3.Bits.RTR
#define CAN4TXIDR3_ID0 _CAN4TXIDR3.Bits.ID0
#define CAN4TXIDR3_ID1 _CAN4TXIDR3.Bits.ID1
#define CAN4TXIDR3_ID2 _CAN4TXIDR3.Bits.ID2
#define CAN4TXIDR3_ID3 _CAN4TXIDR3.Bits.ID3
#define CAN4TXIDR3_ID4 _CAN4TXIDR3.Bits.ID4
#define CAN4TXIDR3_ID5 _CAN4TXIDR3.Bits.ID5
#define CAN4TXIDR3_ID6 _CAN4TXIDR3.Bits.ID6
#define CAN4TXIDR3_ID _CAN4TXIDR3.MergedBits.grpID

#define CAN4TXIDR3_RTR_MASK   1
#define CAN4TXIDR3_ID0_MASK   2
#define CAN4TXIDR3_ID1_MASK   4
#define CAN4TXIDR3_ID2_MASK   8
#define CAN4TXIDR3_ID3_MASK   16
#define CAN4TXIDR3_ID4_MASK   32
#define CAN4TXIDR3_ID5_MASK   64
#define CAN4TXIDR3_ID6_MASK   128
#define CAN4TXIDR3_ID_MASK  254
#define CAN4TXIDR3_ID_BITNUM  1


/*** CAN4TXDSR0 - MSCAN 4 Transmit Data Segment Register 0; 0x000002B4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR0STR;
extern volatile CAN4TXDSR0STR _CAN4TXDSR0 @(REG_BASE + 0x000002B4);
#define CAN4TXDSR0 _CAN4TXDSR0.Byte
#define CAN4TXDSR0_DB0 _CAN4TXDSR0.Bits.DB0
#define CAN4TXDSR0_DB1 _CAN4TXDSR0.Bits.DB1
#define CAN4TXDSR0_DB2 _CAN4TXDSR0.Bits.DB2
#define CAN4TXDSR0_DB3 _CAN4TXDSR0.Bits.DB3
#define CAN4TXDSR0_DB4 _CAN4TXDSR0.Bits.DB4
#define CAN4TXDSR0_DB5 _CAN4TXDSR0.Bits.DB5
#define CAN4TXDSR0_DB6 _CAN4TXDSR0.Bits.DB6
#define CAN4TXDSR0_DB7 _CAN4TXDSR0.Bits.DB7
/* CAN4TXDSR_ARR: Access 8 CAN4TXDSRx registers in a array */
#define CAN4TXDSR_ARR ((Byte *) &CAN4TXDSR0)
#define CAN4TXDSR0_DB _CAN4TXDSR0.MergedBits.grpDB

#define CAN4TXDSR0_DB0_MASK   1
#define CAN4TXDSR0_DB1_MASK   2
#define CAN4TXDSR0_DB2_MASK   4
#define CAN4TXDSR0_DB3_MASK   8
#define CAN4TXDSR0_DB4_MASK   16
#define CAN4TXDSR0_DB5_MASK   32
#define CAN4TXDSR0_DB6_MASK   64
#define CAN4TXDSR0_DB7_MASK   128
#define CAN4TXDSR0_DB_MASK  255
#define CAN4TXDSR0_DB_BITNUM  0


/*** CAN4TXDSR1 - MSCAN 4 Transmit Data Segment Register 1; 0x000002B5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR1STR;
extern volatile CAN4TXDSR1STR _CAN4TXDSR1 @(REG_BASE + 0x000002B5);
#define CAN4TXDSR1 _CAN4TXDSR1.Byte
#define CAN4TXDSR1_DB0 _CAN4TXDSR1.Bits.DB0
#define CAN4TXDSR1_DB1 _CAN4TXDSR1.Bits.DB1
#define CAN4TXDSR1_DB2 _CAN4TXDSR1.Bits.DB2
#define CAN4TXDSR1_DB3 _CAN4TXDSR1.Bits.DB3
#define CAN4TXDSR1_DB4 _CAN4TXDSR1.Bits.DB4
#define CAN4TXDSR1_DB5 _CAN4TXDSR1.Bits.DB5
#define CAN4TXDSR1_DB6 _CAN4TXDSR1.Bits.DB6
#define CAN4TXDSR1_DB7 _CAN4TXDSR1.Bits.DB7
#define CAN4TXDSR1_DB _CAN4TXDSR1.MergedBits.grpDB

#define CAN4TXDSR1_DB0_MASK   1
#define CAN4TXDSR1_DB1_MASK   2
#define CAN4TXDSR1_DB2_MASK   4
#define CAN4TXDSR1_DB3_MASK   8
#define CAN4TXDSR1_DB4_MASK   16
#define CAN4TXDSR1_DB5_MASK   32
#define CAN4TXDSR1_DB6_MASK   64
#define CAN4TXDSR1_DB7_MASK   128
#define CAN4TXDSR1_DB_MASK  255
#define CAN4TXDSR1_DB_BITNUM  0


/*** CAN4TXDSR2 - MSCAN 4 Transmit Data Segment Register 2; 0x000002B6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR2STR;
