frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile CAN4TXDSR2STR _CAN4TXDSR2 @(REG_BASE + 0x000002B6);
#define CAN4TXDSR2 _CAN4TXDSR2.Byte
#define CAN4TXDSR2_DB0 _CAN4TXDSR2.Bits.DB0
#define CAN4TXDSR2_DB1 _CAN4TXDSR2.Bits.DB1
#define CAN4TXDSR2_DB2 _CAN4TXDSR2.Bits.DB2
#define CAN4TXDSR2_DB3 _CAN4TXDSR2.Bits.DB3
#define CAN4TXDSR2_DB4 _CAN4TXDSR2.Bits.DB4
#define CAN4TXDSR2_DB5 _CAN4TXDSR2.Bits.DB5
#define CAN4TXDSR2_DB6 _CAN4TXDSR2.Bits.DB6
#define CAN4TXDSR2_DB7 _CAN4TXDSR2.Bits.DB7
#define CAN4TXDSR2_DB _CAN4TXDSR2.MergedBits.grpDB

#define CAN4TXDSR2_DB0_MASK   1
#define CAN4TXDSR2_DB1_MASK   2
#define CAN4TXDSR2_DB2_MASK   4
#define CAN4TXDSR2_DB3_MASK   8
#define CAN4TXDSR2_DB4_MASK   16
#define CAN4TXDSR2_DB5_MASK   32
#define CAN4TXDSR2_DB6_MASK   64
#define CAN4TXDSR2_DB7_MASK   128
#define CAN4TXDSR2_DB_MASK  255
#define CAN4TXDSR2_DB_BITNUM  0


/*** CAN4TXDSR3 - MSCAN 4 Transmit Data Segment Register 3; 0x000002B7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR3STR;
extern volatile CAN4TXDSR3STR _CAN4TXDSR3 @(REG_BASE + 0x000002B7);
#define CAN4TXDSR3 _CAN4TXDSR3.Byte
#define CAN4TXDSR3_DB0 _CAN4TXDSR3.Bits.DB0
#define CAN4TXDSR3_DB1 _CAN4TXDSR3.Bits.DB1
#define CAN4TXDSR3_DB2 _CAN4TXDSR3.Bits.DB2
#define CAN4TXDSR3_DB3 _CAN4TXDSR3.Bits.DB3
#define CAN4TXDSR3_DB4 _CAN4TXDSR3.Bits.DB4
#define CAN4TXDSR3_DB5 _CAN4TXDSR3.Bits.DB5
#define CAN4TXDSR3_DB6 _CAN4TXDSR3.Bits.DB6
#define CAN4TXDSR3_DB7 _CAN4TXDSR3.Bits.DB7
#define CAN4TXDSR3_DB _CAN4TXDSR3.MergedBits.grpDB

#define CAN4TXDSR3_DB0_MASK   1
#define CAN4TXDSR3_DB1_MASK   2
#define CAN4TXDSR3_DB2_MASK   4
#define CAN4TXDSR3_DB3_MASK   8
#define CAN4TXDSR3_DB4_MASK   16
#define CAN4TXDSR3_DB5_MASK   32
#define CAN4TXDSR3_DB6_MASK   64
#define CAN4TXDSR3_DB7_MASK   128
#define CAN4TXDSR3_DB_MASK  255
#define CAN4TXDSR3_DB_BITNUM  0


/*** CAN4TXDSR4 - MSCAN 4 Transmit Data Segment Register 4; 0x000002B8 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR4STR;
extern volatile CAN4TXDSR4STR _CAN4TXDSR4 @(REG_BASE + 0x000002B8);
#define CAN4TXDSR4 _CAN4TXDSR4.Byte
#define CAN4TXDSR4_DB0 _CAN4TXDSR4.Bits.DB0
#define CAN4TXDSR4_DB1 _CAN4TXDSR4.Bits.DB1
#define CAN4TXDSR4_DB2 _CAN4TXDSR4.Bits.DB2
#define CAN4TXDSR4_DB3 _CAN4TXDSR4.Bits.DB3
#define CAN4TXDSR4_DB4 _CAN4TXDSR4.Bits.DB4
#define CAN4TXDSR4_DB5 _CAN4TXDSR4.Bits.DB5
#define CAN4TXDSR4_DB6 _CAN4TXDSR4.Bits.DB6
#define CAN4TXDSR4_DB7 _CAN4TXDSR4.Bits.DB7
#define CAN4TXDSR4_DB _CAN4TXDSR4.MergedBits.grpDB

#define CAN4TXDSR4_DB0_MASK   1
#define CAN4TXDSR4_DB1_MASK   2
#define CAN4TXDSR4_DB2_MASK   4
#define CAN4TXDSR4_DB3_MASK   8
#define CAN4TXDSR4_DB4_MASK   16
#define CAN4TXDSR4_DB5_MASK   32
#define CAN4TXDSR4_DB6_MASK   64
#define CAN4TXDSR4_DB7_MASK   128
#define CAN4TXDSR4_DB_MASK  255
#define CAN4TXDSR4_DB_BITNUM  0


/*** CAN4TXDSR5 - MSCAN 4 Transmit Data Segment Register 5; 0x000002B9 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR5STR;
extern volatile CAN4TXDSR5STR _CAN4TXDSR5 @(REG_BASE + 0x000002B9);
#define CAN4TXDSR5 _CAN4TXDSR5.Byte
#define CAN4TXDSR5_DB0 _CAN4TXDSR5.Bits.DB0
#define CAN4TXDSR5_DB1 _CAN4TXDSR5.Bits.DB1
#define CAN4TXDSR5_DB2 _CAN4TXDSR5.Bits.DB2
#define CAN4TXDSR5_DB3 _CAN4TXDSR5.Bits.DB3
#define CAN4TXDSR5_DB4 _CAN4TXDSR5.Bits.DB4
#define CAN4TXDSR5_DB5 _CAN4TXDSR5.Bits.DB5
#define CAN4TXDSR5_DB6 _CAN4TXDSR5.Bits.DB6
#define CAN4TXDSR5_DB7 _CAN4TXDSR5.Bits.DB7
#define CAN4TXDSR5_DB _CAN4TXDSR5.MergedBits.grpDB

#define CAN4TXDSR5_DB0_MASK   1
#define CAN4TXDSR5_DB1_MASK   2
#define CAN4TXDSR5_DB2_MASK   4
#define CAN4TXDSR5_DB3_MASK   8
#define CAN4TXDSR5_DB4_MASK   16
#define CAN4TXDSR5_DB5_MASK   32
#define CAN4TXDSR5_DB6_MASK   64
#define CAN4TXDSR5_DB7_MASK   128
#define CAN4TXDSR5_DB_MASK  255
#define CAN4TXDSR5_DB_BITNUM  0


/*** CAN4TXDSR6 - MSCAN 4 Transmit Data Segment Register 6; 0x000002BA ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR6STR;
extern volatile CAN4TXDSR6STR _CAN4TXDSR6 @(REG_BASE + 0x000002BA);
#define CAN4TXDSR6 _CAN4TXDSR6.Byte
#define CAN4TXDSR6_DB0 _CAN4TXDSR6.Bits.DB0
#define CAN4TXDSR6_DB1 _CAN4TXDSR6.Bits.DB1
#define CAN4TXDSR6_DB2 _CAN4TXDSR6.Bits.DB2
#define CAN4TXDSR6_DB3 _CAN4TXDSR6.Bits.DB3
#define CAN4TXDSR6_DB4 _CAN4TXDSR6.Bits.DB4
#define CAN4TXDSR6_DB5 _CAN4TXDSR6.Bits.DB5
#define CAN4TXDSR6_DB6 _CAN4TXDSR6.Bits.DB6
#define CAN4TXDSR6_DB7 _CAN4TXDSR6.Bits.DB7
#define CAN4TXDSR6_DB _CAN4TXDSR6.MergedBits.grpDB

#define CAN4TXDSR6_DB0_MASK   1
#define CAN4TXDSR6_DB1_MASK   2
#define CAN4TXDSR6_DB2_MASK   4
#define CAN4TXDSR6_DB3_MASK   8
#define CAN4TXDSR6_DB4_MASK   16
#define CAN4TXDSR6_DB5_MASK   32
#define CAN4TXDSR6_DB6_MASK   64
#define CAN4TXDSR6_DB7_MASK   128
#define CAN4TXDSR6_DB_MASK  255
#define CAN4TXDSR6_DB_BITNUM  0


/*** CAN4TXDSR7 - MSCAN 4 Transmit Data Segment Register 7; 0x000002BB ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
  struct {
    byte grpDB   :8;
  } MergedBits;
} CAN4TXDSR7STR;
extern volatile CAN4TXDSR7STR _CAN4TXDSR7 @(REG_BASE + 0x000002BB);
#define CAN4TXDSR7 _CAN4TXDSR7.Byte
#define CAN4TXDSR7_DB0 _CAN4TXDSR7.Bits.DB0
#define CAN4TXDSR7_DB1 _CAN4TXDSR7.Bits.DB1
#define CAN4TXDSR7_DB2 _CAN4TXDSR7.Bits.DB2
#define CAN4TXDSR7_DB3 _CAN4TXDSR7.Bits.DB3
#define CAN4TXDSR7_DB4 _CAN4TXDSR7.Bits.DB4
#define CAN4TXDSR7_DB5 _CAN4TXDSR7.Bits.DB5
#define CAN4TXDSR7_DB6 _CAN4TXDSR7.Bits.DB6
#define CAN4TXDSR7_DB7 _CAN4TXDSR7.Bits.DB7
#define CAN4TXDSR7_DB _CAN4TXDSR7.MergedBits.grpDB

#define CAN4TXDSR7_DB0_MASK   1
#define CAN4TXDSR7_DB1_MASK   2
#define CAN4TXDSR7_DB2_MASK   4
#define CAN4TXDSR7_DB3_MASK   8
#define CAN4TXDSR7_DB4_MASK   16
#define CAN4TXDSR7_DB5_MASK   32
#define CAN4TXDSR7_DB6_MASK   64
#define CAN4TXDSR7_DB7_MASK   128
#define CAN4TXDSR7_DB_MASK  255
#define CAN4TXDSR7_DB_BITNUM  0


/*** CAN4TXDLR - MSCAN 4 Transmit Data Length Register; 0x000002BC ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4TXDLRSTR;
extern volatile CAN4TXDLRSTR _CAN4TXDLR @(REG_BASE + 0x000002BC);
#define CAN4TXDLR _CAN4TXDLR.Byte
#define CAN4TXDLR_DLC0 _CAN4TXDLR.Bits.DLC0
#define CAN4TXDLR_DLC1 _CAN4TXDLR.Bits.DLC1
#define CAN4TXDLR_DLC2 _CAN4TXDLR.Bits.DLC2
#define CAN4TXDLR_DLC3 _CAN4TXDLR.Bits.DLC3
#define CAN4TXDLR_DLC _CAN4TXDLR.MergedBits.grpDLC

#define CAN4TXDLR_DLC0_MASK   1
#define CAN4TXDLR_DLC1_MASK   2
#define CAN4TXDLR_DLC2_MASK   4
#define CAN4TXDLR_DLC3_MASK   8
#define CAN4TXDLR_DLC_MASK  15
#define CAN4TXDLR_DLC_BITNUM  0


/*** CAN4TXTBPR - MSCAN 4 Transmit Buffer Priority; 0x000002BD ***/
typedef union {
  byte Byte;
  struct {
    byte PRIO0       :1;                                       /* Transmit Buffer Priority Bit 0 */
    byte PRIO1       :1;                                       /* Transmit Buffer Priority Bit 1 */
    byte PRIO2       :1;                                       /* Transmit Buffer Priority Bit 2 */
    byte PRIO3       :1;                                       /* Transmit Buffer Priority Bit 3 */
    byte PRIO4       :1;                                       /* Transmit Buffer Priority Bit 4 */
    byte PRIO5       :1;                                       /* Transmit Buffer Priority Bit 5 */
    byte PRIO6       :1;                                       /* Transmit Buffer Priority Bit 6 */
    byte PRIO7       :1;                                       /* Transmit Buffer Priority Bit 7 */
  } Bits;
  struct {
    byte grpPRIO :8;
  } MergedBits;
} CAN4TXTBPRSTR;
extern volatile CAN4TXTBPRSTR _CAN4TXTBPR @(REG_BASE + 0x000002BD);
#define CAN4TXTBPR _CAN4TXTBPR.Byte
#define CAN4TXTBPR_PRIO0 _CAN4TXTBPR.Bits.PRIO0
#define CAN4TXTBPR_PRIO1 _CAN4TXTBPR.Bits.PRIO1
#define CAN4TXTBPR_PRIO2 _CAN4TXTBPR.Bits.PRIO2
#define CAN4TXTBPR_PRIO3 _CAN4TXTBPR.Bits.PRIO3
#define CAN4TXTBPR_PRIO4 _CAN4TXTBPR.Bits.PRIO4
#define CAN4TXTBPR_PRIO5 _CAN4TXTBPR.Bits.PRIO5
#define CAN4TXTBPR_PRIO6 _CAN4TXTBPR.Bits.PRIO6
#define CAN4TXTBPR_PRIO7 _CAN4TXTBPR.Bits.PRIO7
#define CAN4TXTBPR_PRIO _CAN4TXTBPR.MergedBits.grpPRIO

#define CAN4TXTBPR_PRIO0_MASK   1
#define CAN4TXTBPR_PRIO1_MASK   2
#define CAN4TXTBPR_PRIO2_MASK   4
#define CAN4TXTBPR_PRIO3_MASK   8
#define CAN4TXTBPR_PRIO4_MASK   16
#define CAN4TXTBPR_PRIO5_MASK   32
#define CAN4TXTBPR_PRIO6_MASK   64
#define CAN4TXTBPR_PRIO7_MASK   128
#define CAN4TXTBPR_PRIO_MASK  255
#define CAN4TXTBPR_PRIO_BITNUM  0


/*** CAN4TXTSR - MSCAN 4 Transmit Time Stamp Register; 0x000002BE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN4TXTSRH - MSCAN 4 Transmit Time Stamp Register High; 0x000002BE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
      struct {
        byte grpTSR_8 :8;
      } MergedBits;
    } CAN4TXTSRHSTR;
    #define CAN4TXTSRH _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Byte
    #define CAN4TXTSRH_TSR8 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR8
    #define CAN4TXTSRH_TSR9 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR9
    #define CAN4TXTSRH_TSR10 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR10
    #define CAN4TXTSRH_TSR11 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR11
    #define CAN4TXTSRH_TSR12 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR12
    #define CAN4TXTSRH_TSR13 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR13
    #define CAN4TXTSRH_TSR14 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR14
    #define CAN4TXTSRH_TSR15 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.Bits.TSR15
    
    #define CAN4TXTSRH_TSR_8 _CAN4TXTSR.Overlap_STR.CAN4TXTSRHSTR.MergedBits.grpTSR_8
    #define CAN4TXTSRH_TSR CAN4TXTSRH_TSR_8
    
    #define CAN4TXTSRH_TSR8_MASK   1
    #define CAN4TXTSRH_TSR9_MASK   2
    #define CAN4TXTSRH_TSR10_MASK   4
    #define CAN4TXTSRH_TSR11_MASK   8
    #define CAN4TXTSRH_TSR12_MASK   16
    #define CAN4TXTSRH_TSR13_MASK   32
    #define CAN4TXTSRH_TSR14_MASK   64
    #define CAN4TXTSRH_TSR15_MASK   128
    #define CAN4TXTSRH_TSR_8_MASK  255
    #define CAN4TXTSRH_TSR_8_BITNUM  0


    /*** CAN4TXTSRL - MSCAN 4 Transmit Time Stamp Register Low; 0x000002BF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
      struct {
        byte grpTSR :8;
      } MergedBits;
    } CAN4TXTSRLSTR;
    #define CAN4TXTSRL _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Byte
    #define CAN4TXTSRL_TSR0 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR0
    #define CAN4TXTSRL_TSR1 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR1
    #define CAN4TXTSRL_TSR2 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR2
    #define CAN4TXTSRL_TSR3 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR3
    #define CAN4TXTSRL_TSR4 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR4
    #define CAN4TXTSRL_TSR5 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR5
    #define CAN4TXTSRL_TSR6 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR6
    #define CAN4TXTSRL_TSR7 _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.Bits.TSR7
    
    #define CAN4TXTSRL_TSR _CAN4TXTSR.Overlap_STR.CAN4TXTSRLSTR.MergedBits.grpTSR
    
    #define CAN4TXTSRL_TSR0_MASK   1
    #define CAN4TXTSRL_TSR1_MASK   2
    #define CAN4TXTSRL_TSR2_MASK   4
    #define CAN4TXTSRL_TSR3_MASK   8
    #define CAN4TXTSRL_TSR4_MASK   16
    #define CAN4TXTSRL_TSR5_MASK   32
    #define CAN4TXTSRL_TSR6_MASK   64
    #define CAN4TXTSRL_TSR7_MASK   128
    #define CAN4TXTSRL_TSR_MASK  255
    #define CAN4TXTSRL_TSR_BITNUM  0

  } Overlap_STR;

