frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
    /*** ATD0DR7L - ATD 0 Conversion Result Register 7 Low; 0x000002DF ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpBIT_6 :2;
      } MergedBits;
    } ATD0DR7LSTR;
    #define ATD0DR7L _ATD0DR7.Overlap_STR.ATD0DR7LSTR.Byte
    #define ATD0DR7L_BIT6 _ATD0DR7.Overlap_STR.ATD0DR7LSTR.Bits.BIT6
    #define ATD0DR7L_BIT7 _ATD0DR7.Overlap_STR.ATD0DR7LSTR.Bits.BIT7
    
    #define ATD0DR7L_BIT_6 _ATD0DR7.Overlap_STR.ATD0DR7LSTR.MergedBits.grpBIT_6
    #define ATD0DR7L_BIT ATD0DR7L_BIT_6
    
    #define ATD0DR7L_BIT6_MASK   64
    #define ATD0DR7L_BIT7_MASK   128
    #define ATD0DR7L_BIT_6_MASK  192
    #define ATD0DR7L_BIT_6_BITNUM  6

  } Overlap_STR;

  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
  struct {
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpBIT_6 :10;
  } MergedBits;
} ATD0DR7STR;
extern volatile ATD0DR7STR _ATD0DR7 @(REG_BASE + 0x000002DE);
#define ATD0DR7 _ATD0DR7.Word
#define ATD0DR7_BIT6 _ATD0DR7.Bits.BIT6
#define ATD0DR7_BIT7 _ATD0DR7.Bits.BIT7
#define ATD0DR7_BIT8 _ATD0DR7.Bits.BIT8
#define ATD0DR7_BIT9 _ATD0DR7.Bits.BIT9
#define ATD0DR7_BIT10 _ATD0DR7.Bits.BIT10
#define ATD0DR7_BIT11 _ATD0DR7.Bits.BIT11
#define ATD0DR7_BIT12 _ATD0DR7.Bits.BIT12
#define ATD0DR7_BIT13 _ATD0DR7.Bits.BIT13
#define ATD0DR7_BIT14 _ATD0DR7.Bits.BIT14
#define ATD0DR7_BIT15 _ATD0DR7.Bits.BIT15
#define ATD0DR7_BIT_6 _ATD0DR7.MergedBits.grpBIT_6
#define ATD0DR7_BIT ATD0DR7_BIT_6

#define ATD0DR7_BIT6_MASK   64
#define ATD0DR7_BIT7_MASK   128
#define ATD0DR7_BIT8_MASK   256
#define ATD0DR7_BIT9_MASK   512
#define ATD0DR7_BIT10_MASK   1024
#define ATD0DR7_BIT11_MASK   2048
#define ATD0DR7_BIT12_MASK   4096
#define ATD0DR7_BIT13_MASK   8192
#define ATD0DR7_BIT14_MASK   16384
#define ATD0DR7_BIT15_MASK   32768
#define ATD0DR7_BIT_6_MASK  65472
#define ATD0DR7_BIT_6_BITNUM  6


/*** VREGCTRL - VREG_3V3 - Control Register; 0x000002F1 ***/
typedef union {
  byte Byte;
  struct {
    byte LVIF        :1;                                       /* Low Voltage Interrupt Flag */
    byte LVIE        :1;                                       /* Low Voltage Interrupt Enable Bit */
    byte LVDS        :1;                                       /* Low Voltage Detect Status Bit */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} VREGCTRLSTR;
extern volatile VREGCTRLSTR _VREGCTRL @(REG_BASE + 0x000002F1);
#define VREGCTRL _VREGCTRL.Byte
#define VREGCTRL_LVIF _VREGCTRL.Bits.LVIF
#define VREGCTRL_LVIE _VREGCTRL.Bits.LVIE
#define VREGCTRL_LVDS _VREGCTRL.Bits.LVDS

#define VREGCTRL_LVIF_MASK   1
#define VREGCTRL_LVIE_MASK   2
#define VREGCTRL_LVDS_MASK   4


/*** VREGAPICL - VREG_3V3 - Autonomous Periodical Interrupt Control Register; 0x000002F2 ***/
typedef union {
  byte Byte;
  struct {
    byte APIF        :1;                                       /* Autonomous Periodical Interrupt Flag */
    byte APIE        :1;                                       /* Autonomous Periodical Interrupt Enable Bit */
    byte APIFE       :1;                                       /* Autonomous Periodical Interrupt Feature Enable Bit */
    byte APIR0       :1;                                       /* Autonomous Periodical Interrupt Rate Bit 0 */
    byte APIR1       :1;                                       /* Autonomous Periodical Interrupt Rate Bit 1 */
    byte APIR2       :1;                                       /* Autonomous Periodical Interrupt Rate Bit 2 */
    byte APIR3       :1;                                       /* Autonomous Periodical Interrupt Rate Bit 3 */
    byte APICLK      :1;                                       /* Autonomous Periodical Interrupt Clock Select Bit */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpAPIR :4;
    byte         :1;
  } MergedBits;
} VREGAPICLSTR;
extern volatile VREGAPICLSTR _VREGAPICL @(REG_BASE + 0x000002F2);
#define VREGAPICL _VREGAPICL.Byte
#define VREGAPICL_APIF _VREGAPICL.Bits.APIF
#define VREGAPICL_APIE _VREGAPICL.Bits.APIE
#define VREGAPICL_APIFE _VREGAPICL.Bits.APIFE
#define VREGAPICL_APIR0 _VREGAPICL.Bits.APIR0
#define VREGAPICL_APIR1 _VREGAPICL.Bits.APIR1
#define VREGAPICL_APIR2 _VREGAPICL.Bits.APIR2
#define VREGAPICL_APIR3 _VREGAPICL.Bits.APIR3
#define VREGAPICL_APICLK _VREGAPICL.Bits.APICLK
#define VREGAPICL_APIR _VREGAPICL.MergedBits.grpAPIR

#define VREGAPICL_APIF_MASK   1
#define VREGAPICL_APIE_MASK   2
#define VREGAPICL_APIFE_MASK   4
#define VREGAPICL_APIR0_MASK   8
#define VREGAPICL_APIR1_MASK   16
#define VREGAPICL_APIR2_MASK   32
#define VREGAPICL_APIR3_MASK   64
#define VREGAPICL_APICLK_MASK   128
#define VREGAPICL_APIR_MASK  120
#define VREGAPICL_APIR_BITNUM  3


/*** VREGAPITR - VREG_3V3 - Autonomous Periodical Interrupt Trimming Register; 0x000002F3 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte APITR0      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 0 */
    byte APITR1      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 1 */
    byte APITR2      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 2 */
    byte APITR3      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 3 */
    byte APITR4      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 4 */
    byte APITR5      :1;                                       /* Autonomous Periodical Interrupt Period Trimming Bit 5 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpAPITR :6;
  } MergedBits;
} VREGAPITRSTR;
extern volatile VREGAPITRSTR _VREGAPITR @(REG_BASE + 0x000002F3);
#define VREGAPITR _VREGAPITR.Byte
#define VREGAPITR_APITR0 _VREGAPITR.Bits.APITR0
#define VREGAPITR_APITR1 _VREGAPITR.Bits.APITR1
#define VREGAPITR_APITR2 _VREGAPITR.Bits.APITR2
#define VREGAPITR_APITR3 _VREGAPITR.Bits.APITR3
#define VREGAPITR_APITR4 _VREGAPITR.Bits.APITR4
#define VREGAPITR_APITR5 _VREGAPITR.Bits.APITR5
#define VREGAPITR_APITR _VREGAPITR.MergedBits.grpAPITR

#define VREGAPITR_APITR0_MASK   4
#define VREGAPITR_APITR1_MASK   8
#define VREGAPITR_APITR2_MASK   16
#define VREGAPITR_APITR3_MASK   32
#define VREGAPITR_APITR4_MASK   64
#define VREGAPITR_APITR5_MASK   128
#define VREGAPITR_APITR_MASK  252
#define VREGAPITR_APITR_BITNUM  2


/*** PWME - PWM Enable Register; 0x00000300 ***/
typedef union {
  byte Byte;
  struct {
    byte PWME0       :1;                                       /* Pulse Width Channel 0 Enable */
    byte PWME1       :1;                                       /* Pulse Width Channel 1 Enable */
    byte PWME2       :1;                                       /* Pulse Width Channel 2 Enable */
    byte PWME3       :1;                                       /* Pulse Width Channel 3 Enable */
    byte PWME4       :1;                                       /* Pulse Width Channel 4 Enable */
    byte PWME5       :1;                                       /* Pulse Width Channel 5 Enable */
    byte PWME6       :1;                                       /* Pulse Width Channel 6 Enable */
    byte PWME7       :1;                                       /* Pulse Width Channel 7 Enable */
  } Bits;
  struct {
    byte grpPWME :8;
  } MergedBits;
} PWMESTR;
extern volatile PWMESTR _PWME @(REG_BASE + 0x00000300);
#define PWME _PWME.Byte
#define PWME_PWME0 _PWME.Bits.PWME0
#define PWME_PWME1 _PWME.Bits.PWME1
#define PWME_PWME2 _PWME.Bits.PWME2
#define PWME_PWME3 _PWME.Bits.PWME3
#define PWME_PWME4 _PWME.Bits.PWME4
#define PWME_PWME5 _PWME.Bits.PWME5
#define PWME_PWME6 _PWME.Bits.PWME6
#define PWME_PWME7 _PWME.Bits.PWME7
#define PWME_PWME _PWME.MergedBits.grpPWME

#define PWME_PWME0_MASK   1
#define PWME_PWME1_MASK   2
#define PWME_PWME2_MASK   4
#define PWME_PWME3_MASK   8
#define PWME_PWME4_MASK   16
#define PWME_PWME5_MASK   32
#define PWME_PWME6_MASK   64
#define PWME_PWME7_MASK   128
#define PWME_PWME_MASK  255
#define PWME_PWME_BITNUM  0


/*** PWMPOL - PWM Polarity Register; 0x00000301 ***/
typedef union {
  byte Byte;
  struct {
    byte PPOL0       :1;                                       /* Pulse Width Channel 0 Polarity */
    byte PPOL1       :1;                                       /* Pulse Width Channel 1 Polarity */
    byte PPOL2       :1;                                       /* Pulse Width Channel 2 Polarity */
    byte PPOL3       :1;                                       /* Pulse Width Channel 3 Polarity */
    byte PPOL4       :1;                                       /* Pulse Width Channel 4 Polarity */
    byte PPOL5       :1;                                       /* Pulse Width Channel 5 Polarity */
    byte PPOL6       :1;                                       /* Pulse Width Channel 6 Polarity */
    byte PPOL7       :1;                                       /* Pulse Width Channel 7 Polarity */
  } Bits;
  struct {
    byte grpPPOL :8;
  } MergedBits;
} PWMPOLSTR;
