frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
extern volatile PWMSCLBSTR _PWMSCLB @(REG_BASE + 0x00000309);
#define PWMSCLB _PWMSCLB.Byte
#define PWMSCLB_BIT0 _PWMSCLB.Bits.BIT0
#define PWMSCLB_BIT1 _PWMSCLB.Bits.BIT1
#define PWMSCLB_BIT2 _PWMSCLB.Bits.BIT2
#define PWMSCLB_BIT3 _PWMSCLB.Bits.BIT3
#define PWMSCLB_BIT4 _PWMSCLB.Bits.BIT4
#define PWMSCLB_BIT5 _PWMSCLB.Bits.BIT5
#define PWMSCLB_BIT6 _PWMSCLB.Bits.BIT6
#define PWMSCLB_BIT7 _PWMSCLB.Bits.BIT7
#define PWMSCLB_BIT _PWMSCLB.MergedBits.grpBIT

#define PWMSCLB_BIT0_MASK   1
#define PWMSCLB_BIT1_MASK   2
#define PWMSCLB_BIT2_MASK   4
#define PWMSCLB_BIT3_MASK   8
#define PWMSCLB_BIT4_MASK   16
#define PWMSCLB_BIT5_MASK   32
#define PWMSCLB_BIT6_MASK   64
#define PWMSCLB_BIT7_MASK   128
#define PWMSCLB_BIT_MASK  255
#define PWMSCLB_BIT_BITNUM  0


/*** PWMCNT01 - PWM Channel Counter 01 Register; 0x0000030C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMCNT0 - PWM Channel Counter 0 Register; 0x0000030C ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT0STR;
    #define PWMCNT0 _PWMCNT01.Overlap_STR.PWMCNT0STR.Byte
    
    /* PWMCNT_ARR: Access 8 PWMCNTx registers in a array */
    #define PWMCNT_ARR ((Byte *) &PWMCNT0)
    #define PWMCNT0_BIT _PWMCNT01.Overlap_STR.PWMCNT0STR.MergedBits.grpBIT
    
    #define PWMCNT0_BIT_MASK  255
    #define PWMCNT0_BIT_BITNUM  0


    /*** PWMCNT1 - PWM Channel Counter 1 Register; 0x0000030D ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT1STR;
    #define PWMCNT1 _PWMCNT01.Overlap_STR.PWMCNT1STR.Byte
    
    #define PWMCNT1_BIT _PWMCNT01.Overlap_STR.PWMCNT1STR.MergedBits.grpBIT
    
    #define PWMCNT1_BIT_MASK  255
    #define PWMCNT1_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMCNT01STR;
extern volatile PWMCNT01STR _PWMCNT01 @(REG_BASE + 0x0000030C);
#define PWMCNT01 _PWMCNT01.Word
#define PWMCNT01_BIT _PWMCNT01.MergedBits.grpBIT

#define PWMCNT01_BIT_MASK  65535
#define PWMCNT01_BIT_BITNUM  0


/*** PWMCNT23 - PWM Channel Counter 23 Register; 0x0000030E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMCNT2 - PWM Channel Counter 2 Register; 0x0000030E ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT2STR;
    #define PWMCNT2 _PWMCNT23.Overlap_STR.PWMCNT2STR.Byte
    
    #define PWMCNT2_BIT _PWMCNT23.Overlap_STR.PWMCNT2STR.MergedBits.grpBIT
    
    #define PWMCNT2_BIT_MASK  255
    #define PWMCNT2_BIT_BITNUM  0


    /*** PWMCNT3 - PWM Channel Counter 3 Register; 0x0000030F ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT3STR;
    #define PWMCNT3 _PWMCNT23.Overlap_STR.PWMCNT3STR.Byte
    
    #define PWMCNT3_BIT _PWMCNT23.Overlap_STR.PWMCNT3STR.MergedBits.grpBIT
    
    #define PWMCNT3_BIT_MASK  255
    #define PWMCNT3_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMCNT23STR;
extern volatile PWMCNT23STR _PWMCNT23 @(REG_BASE + 0x0000030E);
#define PWMCNT23 _PWMCNT23.Word
#define PWMCNT23_BIT _PWMCNT23.MergedBits.grpBIT

#define PWMCNT23_BIT_MASK  65535
#define PWMCNT23_BIT_BITNUM  0


/*** PWMCNT45 - PWM Channel Counter 45 Register; 0x00000310 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMCNT4 - PWM Channel Counter 4 Register; 0x00000310 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT4STR;
    #define PWMCNT4 _PWMCNT45.Overlap_STR.PWMCNT4STR.Byte
    
    #define PWMCNT4_BIT _PWMCNT45.Overlap_STR.PWMCNT4STR.MergedBits.grpBIT
    
    #define PWMCNT4_BIT_MASK  255
    #define PWMCNT4_BIT_BITNUM  0


    /*** PWMCNT5 - PWM Channel Counter 5 Register; 0x00000311 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT5STR;
    #define PWMCNT5 _PWMCNT45.Overlap_STR.PWMCNT5STR.Byte
    
    #define PWMCNT5_BIT _PWMCNT45.Overlap_STR.PWMCNT5STR.MergedBits.grpBIT
    
    #define PWMCNT5_BIT_MASK  255
    #define PWMCNT5_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMCNT45STR;
extern volatile PWMCNT45STR _PWMCNT45 @(REG_BASE + 0x00000310);
#define PWMCNT45 _PWMCNT45.Word
#define PWMCNT45_BIT _PWMCNT45.MergedBits.grpBIT

#define PWMCNT45_BIT_MASK  65535
#define PWMCNT45_BIT_BITNUM  0


/*** PWMCNT67 - PWM Channel Counter 67 Register; 0x00000312 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMCNT6 - PWM Channel Counter 6 Register; 0x00000312 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT6STR;
    #define PWMCNT6 _PWMCNT67.Overlap_STR.PWMCNT6STR.Byte
    
    #define PWMCNT6_BIT _PWMCNT67.Overlap_STR.PWMCNT6STR.MergedBits.grpBIT
    
    #define PWMCNT6_BIT_MASK  255
    #define PWMCNT6_BIT_BITNUM  0


    /*** PWMCNT7 - PWM Channel Counter 7 Register; 0x00000313 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMCNT7STR;
    #define PWMCNT7 _PWMCNT67.Overlap_STR.PWMCNT7STR.Byte
    
    #define PWMCNT7_BIT _PWMCNT67.Overlap_STR.PWMCNT7STR.MergedBits.grpBIT
    
    #define PWMCNT7_BIT_MASK  255
    #define PWMCNT7_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMCNT67STR;
extern volatile PWMCNT67STR _PWMCNT67 @(REG_BASE + 0x00000312);
#define PWMCNT67 _PWMCNT67.Word
#define PWMCNT67_BIT _PWMCNT67.MergedBits.grpBIT

#define PWMCNT67_BIT_MASK  65535
#define PWMCNT67_BIT_BITNUM  0


/*** PWMPER01 - PWM Channel Period 01 Register; 0x00000314 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMPER0 - PWM Channel Period 0 Register; 0x00000314 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER0STR;
    #define PWMPER0 _PWMPER01.Overlap_STR.PWMPER0STR.Byte
    
    /* PWMPER_ARR: Access 8 PWMPERx registers in a array */
    #define PWMPER_ARR ((Byte *) &PWMPER0)
    #define PWMPER0_BIT _PWMPER01.Overlap_STR.PWMPER0STR.MergedBits.grpBIT
    
    #define PWMPER0_BIT_MASK  255
    #define PWMPER0_BIT_BITNUM  0


    /*** PWMPER1 - PWM Channel Period 1 Register; 0x00000315 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER1STR;
    #define PWMPER1 _PWMPER01.Overlap_STR.PWMPER1STR.Byte
    
