frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
    #define PWMPER1_BIT _PWMPER01.Overlap_STR.PWMPER1STR.MergedBits.grpBIT
    
    #define PWMPER1_BIT_MASK  255
    #define PWMPER1_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMPER01STR;
extern volatile PWMPER01STR _PWMPER01 @(REG_BASE + 0x00000314);
#define PWMPER01 _PWMPER01.Word
#define PWMPER01_BIT _PWMPER01.MergedBits.grpBIT

#define PWMPER01_BIT_MASK  65535
#define PWMPER01_BIT_BITNUM  0


/*** PWMPER23 - PWM Channel Period 23 Register; 0x00000316 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMPER2 - PWM Channel Period 2 Register; 0x00000316 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER2STR;
    #define PWMPER2 _PWMPER23.Overlap_STR.PWMPER2STR.Byte
    
    #define PWMPER2_BIT _PWMPER23.Overlap_STR.PWMPER2STR.MergedBits.grpBIT
    
    #define PWMPER2_BIT_MASK  255
    #define PWMPER2_BIT_BITNUM  0


    /*** PWMPER3 - PWM Channel Period 3 Register; 0x00000317 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER3STR;
    #define PWMPER3 _PWMPER23.Overlap_STR.PWMPER3STR.Byte
    
    #define PWMPER3_BIT _PWMPER23.Overlap_STR.PWMPER3STR.MergedBits.grpBIT
    
    #define PWMPER3_BIT_MASK  255
    #define PWMPER3_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMPER23STR;
extern volatile PWMPER23STR _PWMPER23 @(REG_BASE + 0x00000316);
#define PWMPER23 _PWMPER23.Word
#define PWMPER23_BIT _PWMPER23.MergedBits.grpBIT

#define PWMPER23_BIT_MASK  65535
#define PWMPER23_BIT_BITNUM  0


/*** PWMPER45 - PWM Channel Period 45 Register; 0x00000318 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMPER4 - PWM Channel Period 4 Register; 0x00000318 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER4STR;
    #define PWMPER4 _PWMPER45.Overlap_STR.PWMPER4STR.Byte
    
    #define PWMPER4_BIT _PWMPER45.Overlap_STR.PWMPER4STR.MergedBits.grpBIT
    
    #define PWMPER4_BIT_MASK  255
    #define PWMPER4_BIT_BITNUM  0


    /*** PWMPER5 - PWM Channel Period 5 Register; 0x00000319 ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER5STR;
    #define PWMPER5 _PWMPER45.Overlap_STR.PWMPER5STR.Byte
    
    #define PWMPER5_BIT _PWMPER45.Overlap_STR.PWMPER5STR.MergedBits.grpBIT
    
    #define PWMPER5_BIT_MASK  255
    #define PWMPER5_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMPER45STR;
extern volatile PWMPER45STR _PWMPER45 @(REG_BASE + 0x00000318);
#define PWMPER45 _PWMPER45.Word
#define PWMPER45_BIT _PWMPER45.MergedBits.grpBIT

#define PWMPER45_BIT_MASK  65535
#define PWMPER45_BIT_BITNUM  0


/*** PWMPER67 - PWM Channel Period 67 Register; 0x0000031A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMPER6 - PWM Channel Period 6 Register; 0x0000031A ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER6STR;
    #define PWMPER6 _PWMPER67.Overlap_STR.PWMPER6STR.Byte
    
    #define PWMPER6_BIT _PWMPER67.Overlap_STR.PWMPER6STR.MergedBits.grpBIT
    
    #define PWMPER6_BIT_MASK  255
    #define PWMPER6_BIT_BITNUM  0


    /*** PWMPER7 - PWM Channel Period 7 Register; 0x0000031B ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMPER7STR;
    #define PWMPER7 _PWMPER67.Overlap_STR.PWMPER7STR.Byte
    
    #define PWMPER7_BIT _PWMPER67.Overlap_STR.PWMPER7STR.MergedBits.grpBIT
    
    #define PWMPER7_BIT_MASK  255
    #define PWMPER7_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMPER67STR;
extern volatile PWMPER67STR _PWMPER67 @(REG_BASE + 0x0000031A);
#define PWMPER67 _PWMPER67.Word
#define PWMPER67_BIT _PWMPER67.MergedBits.grpBIT

#define PWMPER67_BIT_MASK  65535
#define PWMPER67_BIT_BITNUM  0


/*** PWMDTY01 - PWM Channel Duty 01 Register; 0x0000031C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMDTY0 - PWM Channel Duty 0 Register; 0x0000031C ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMDTY0STR;
    #define PWMDTY0 _PWMDTY01.Overlap_STR.PWMDTY0STR.Byte
    
    /* PWMDTY_ARR: Access 8 PWMDTYx registers in a array */
    #define PWMDTY_ARR ((Byte *) &PWMDTY0)
    #define PWMDTY0_BIT _PWMDTY01.Overlap_STR.PWMDTY0STR.MergedBits.grpBIT
    
    #define PWMDTY0_BIT_MASK  255
    #define PWMDTY0_BIT_BITNUM  0


    /*** PWMDTY1 - PWM Channel Duty 1 Register; 0x0000031D ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMDTY1STR;
    #define PWMDTY1 _PWMDTY01.Overlap_STR.PWMDTY1STR.Byte
    
    #define PWMDTY1_BIT _PWMDTY01.Overlap_STR.PWMDTY1STR.MergedBits.grpBIT
    
    #define PWMDTY1_BIT_MASK  255
    #define PWMDTY1_BIT_BITNUM  0

  } Overlap_STR;

  struct {
    word grpBIT  :16;
  } MergedBits;
} PWMDTY01STR;
extern volatile PWMDTY01STR _PWMDTY01 @(REG_BASE + 0x0000031C);
#define PWMDTY01 _PWMDTY01.Word
#define PWMDTY01_BIT _PWMDTY01.MergedBits.grpBIT

#define PWMDTY01_BIT_MASK  65535
#define PWMDTY01_BIT_BITNUM  0


/*** PWMDTY23 - PWM Channel Duty 23 Register; 0x0000031E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWMDTY2 - PWM Channel Duty 2 Register; 0x0000031E ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMDTY2STR;
    #define PWMDTY2 _PWMDTY23.Overlap_STR.PWMDTY2STR.Byte
    
    #define PWMDTY2_BIT _PWMDTY23.Overlap_STR.PWMDTY2STR.MergedBits.grpBIT
    
    #define PWMDTY2_BIT_MASK  255
    #define PWMDTY2_BIT_BITNUM  0


    /*** PWMDTY3 - PWM Channel Duty 3 Register; 0x0000031F ***/
    union {
      byte Byte;
      struct {
        byte grpBIT :8;
      } MergedBits;
    } PWMDTY3STR;
    #define PWMDTY3 _PWMDTY23.Overlap_STR.PWMDTY3STR.Byte
    
