frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
/*** PITMUX - PIT Multiplex Register; 0x00000343 ***/
typedef union {
  byte Byte;
  struct {
    byte PMUX0       :1;                                       /* PIT Multiplex Bits for Timer Channel 0 */
    byte PMUX1       :1;                                       /* PIT Multiplex Bits for Timer Channel 1 */
    byte PMUX2       :1;                                       /* PIT Multiplex Bits for Timer Channel 2 */
    byte PMUX3       :1;                                       /* PIT Multiplex Bits for Timer Channel 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPMUX :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PITMUXSTR;
extern volatile PITMUXSTR _PITMUX @(REG_BASE + 0x00000343);
#define PITMUX _PITMUX.Byte
#define PITMUX_PMUX0 _PITMUX.Bits.PMUX0
#define PITMUX_PMUX1 _PITMUX.Bits.PMUX1
#define PITMUX_PMUX2 _PITMUX.Bits.PMUX2
#define PITMUX_PMUX3 _PITMUX.Bits.PMUX3
#define PITMUX_PMUX _PITMUX.MergedBits.grpPMUX

#define PITMUX_PMUX0_MASK   1
#define PITMUX_PMUX1_MASK   2
#define PITMUX_PMUX2_MASK   4
#define PITMUX_PMUX3_MASK   8
#define PITMUX_PMUX_MASK  15
#define PITMUX_PMUX_BITNUM  0


/*** PITINTE - PIT Interrupt Enable Register; 0x00000344 ***/
typedef union {
  byte Byte;
  struct {
    byte PINTE0      :1;                                       /* PIT Time-out Interrupt Enable Bits for Timer Channel 0 */
    byte PINTE1      :1;                                       /* PIT Time-out Interrupt Enable Bits for Timer Channel 1 */
    byte PINTE2      :1;                                       /* PIT Time-out Interrupt Enable Bits for Timer Channel 2 */
    byte PINTE3      :1;                                       /* PIT Time-out Interrupt Enable Bits for Timer Channel 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPINTE :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PITINTESTR;
extern volatile PITINTESTR _PITINTE @(REG_BASE + 0x00000344);
#define PITINTE _PITINTE.Byte
#define PITINTE_PINTE0 _PITINTE.Bits.PINTE0
#define PITINTE_PINTE1 _PITINTE.Bits.PINTE1
#define PITINTE_PINTE2 _PITINTE.Bits.PINTE2
#define PITINTE_PINTE3 _PITINTE.Bits.PINTE3
#define PITINTE_PINTE _PITINTE.MergedBits.grpPINTE

#define PITINTE_PINTE0_MASK   1
#define PITINTE_PINTE1_MASK   2
#define PITINTE_PINTE2_MASK   4
#define PITINTE_PINTE3_MASK   8
#define PITINTE_PINTE_MASK  15
#define PITINTE_PINTE_BITNUM  0


/*** PITTF - PIT Time-out Flag Register; 0x00000345 ***/
typedef union {
  byte Byte;
  struct {
    byte PTF0        :1;                                       /* PIT Time-out Flag Bits for Timer Channel 0 */
    byte PTF1        :1;                                       /* PIT Time-out Flag Bits for Timer Channel 1 */
    byte PTF2        :1;                                       /* PIT Time-out Flag Bits for Timer Channel 2 */
    byte PTF3        :1;                                       /* PIT Time-out Flag Bits for Timer Channel 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTF  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PITTFSTR;
extern volatile PITTFSTR _PITTF @(REG_BASE + 0x00000345);
#define PITTF _PITTF.Byte
#define PITTF_PTF0 _PITTF.Bits.PTF0
#define PITTF_PTF1 _PITTF.Bits.PTF1
#define PITTF_PTF2 _PITTF.Bits.PTF2
#define PITTF_PTF3 _PITTF.Bits.PTF3
#define PITTF_PTF _PITTF.MergedBits.grpPTF

#define PITTF_PTF0_MASK   1
#define PITTF_PTF1_MASK   2
#define PITTF_PTF2_MASK   4
#define PITTF_PTF3_MASK   8
#define PITTF_PTF_MASK  15
#define PITTF_PTF_BITNUM  0


/*** PITMTLD0 - PIT Micro Timer Load Register 0; 0x00000346 ***/
typedef union {
  byte Byte;
  struct {
    byte PMTLD0      :1;                                       /* PIT Micro Timer Load Bit 0 */
    byte PMTLD1      :1;                                       /* PIT Micro Timer Load Bit 1 */
    byte PMTLD2      :1;                                       /* PIT Micro Timer Load Bit 2 */
    byte PMTLD3      :1;                                       /* PIT Micro Timer Load Bit 3 */
    byte PMTLD4      :1;                                       /* PIT Micro Timer Load Bit 4 */
    byte PMTLD5      :1;                                       /* PIT Micro Timer Load Bit 5 */
    byte PMTLD6      :1;                                       /* PIT Micro Timer Load Bit 6 */
    byte PMTLD7      :1;                                       /* PIT Micro Timer Load Bit 7 */
  } Bits;
  struct {
    byte grpPMTLD :8;
  } MergedBits;
} PITMTLD0STR;
extern volatile PITMTLD0STR _PITMTLD0 @(REG_BASE + 0x00000346);
#define PITMTLD0 _PITMTLD0.Byte
#define PITMTLD0_PMTLD0 _PITMTLD0.Bits.PMTLD0
#define PITMTLD0_PMTLD1 _PITMTLD0.Bits.PMTLD1
#define PITMTLD0_PMTLD2 _PITMTLD0.Bits.PMTLD2
#define PITMTLD0_PMTLD3 _PITMTLD0.Bits.PMTLD3
#define PITMTLD0_PMTLD4 _PITMTLD0.Bits.PMTLD4
#define PITMTLD0_PMTLD5 _PITMTLD0.Bits.PMTLD5
#define PITMTLD0_PMTLD6 _PITMTLD0.Bits.PMTLD6
#define PITMTLD0_PMTLD7 _PITMTLD0.Bits.PMTLD7
/* PITMTLD_ARR: Access 2 PITMTLDx registers in a array */
#define PITMTLD_ARR ((Byte *) &PITMTLD0)
#define PITMTLD0_PMTLD _PITMTLD0.MergedBits.grpPMTLD

#define PITMTLD0_PMTLD0_MASK   1
#define PITMTLD0_PMTLD1_MASK   2
#define PITMTLD0_PMTLD2_MASK   4
#define PITMTLD0_PMTLD3_MASK   8
#define PITMTLD0_PMTLD4_MASK   16
#define PITMTLD0_PMTLD5_MASK   32
#define PITMTLD0_PMTLD6_MASK   64
#define PITMTLD0_PMTLD7_MASK   128
#define PITMTLD0_PMTLD_MASK  255
#define PITMTLD0_PMTLD_BITNUM  0


/*** PITMTLD1 - PIT Micro Timer Load Register 1; 0x00000347 ***/
typedef union {
  byte Byte;
  struct {
    byte PMTLD0      :1;                                       /* PIT Micro Timer Load Bit 0 */
    byte PMTLD1      :1;                                       /* PIT Micro Timer Load Bit 1 */
    byte PMTLD2      :1;                                       /* PIT Micro Timer Load Bit 2 */
    byte PMTLD3      :1;                                       /* PIT Micro Timer Load Bit 3 */
    byte PMTLD4      :1;                                       /* PIT Micro Timer Load Bit 4 */
    byte PMTLD5      :1;                                       /* PIT Micro Timer Load Bit 5 */
    byte PMTLD6      :1;                                       /* PIT Micro Timer Load Bit 6 */
    byte PMTLD7      :1;                                       /* PIT Micro Timer Load Bit 7 */
  } Bits;
  struct {
    byte grpPMTLD :8;
  } MergedBits;
} PITMTLD1STR;
extern volatile PITMTLD1STR _PITMTLD1 @(REG_BASE + 0x00000347);
#define PITMTLD1 _PITMTLD1.Byte
#define PITMTLD1_PMTLD0 _PITMTLD1.Bits.PMTLD0
#define PITMTLD1_PMTLD1 _PITMTLD1.Bits.PMTLD1
#define PITMTLD1_PMTLD2 _PITMTLD1.Bits.PMTLD2
#define PITMTLD1_PMTLD3 _PITMTLD1.Bits.PMTLD3
#define PITMTLD1_PMTLD4 _PITMTLD1.Bits.PMTLD4
#define PITMTLD1_PMTLD5 _PITMTLD1.Bits.PMTLD5
#define PITMTLD1_PMTLD6 _PITMTLD1.Bits.PMTLD6
#define PITMTLD1_PMTLD7 _PITMTLD1.Bits.PMTLD7
#define PITMTLD1_PMTLD _PITMTLD1.MergedBits.grpPMTLD

#define PITMTLD1_PMTLD0_MASK   1
#define PITMTLD1_PMTLD1_MASK   2
#define PITMTLD1_PMTLD2_MASK   4
#define PITMTLD1_PMTLD3_MASK   8
#define PITMTLD1_PMTLD4_MASK   16
#define PITMTLD1_PMTLD5_MASK   32
#define PITMTLD1_PMTLD6_MASK   64
#define PITMTLD1_PMTLD7_MASK   128
#define PITMTLD1_PMTLD_MASK  255
#define PITMTLD1_PMTLD_BITNUM  0


/*** PITLD0 - PIT Load Register 0; 0x00000348 ***/
typedef union {
  word Word;
  struct {
    word PLD0        :1;                                       /* PIT Load Bit 0 */
    word PLD1        :1;                                       /* PIT Load Bit 1 */
    word PLD2        :1;                                       /* PIT Load Bit 2 */
    word PLD3        :1;                                       /* PIT Load Bit 3 */
    word PLD4        :1;                                       /* PIT Load Bit 4 */
    word PLD5        :1;                                       /* PIT Load Bit 5 */
    word PLD6        :1;                                       /* PIT Load Bit 6 */
    word PLD7        :1;                                       /* PIT Load Bit 7 */
    word PLD8        :1;                                       /* PIT Load Bit 8 */
    word PLD9        :1;                                       /* PIT Load Bit 9 */
    word PLD10       :1;                                       /* PIT Load Bit 10 */
    word PLD11       :1;                                       /* PIT Load Bit 11 */
    word PLD12       :1;                                       /* PIT Load Bit 12 */
    word PLD13       :1;                                       /* PIT Load Bit 13 */
    word PLD14       :1;                                       /* PIT Load Bit 14 */
    word PLD15       :1;                                       /* PIT Load Bit 15 */
  } Bits;
  struct {
    word grpPLD  :16;
  } MergedBits;
} PITLD0STR;
extern volatile PITLD0STR _PITLD0 @(REG_BASE + 0x00000348);
#define PITLD0 _PITLD0.Word
#define PITLD0_PLD0 _PITLD0.Bits.PLD0
#define PITLD0_PLD1 _PITLD0.Bits.PLD1
#define PITLD0_PLD2 _PITLD0.Bits.PLD2
#define PITLD0_PLD3 _PITLD0.Bits.PLD3
#define PITLD0_PLD4 _PITLD0.Bits.PLD4
#define PITLD0_PLD5 _PITLD0.Bits.PLD5
#define PITLD0_PLD6 _PITLD0.Bits.PLD6
#define PITLD0_PLD7 _PITLD0.Bits.PLD7
#define PITLD0_PLD8 _PITLD0.Bits.PLD8
#define PITLD0_PLD9 _PITLD0.Bits.PLD9
#define PITLD0_PLD10 _PITLD0.Bits.PLD10
#define PITLD0_PLD11 _PITLD0.Bits.PLD11
#define PITLD0_PLD12 _PITLD0.Bits.PLD12
#define PITLD0_PLD13 _PITLD0.Bits.PLD13
#define PITLD0_PLD14 _PITLD0.Bits.PLD14
#define PITLD0_PLD15 _PITLD0.Bits.PLD15
#define PITLD0_PLD _PITLD0.MergedBits.grpPLD

