frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
/*** XGIF5 - XGATE Channel Interrupt Flag Vector 5; 0x00000392 ***/
typedef union {
  word Word;
  struct {
    word XGIF_20     :1;                                       /* Channel Interrupt Flag 20 */
    word XGIF_21     :1;                                       /* Channel Interrupt Flag 21 */
    word XGIF_22     :1;                                       /* Channel Interrupt Flag 22 */
    word XGIF_23     :1;                                       /* Channel Interrupt Flag 23 */
    word XGIF_24     :1;                                       /* Channel Interrupt Flag 24 */
    word XGIF_25     :1;                                       /* Channel Interrupt Flag 25 */
    word XGIF_26     :1;                                       /* Channel Interrupt Flag 26 */
    word XGIF_27     :1;                                       /* Channel Interrupt Flag 27 */
    word XGIF_28     :1;                                       /* Channel Interrupt Flag 28 */
    word XGIF_29     :1;                                       /* Channel Interrupt Flag 29 */
    word XGIF_2A     :1;                                       /* Channel Interrupt Flag 2A */
    word XGIF_2B     :1;                                       /* Channel Interrupt Flag 2B */
    word XGIF_2C     :1;                                       /* Channel Interrupt Flag 2C */
    word XGIF_2D     :1;                                       /* Channel Interrupt Flag 2D */
    word XGIF_2E     :1;                                       /* Channel Interrupt Flag 2E */
    word XGIF_2F     :1;                                       /* Channel Interrupt Flag 2F */
  } Bits;
  struct {
    word grpXGIF__20 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF5STR;
extern volatile XGIF5STR _XGIF5 @(REG_BASE + 0x00000392);
#define XGIF5 _XGIF5.Word
#define XGIF5_XGIF_20 _XGIF5.Bits.XGIF_20
#define XGIF5_XGIF_21 _XGIF5.Bits.XGIF_21
#define XGIF5_XGIF_22 _XGIF5.Bits.XGIF_22
#define XGIF5_XGIF_23 _XGIF5.Bits.XGIF_23
#define XGIF5_XGIF_24 _XGIF5.Bits.XGIF_24
#define XGIF5_XGIF_25 _XGIF5.Bits.XGIF_25
#define XGIF5_XGIF_26 _XGIF5.Bits.XGIF_26
#define XGIF5_XGIF_27 _XGIF5.Bits.XGIF_27
#define XGIF5_XGIF_28 _XGIF5.Bits.XGIF_28
#define XGIF5_XGIF_29 _XGIF5.Bits.XGIF_29
#define XGIF5_XGIF_2A _XGIF5.Bits.XGIF_2A
#define XGIF5_XGIF_2B _XGIF5.Bits.XGIF_2B
#define XGIF5_XGIF_2C _XGIF5.Bits.XGIF_2C
#define XGIF5_XGIF_2D _XGIF5.Bits.XGIF_2D
#define XGIF5_XGIF_2E _XGIF5.Bits.XGIF_2E
#define XGIF5_XGIF_2F _XGIF5.Bits.XGIF_2F
#define XGIF5_XGIF__20 _XGIF5.MergedBits.grpXGIF__20
#define XGIF5_XGIF_ XGIF5_XGIF__20

#define XGIF5_XGIF_20_MASK   1
#define XGIF5_XGIF_21_MASK   2
#define XGIF5_XGIF_22_MASK   4
#define XGIF5_XGIF_23_MASK   8
#define XGIF5_XGIF_24_MASK   16
#define XGIF5_XGIF_25_MASK   32
#define XGIF5_XGIF_26_MASK   64
#define XGIF5_XGIF_27_MASK   128
#define XGIF5_XGIF_28_MASK   256
#define XGIF5_XGIF_29_MASK   512
#define XGIF5_XGIF_2A_MASK   1024
#define XGIF5_XGIF_2B_MASK   2048
#define XGIF5_XGIF_2C_MASK   4096
#define XGIF5_XGIF_2D_MASK   8192
#define XGIF5_XGIF_2E_MASK   16384
#define XGIF5_XGIF_2F_MASK   32768
#define XGIF5_XGIF__20_MASK  1023
#define XGIF5_XGIF__20_BITNUM  0


/*** XGIF6 - XGATE Channel Interrupt Flag Vector 6; 0x00000394 ***/
typedef union {
  word Word;
  struct {
    word XGIF_10     :1;                                       /* Channel Interrupt Flag 10 */
    word XGIF_11     :1;                                       /* Channel Interrupt Flag 11 */
    word XGIF_12     :1;                                       /* Channel Interrupt Flag 12 */
    word XGIF_13     :1;                                       /* Channel Interrupt Flag 13 */
    word XGIF_14     :1;                                       /* Channel Interrupt Flag 14 */
    word XGIF_15     :1;                                       /* Channel Interrupt Flag 15 */
    word XGIF_16     :1;                                       /* Channel Interrupt Flag 16 */
    word XGIF_17     :1;                                       /* Channel Interrupt Flag 17 */
    word XGIF_18     :1;                                       /* Channel Interrupt Flag 18 */
    word XGIF_19     :1;                                       /* Channel Interrupt Flag 19 */
    word XGIF_1A     :1;                                       /* Channel Interrupt Flag 1A */
    word XGIF_1B     :1;                                       /* Channel Interrupt Flag 1B */
    word XGIF_1C     :1;                                       /* Channel Interrupt Flag 1C */
    word XGIF_1D     :1;                                       /* Channel Interrupt Flag 1D */
    word XGIF_1E     :1;                                       /* Channel Interrupt Flag 1E */
    word XGIF_1F     :1;                                       /* Channel Interrupt Flag 1F */
  } Bits;
  struct {
    word grpXGIF__10 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF6STR;
extern volatile XGIF6STR _XGIF6 @(REG_BASE + 0x00000394);
#define XGIF6 _XGIF6.Word
#define XGIF6_XGIF_10 _XGIF6.Bits.XGIF_10
#define XGIF6_XGIF_11 _XGIF6.Bits.XGIF_11
#define XGIF6_XGIF_12 _XGIF6.Bits.XGIF_12
#define XGIF6_XGIF_13 _XGIF6.Bits.XGIF_13
#define XGIF6_XGIF_14 _XGIF6.Bits.XGIF_14
#define XGIF6_XGIF_15 _XGIF6.Bits.XGIF_15
#define XGIF6_XGIF_16 _XGIF6.Bits.XGIF_16
#define XGIF6_XGIF_17 _XGIF6.Bits.XGIF_17
#define XGIF6_XGIF_18 _XGIF6.Bits.XGIF_18
#define XGIF6_XGIF_19 _XGIF6.Bits.XGIF_19
#define XGIF6_XGIF_1A _XGIF6.Bits.XGIF_1A
#define XGIF6_XGIF_1B _XGIF6.Bits.XGIF_1B
#define XGIF6_XGIF_1C _XGIF6.Bits.XGIF_1C
#define XGIF6_XGIF_1D _XGIF6.Bits.XGIF_1D
#define XGIF6_XGIF_1E _XGIF6.Bits.XGIF_1E
#define XGIF6_XGIF_1F _XGIF6.Bits.XGIF_1F
#define XGIF6_XGIF__10 _XGIF6.MergedBits.grpXGIF__10
#define XGIF6_XGIF_ XGIF6_XGIF__10

#define XGIF6_XGIF_10_MASK   1
#define XGIF6_XGIF_11_MASK   2
#define XGIF6_XGIF_12_MASK   4
#define XGIF6_XGIF_13_MASK   8
#define XGIF6_XGIF_14_MASK   16
#define XGIF6_XGIF_15_MASK   32
#define XGIF6_XGIF_16_MASK   64
#define XGIF6_XGIF_17_MASK   128
#define XGIF6_XGIF_18_MASK   256
#define XGIF6_XGIF_19_MASK   512
#define XGIF6_XGIF_1A_MASK   1024
#define XGIF6_XGIF_1B_MASK   2048
#define XGIF6_XGIF_1C_MASK   4096
#define XGIF6_XGIF_1D_MASK   8192
#define XGIF6_XGIF_1E_MASK   16384
#define XGIF6_XGIF_1F_MASK   32768
#define XGIF6_XGIF__10_MASK  1023
#define XGIF6_XGIF__10_BITNUM  0


/*** XGIF7 - XGATE Channel Interrupt Flag Vector 7; 0x00000396 ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word XGIF_09     :1;                                       /* Channel Interrupt Flag 09 */
    word XGIF_0A     :1;                                       /* Channel Interrupt Flag 0A */
    word XGIF_0B     :1;                                       /* Channel Interrupt Flag 0B */
    word XGIF_0C     :1;                                       /* Channel Interrupt Flag 0C */
    word XGIF_0D     :1;                                       /* Channel Interrupt Flag 0D */
    word XGIF_0E     :1;                                       /* Channel Interrupt Flag 0E */
    word XGIF_0F     :1;                                       /* Channel Interrupt Flag 0F */
  } Bits;
} XGIF7STR;
extern volatile XGIF7STR _XGIF7 @(REG_BASE + 0x00000396);
#define XGIF7 _XGIF7.Word
#define XGIF7_XGIF_09 _XGIF7.Bits.XGIF_09
#define XGIF7_XGIF_0A _XGIF7.Bits.XGIF_0A
#define XGIF7_XGIF_0B _XGIF7.Bits.XGIF_0B
#define XGIF7_XGIF_0C _XGIF7.Bits.XGIF_0C
#define XGIF7_XGIF_0D _XGIF7.Bits.XGIF_0D
#define XGIF7_XGIF_0E _XGIF7.Bits.XGIF_0E
#define XGIF7_XGIF_0F _XGIF7.Bits.XGIF_0F

#define XGIF7_XGIF_09_MASK   512
#define XGIF7_XGIF_0A_MASK   1024
#define XGIF7_XGIF_0B_MASK   2048
#define XGIF7_XGIF_0C_MASK   4096
#define XGIF7_XGIF_0D_MASK   8192
#define XGIF7_XGIF_0E_MASK   16384
#define XGIF7_XGIF_0F_MASK   32768


/*** XGSWT - XGATE Software Trigger Register; 0x00000398 ***/
typedef union {
  word Word;
  struct {
    word XGSWT       :8;                                       /* Software Trigger Bits */
    word XGSWTM      :8;                                       /* Software Trigger Mask */
  } Bits;
} XGSWTSTR;
extern volatile XGSWTSTR _XGSWT @(REG_BASE + 0x00000398);
#define XGSWT _XGSWT.Word
#define XGSWT_XGSWT _XGSWT.Bits.XGSWT
#define XGSWT_XGSWTM _XGSWT.Bits.XGSWTM

#define XGSWT_XGSWT_MASK   255
#define XGSWT_XGSWT_BITNUM 0
#define XGSWT_XGSWTM_MASK   65280
#define XGSWT_XGSWTM_BITNUM 8


