frostfire45/Codewarrior/Lib/hc12c/old/v4.0/mc9s12xdt512.h
/*** XGSEM - XGATE Semaphore Register; 0x0000039A ***/
typedef union {
  word Word;
  struct {
    word XGSEM       :8;                                       /* Semaphore Mask */
    word XGSEMM      :8;                                       /* Semaphore Bits */
  } Bits;
} XGSEMSTR;
extern volatile XGSEMSTR _XGSEM @(REG_BASE + 0x0000039A);
#define XGSEM _XGSEM.Word
#define XGSEM_XGSEM _XGSEM.Bits.XGSEM
#define XGSEM_XGSEMM _XGSEM.Bits.XGSEMM

#define XGSEM_XGSEM_MASK   255
#define XGSEM_XGSEM_BITNUM 0
#define XGSEM_XGSEMM_MASK   65280
#define XGSEM_XGSEMM_BITNUM 8


/*** XGPC - XGATE Program Counter Register; 0x0000039E ***/
typedef union {
  word Word;
  struct {
    word XGPC        :16;                                      /* Program Counter */
  } Bits;
} XGPCSTR;
extern volatile XGPCSTR _XGPC @(REG_BASE + 0x0000039E);
#define XGPC _XGPC.Word
#define XGPC_XGPC _XGPC.Bits.XGPC

#define XGPC_XGPC_MASK   65535
#define XGPC_XGPC_BITNUM 0


/*** XGR1 - XGATE Register 1; 0x000003A2 ***/
typedef union {
  word Word;
  struct {
    word XGR1        :16;                                      /* R1 */
  } Bits;
} XGR1STR;
extern volatile XGR1STR _XGR1 @(REG_BASE + 0x000003A2);
#define XGR1 _XGR1.Word
#define XGR1_XGR1 _XGR1.Bits.XGR1

#define XGR1_XGR1_MASK   65535
#define XGR1_XGR1_BITNUM 0


/*** XGR2 - XGATE Register 2; 0x000003A4 ***/
typedef union {
  word Word;
  struct {
    word XGR2        :16;                                      /* R2 */
  } Bits;
} XGR2STR;
extern volatile XGR2STR _XGR2 @(REG_BASE + 0x000003A4);
#define XGR2 _XGR2.Word
#define XGR2_XGR2 _XGR2.Bits.XGR2

#define XGR2_XGR2_MASK   65535
#define XGR2_XGR2_BITNUM 0


/*** XGR3 - XGATE Register 3; 0x000003A6 ***/
typedef union {
  word Word;
  struct {
    word XGR3        :16;                                      /* R3 */
  } Bits;
} XGR3STR;
extern volatile XGR3STR _XGR3 @(REG_BASE + 0x000003A6);
#define XGR3 _XGR3.Word
#define XGR3_XGR3 _XGR3.Bits.XGR3

#define XGR3_XGR3_MASK   65535
#define XGR3_XGR3_BITNUM 0


/*** XGR4 - XGATE Register 4; 0x000003A8 ***/
typedef union {
  word Word;
  struct {
    word XGR4        :16;                                      /* R4 */
  } Bits;
} XGR4STR;
extern volatile XGR4STR _XGR4 @(REG_BASE + 0x000003A8);
#define XGR4 _XGR4.Word
#define XGR4_XGR4 _XGR4.Bits.XGR4

#define XGR4_XGR4_MASK   65535
#define XGR4_XGR4_BITNUM 0


/*** XGR5 - XGATE Register 5; 0x000003AA ***/
typedef union {
  word Word;
  struct {
    word XGR5        :16;                                      /* R5 */
  } Bits;
} XGR5STR;
extern volatile XGR5STR _XGR5 @(REG_BASE + 0x000003AA);
#define XGR5 _XGR5.Word
#define XGR5_XGR5 _XGR5.Bits.XGR5

#define XGR5_XGR5_MASK   65535
#define XGR5_XGR5_BITNUM 0


/*** XGR6 - XGATE Register 6; 0x000003AC ***/
typedef union {
  word Word;
  struct {
    word XGR6        :16;                                      /* R6 */
  } Bits;
} XGR6STR;
extern volatile XGR6STR _XGR6 @(REG_BASE + 0x000003AC);
#define XGR6 _XGR6.Word
#define XGR6_XGR6 _XGR6.Bits.XGR6

#define XGR6_XGR6_MASK   65535
#define XGR6_XGR6_BITNUM 0


/*** XGR7 - XGATE Register 7; 0x000003AE ***/
typedef union {
  word Word;
  struct {
    word XGR7        :16;                                      /* R7 */
  } Bits;
} XGR7STR;
extern volatile XGR7STR _XGR7 @(REG_BASE + 0x000003AE);
#define XGR7 _XGR7.Word
#define XGR7_XGR7 _XGR7.Bits.XGR7

#define XGR7_XGR7_MASK   65535
#define XGR7_XGR7_BITNUM 0

/* XGR_ARR: Access 7 XGRx registers in a array */
#define XGR_ARR ((Word *) &XGR1)

  /* Watchdog reset macro */
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() {asm sta COPCTL;}  /* Just write a byte to feed the dog */
#endif


#endif

